[
  [
    1,
    "Which of the following would MOST likely be used to connect one or more devices to the Internet in a SOHO?\n",
    [
      ["A. Hub", "B. Ethernet gateway", "C. Wireless access point", "D. Router"]
    ],
    "Answer : C\n\nReference:\nhttps://www.professormesser.com/free-a-plus-training/220-1001/installing-a-soho-network/\n"
  ],
  [
    4,
    "A technician is troubleshooting what appears to be a RAM issue on a PC. Which of the following symptoms would indicate if this is a RAM issue?\n",
    [
      [
        "A. POST code beeps",
        "B. Distended capacitors",
        "C. Continuous reboots",
        "D. Wrong BIOS time"
      ]
    ],
    "Answer : C"
  ],
  [
    5,
    "A user accidentally spills liquid on a laptop. The user wants the device to be fixed and would like to know how much it will cost.\nWhich of the following steps should the technician take NEXT to verify if the device is repairable before committing to a price? (Choose two.)\n",
    [
      [
        "A. Remove the case and organize the parts.",
        "B. Document the screw locations.",
        "C. Search the Internet for repair tutorials.",
        "D. Consult colleagues for advice.",
        "E. Place the device in rice for a few days."
      ]
    ],
    "Answer : AB"
  ],
  [
    6,
    "Which of the following peripherals would a company use to take inventory quickly and update price tags for products? (Choose two.)\n",
    [
      [
        "A. Barcode scanner",
        "B. Label printer",
        "C. Magnetic reader",
        "D. KVM switch",
        "E. NFC device",
        "F. Flatbed scanner"
      ]
    ],
    "Answer : AC"
  ],
  [
    7,
    "A user wants to print a large job on both the front and back sides of the paper.\nWhich of the following settings should the technician advise the user to change in the printer settings?\n",
    [["A. Collate", "B. Orientation", "C. Duplex", "D. Transparency"]],
    "Answer : C"
  ],
  [
    8,
    "A user is unable to access websites and has reported connectivity issues with pop-ups on the screen. A technician removes malware, and then is able to ping the router and access the websites.\nWhich of the following NEXT steps should the technician perform in troubleshooting this issue? (Choose two.)\n",
    [
      [
        "A. Document findings, actions, and outcomes.",
        "B. Reboot the device to verify the fix.",
        "C. Reconnect the device to the network.",
        "D. Verify the settings in IPConfig.",
        "E. Research the problem based on symptoms.",
        "F. Run a virus scan."
      ]
    ],
    "Answer : AF"
  ],
  [
    9,
    "A user is no longer able to browse the Internet after returning from vacation. The user is able to log in and navigate to the local intranet, but not to any outside sites. A technician pings a well-known website by name but gets no reply. The technician then pings its IP address and gets a reply.\nWhich of the following commands will MOST likely resolve the issue?\n",
    [
      [
        "A. ipconfig /all",
        "B. ipconfig /flushdns",
        "C. ipconfig /release",
        "D. ipconfig /setclassid"
      ]
    ],
    "Answer : B"
  ],
  [
    10,
    "A technician is determining the specifications for a desktop computer that will be used at trade shows all over the world. The computer will have the maximum amount of RAM. The CPU, GPU, and storage will be typical of a business workstation.\nWhich of the following system parameters is the MOST important for the technician to consider when choosing a power supply?\n",
    [
      [
        "A. Input voltage",
        "B. Efficiency rating",
        "C. 12V rail amperage",
        "D. Number of SATA connectors"
      ]
    ],
    "Answer : A"
  ],
  [
    11,
    "Ann, an accountant, reports that after turning on her new laptop, she received a message stating her IP address is already in use on the system. She tried going back to her old desktop, which she now only uses for email, but received the same message. The technician checks the account and sees a comment that Ann requires a special network setup to connect to the banking software. Which of the following should the technician do to resolve the issue?\n",
    [
      [
        "A. Remove the static IP configuration from the desktop.",
        "B. Set the laptop configuration to DHCP to prevent conflicts.",
        "C. Replace the network card in the laptop, as it may be defective.",
        "D. Bridge the LAN connection between the laptop and the desktop."
      ]
    ],
    "Answer : B"
  ],
  [
    12,
    "\nA customer wants to purchase a new home computer. The machine will mainly be used for Internet browsing and streaming video, except on weekends when the customerג€™s son will use it to play games with friends.\nWhich of the following should the technician focus on to meet these requirements? (Choose two.)\n",
    [
      [
        "A. 80mm case fans",
        "B. Four-core processor",
        "C. RAID 5 array",
        "D. 16GB DDR2 memory",
        "E. Dual monitors",
        "F. Encrypted hard drive"
      ]
    ],
    "Answer : BD"
  ],
  [
    13,
    "Which of the following cable types should be used to connect a cable modem to a SOHO router?\n",
    [["A. Thunderbolt", "B. Coaxial", "C. USB", "D. Ethernet"]],
    "Answer : D"
  ],
  [
    14,
    "Which of the following channels would commonly be used on an 802.11 wireless network?\n",
    [["A. 6", "B. 17", "C. 802", "D. 8080"]],
    "Answer : A"
  ],
  [
    15,
    "A technician is troubleshooting a Windows CAD workstation that is running slow. The computer uses RAID 10 and has dual GPU cards. The user states that the same application runs faster on an identical workstation.\nWhich of the following should the technician perform FIRST to troubleshoot the problem?\n",
    [
      [
        "A. Replace the write cache battery.",
        "B. Check the event log for any cache issues.",
        "C. Clear the RAID configuration file and restart the PC.",
        "D. Replace the RAID controller write cache module."
      ]
    ],
    "Answer : B"
  ],
  [
    16,
    "A business owner wants to provide security to laptop users with the ability to charge their devices, access corporate LAN resources, and allow for a variety of other removable hardware.\nWhich of the following devices would BEST meet the ownerג€™s needs?\n",
    [
      [
        "A. Docking station",
        "B. Port replicator",
        "C. Thunderbolt",
        "D. USB hub"
      ]
    ],
    "Answer : A"
  ],
  [
    17,
    "A technician has noticed that when at company headquarters the laptop connection to the Internet is more responsive than when using the company-provided phone as a hotspot. The technician updated the drivers on the WiFi NIC without resolution and then verified the configuration on the WiFi was correct.\nWhich of the following configurations could cause the decreased performance?\n",
    [
      [
        "A. The connection is throttled.",
        "B. There is a low RFID signal.",
        "C. SSID is not found.",
        "D. It is out of range."
      ]
    ],
    "Answer : A"
  ],
  [
    18,
    "An associate is seeking advice on which device to purchase for a friend who is a business owner. The friend needs the ability to chart activity while keeping in contact with the home office.\nWhich of the following would be the BEST recommendation?\n",
    [
      [
        "A. Smart watch",
        "B. Fitness monitor",
        "C. Global positioning sensor",
        "D. Portable hotspot"
      ]
    ],
    "Answer : A"
  ],
  [
    19,
    "A technician is replacing a broken screen on a new company laptop but does not have repair information from the vendor.\nWhich of the following is the BEST way to proceed?\n",
    [
      [
        "A. Document and label the cable and screw locations.",
        "B. Replace the screen with a non-OEM.",
        "C. Update the firmware on the device before repairing it.",
        "D. Wait for the vendor to provide more information."
      ]
    ],
    "Answer : A"
  ],
  [
    20,
    "Ann, a user, needs to attend several day-long conferences and wants to ensure her mobile device will have enough power for these events. She is concerned about wall outlet availability at the conferences and needs to continuously use her device for important updates.\nWhich of the following should a technician recommend to BEST accommodate Annג€™s needs?\n",
    [
      [
        "A. Wireless charging pad",
        "B. Built-in battery case",
        "C. Extra charging cords",
        "D. Airplane mode"
      ]
    ],
    "Answer : B"
  ],
  [
    21,
    "Which of the following charging and data ports has a non-directional connector?\n",
    [["A. Micro-USB", "B. Mini-USB", "C. USB-A", "D. USB-C"]],
    "Answer : D"
  ],
  [
    22,
    "A user brings in a smartphone for repair. The device is unable to send/receive calls or connect to WiFi. All applications on the device are working unless they require connectivity.\nWhich of the following is MOST likely causing the problem?\n",
    [["A. Airplane mode", "B. Tethering", "C. Disabled hotspot", "D. VPN"]],
    "Answer : A"
  ],
  [
    23,
    "Which of the following Ethernet cables would BEST support an application that requires a 600Mbps throughput at the lowest price point?\n",
    [["A. Cat 3", "B. Cat 5", "C. Cat 5e", "D. Cat 6"]],
    "Answer : C"
  ],
  [
    24,
    "A client has three locations within city limits that need to be networked. Vendor network requirements for all three locations are a minimum of 1GB.\nWhich of the following are the types of networks that will MOST likely be used for internal office and office-to-office networking? (Choose two.)\n",
    [["A. MAN", "B. LAN", "C. WAN", "D. PAN", "E. SAN", "F. WLAN"]],
    "Answer : AB"
  ],
  [
    25,
    "Which of the following terminates a coaxial cable?\n",
    [["A. DB9", "B. RJ45", "C. RG-59", "D. RS-232"]],
    "Answer : C"
  ],
  [
    26,
    "A customer asks a technician to help set up a specialized computing system for video editing.\nWhich of the following should the technician install on the workstation to BEST meet the customerג€™s specifications? (Choose two.)\n",
    [
      [
        "A. SSD",
        "B. Dual monitors",
        "C. Gigabit NIC",
        "D. Hypervisor",
        "E. Docking station",
        "F. NAS"
      ]
    ],
    "Answer : AB"
  ],
  [
    27,
    "An end user wants to have a second monitor installed on a laptop. Which of the following would allow a technician to configure the laptop to show both screens once the cable is connected?\n",
    [
      [
        "A. Plug an external monitor into the USB port.",
        "B. Use the Fn and function key combination",
        "C. Adjust the monitor display settings.",
        "D. Enable DisplayPort."
      ]
    ],
    "Answer : C"
  ],
  [
    28,
    "A customerג€™s laptop display has suddenly become very dim. The image of the display can only be seen with a bright, external light, as adjusting the brightness/ contrast controls does not cause much change.\nWhich of the following components MOST likely needs to be replaced?\n",
    [["A. LCD panel", "B. Inverter", "C. Video card", "D. Digitizer"]],
    "Answer : B"
  ],
  [
    29,
    "A technician is troubleshooting a laptop/projector combination that is displaying artifacts on the screen. When a different laptop is connected to the projector, the image appears to be correct but is very dim.\nWhich of the following steps should the technician take to address these issues? (Choose two.)\n",
    [
      [
        "A. Update the video drivers on the laptop.",
        "B. Increase the projector contrast.",
        "C. Replace the original laptop.",
        "D. Change the aspect ratio on the projector.",
        "E. Replace the bulb in the projector.",
        "F. Modify the laptopג€™s display resolution. "
      ]
    ],
    "Answer : AB"
  ],
  [
    30,
    "Multiple users report that the network printer, which is connected through the print server, is not printing.\nWhich of the following should a technician do FIRST to remedy this situation?\n",
    [
      [
        "A. Replace the USB cable.",
        "B. Reinstall the drivers on usersג€™ PCs. ",
        "C. Have users restart their PCs.",
        "D. Clear the print queue."
      ]
    ],
    "Answer : D"
  ],
  [
    31,
    "A user reports that a laptop is not connecting to the corporate wireless network. A technician confirms with a smartphone that the corporate wireless network is available and can be accessed. The technician observes that the Ethernet connection to the corporate network is working. The technician disconnects the\nEthernet cable.\nWhich of the following should the technician do NEXT to troubleshoot this problem?\n",
    [
      [
        "A. Confirm that the laptop wireless card is turned on.",
        "B. Confirm that the laptop is in range for the access point.",
        "C. Confirm that the correct wireless network is selected.",
        "D. Confirm the userג€™s network login ID and password. "
      ]
    ],
    "Answer : A"
  ],
  [
    32,
    "Several company users are frequently forgetting passwords for their mobile devices and applications.\nWhich of the following should the systems administrator do to reduce the number of help desk tickets submitted?\n",
    [
      [
        "A. Implement single sign-on.",
        "B. Enable multifactor authentication.",
        "C. Configure biometric authentication.",
        "D. Remove complex password requirements."
      ]
    ],
    "Answer : A"
  ],
  [
    33,
    "Which of the following cloud computing concepts allows scalable services to be provided to the client?\n",
    [
      [
        "A. On-demand",
        "B. Metered",
        "C. Rapid elasticity",
        "D. Resource pooling"
      ]
    ],
    "Answer : C"
  ],
  [
    34,
    "During an inspection, it was found that data racks were not properly grounded. To pass the inspection and address a growing concern to protect data cabling and equipment, a technician must make sure all racks are properly grounded.\nWhich of the following tools should the technician use to verify this has been completed?\n",
    [["A. Multimeter", "B. Cable tester", "C. Tone generator", "D. Voltmeter"]],
    "Answer : A"
  ],
  [
    35,
    "A technician was called to check an unexpected clicking noise on a desktop that has become more frequent every time a video editing application is loaded. The system fans have been replaced, but the clicking noise remains. Diagnostics have been run on the video card.\nWhich of the following should the technician do FIRST?\n",
    [
      [
        "A. Replace the hard drive.",
        "B. Replace the video card.",
        "C. Do a System Restore.",
        "D. Perform a full data backup.",
        "E. Scan the system for viruses."
      ]
    ],
    "Answer : D"
  ],
  [
    36,
    "Joe, a user, has purchased a new mobile device that uses a different OS than his previous one. Joe wants to copy his contacts and appointments from his corporate account without entering them manually.\nWhich of the following would be the BEST way for a technician to assist Joe?\n",
    [
      [
        "A. Log into the same email provider on the new device, and restore the contacts and dates.",
        "B. Create a Bluetooth connection between Joeג€™s devices, and copy his contacts and calendar. ",
        "C. Back up the old mobile device to a PC, and import the contacts and schedule from the PC.",
        "D. Use NFC to transfer all compatible data from one device to the other."
      ]
    ],
    "Answer : A"
  ],
  [
    37,
    "A user reports that printing on heavy cardstock paper results in the image smearing if touched. When printing on plain paper, the problem does not occur.\nWhich of the following would be the NEXT troubleshooting step to perform?\n",
    [
      [
        "A. Increase the fuser temperature.",
        "B. Change the paper feed rate.",
        "C. Clean the transfer roller.",
        "D. Replace the toner cartridge."
      ]
    ],
    "Answer : A"
  ],
  [
    38,
    "A userג€™s laptop is shutting down unexpectedly. The technician discovers the shutdowns only happen when the laptop is moved from one room to another. The technician reseated the hard drive, memory, battery, and LCD cable, but the laptop continues to shut down.\nWhich of the following is the MOST probable cause of the issue?\n",
    [
      [
        "A. Residual energy on the motherboard",
        "B. System overheating",
        "C. Distended capacitors",
        "D. Loose battery connection",
        "E. CMOS battery failure"
      ]
    ],
    "Answer : D"
  ],
  [
    39,
    "An end user has signed up to use a web-based calendar application.\nWhich of the following solutions has the user purchased?\n",
    [["A. DaaS", "B. SaaS", "C. PaaS", "D. IaaS"]],
    "Answer : B"
  ],
  [
    40,
    "A technician is setting up a WiFi-enabled thermostat for a customer, but the customer is concerned about IoT devices getting hacked.\nWhich of the following BEST address the customerג€™s concerns? (Choose two.)\n",
    [
      [
        "A. Use the latest encryption standard on the wireless network and set a strong password.",
        "B. Enable two-factor authentication for the IoT deviceג€™s cloud account, if it is available.",
        "C. Separate the IoT thermostat by segregating it in a DMZ network.",
        "D. Disable wireless access on the thermostat to make it unshakable.",
        "E. Upgrade the customerג€™s router to the latest version to improve network security. ",
        "F. Upgrade the customerג€™s wireless network encryption to WPA. "
      ]
    ],
    "Answer : AC"
  ],
  [
    41,
    "A technician wants to block remote logins to a server. Which of the following ports should be blocked?\n",
    [["A. 21", "B. 53", "C. 80", "D. 443"]],
    "Answer : A"
  ],
  [
    42,
    "A company has very strict rules regarding proprietary information leaving the premises. All computers host proprietary information. A technician is called to repair a computer on-site at the companyג€™s corporate office. The technician identifies the problem and goes through the troubleshooting steps to create a plan of action.\nThe technician determines the computer needs to be taken off-site for repair.\nWhich of the following should the technician do NEXT?\n",
    [
      [
        "A. Check corporate policies for guidance.",
        "B. Get authorization from the manager.",
        "C. Delete proprietary data before leaving the building.",
        "D. Remove the HDD and send the device for repair."
      ]
    ],
    "Answer : A"
  ],
  [
    43,
    "A technician is setting up a new wireless network at a branch office that previously had only wired connectivity with statically assigned IP addresses. After setting up the network, the technician configures a server to provide IP addresses to wireless clients. During testing, the technician is unable to access the Internet or named network resources. The technician receives a valid IP address from the DHCP server and can ping the default gateway.\nWhich of the following should be technician check NEXT to resolve this issue?\n",
    [
      [
        "A. Ensure the options are configured to provide a DNS server.",
        "B. Verify the Windows Firewall is turned off.",
        "C. Configure the wireless networkג€™s SSID to be hidden. ",
        "D. Enable file and printer sharing in the OS."
      ]
    ],
    "Answer : A"
  ],
  [
    44,
    "A user purchases a wireless printer and sets it up in an office. The user installs all necessary software for the printer on the computer and connects the printer to the guest wireless network. However, when the user attempts to print to the printer, nothing happens.\nWhich of the following will resolve the issue?\n",
    [
      [
        "A. Set up the userג€™s computer to act as a print server. ",
        "B. Configure the printer to use the Internet printing protocol.",
        "C. Ensure the userג€™s computer is set to DHCP. ",
        "D. Connect the printer to the company wireless network."
      ]
    ],
    "Answer : D"
  ],
  [
    45,
    "A user is having a problem with printing a specific document type.\nThe network printer OCP shows that the printer is online with no errors. Other users are not having the same issue. The user sends the document to another printer and the document prints.\nWhich of the following should a technician do FIRST in troubleshooting the problem?\n",
    [
      [
        "A. Stop and restart the PC print spooler service.",
        "B. Verify the user is sending the document to the correct printer queue.",
        "C. Have each user send the same document to the correct printer queue.",
        "D. Stop and restart the print server queues, and then have the user resend the document."
      ]
    ],
    "Answer : B"
  ],
  [
    46,
    "A server needs a RAM upgrade, and a technician has been tasked with retrieving the RAM from storage and then installing it.\nWhich of the following is the BEST RAM type for the technician to retrieve?\n",
    [["A. SoDIMM", "B. DDR4", "C. Single channel", "D. ECC"]],
    "Answer : B"
  ],
  [
    47,
    "A customer wants to upgrade a PCג€™s internal storage to have more room to store backups, photos, and videos. The new storage should be large enough to avoid expanding again next year.\nWhich of the following BEST meets these needs?\n",
    [["A. 3TB HDD", "B. 50GB NAS", "C. 500TB SAN", "D. 512GB SSD"]],
    "Answer : A"
  ],
  [
    48,
    "\nThe feature that allows users to store files in cloud-based storage when necessary, but can be removed when space is freed up, is known as:\n",
    [
      [
        "A. on-demand",
        "B. resource pool",
        "C. synchronization application",
        "D. shared resources"
      ]
    ],
    "Answer : A"
  ],
  [
    49,
    "Several computers are having network connectivity issues. Two of the computers are wired and are not having any issues. The technician verifies that none of the computers having issues have been assigned a static IP.\nWhich of the following should the technician check NEXT?\n",
    [
      [
        "A. Check the closest AP for the area.",
        "B. Check each wireless adapter switch.",
        "C. Check the groupג€™s network switch. ",
        "D. Check the DHCP server."
      ]
    ],
    "Answer : D"
  ],
  [
    50,
    "A customer accidentally drops a laptop while it is charging. The next day, the customer notices the laptop will not turn on and calls a technician to investigate. The technician confirms the laptop will not turn on even though it is connected to the power adapter.\nWhich of the following components is the MOST likely cause of this behavior?\n",
    [["A. Power adapter", "B. Battery", "C. DC jack", "D. Hard drive"]],
    "Answer : C"
  ],
  [
    51,
    "A systems administrator is configuring a server to host several virtual machines. The administrator configures the server and is ready to begin provisioning the virtual machines.\nWhich of the following features should the administrator utilize to complete the task?\n",
    [
      [
        "A. Hypervisor",
        "B. Disk management",
        "C. Terminal services",
        "D. Device Manager",
        "E. Virtual LAN"
      ]
    ],
    "Answer : A"
  ],
  [
    52,
    "A network administrator must install a device that will proactively stop outside attacks from reaching the LAN.\nWhich of the following devices would BEST meet the organizationג€™s needs?\n",
    [["A. IPS", "B. IDS", "C. Proxy server", "D. Authentication server"]],
    "Answer : A"
  ],
  [
    53,
    "Which of the following devices can be used to connect multiple devices within a network without broadcasting to every network port?\n",
    [["A. Unmanaged switch", "B. Hub", "C. Firewall", "D. Cable modem"]],
    "Answer : B"
  ],
  [
    54,
    "A technician is setting up a Windows mobile device for a user who had trouble reading text on a previous device, especially at night.\nWhich of the following adjustments would be MOST appropriate?\n",
    [
      [
        "A. Use the magnifier.",
        "B. Increase the resolution.",
        "C. Use haptic feedback.",
        "D. Utilize text-to-speech."
      ]
    ],
    "Answer : A"
  ],
  [
    55,
    "A technician is setting up a VM for use in testing software deployments. The VM is offline, but the hypervisor is not.\nWhich of the following settings should the technician change to resolve this issue?\n",
    [
      [
        "A. Virtual security",
        "B. Virtual storage",
        "C. Virtual CPU",
        "D. Virtual switch",
        "E. Virtual RAM"
      ]
    ],
    "Answer : C"
  ],
  [
    56,
    "A projectorג€™s image begins to flicker during a presentation. The laptop display does not produce this issue.\nWhen a technician changes the resolution on the laptop, the issue persists. Which of the following is the NEXT step the technician should take?\n",
    [
      [
        "A. Check the connectivity of the VGA cable.",
        "B. Check the connectivity of the power cable.",
        "C. Change the aspect ratio on the laptop.",
        "D. Change the settings of the projector."
      ]
    ],
    "Answer : A"
  ],
  [
    57,
    "A technician upgraded the memory on a server from two 8GB sticks to eight 32GB sticks. The server memory is now at full capacity per the user guide. When the technician powers on the system, only 128GB of memory is recognized by the OS and the BIOS. The technician decides to upgrade to the latest version of the firmware on the system, which does not help. Next, the technician installs the memory in sets of 64GB at a time. Each individual set of 64GB is fully recognized by the server.\nWhich of the following will not allow the server to recognize all of the memory installed at the same time?\n",
    [
      [
        "A. The power supply is not supplying enough power for the memory.",
        "B. The memory has too many ECC errors and is shutting down",
        "C. The server is overheating when all of the memory is installed.",
        "D. The server needs DDR4 memory, and DDR3 is installed."
      ]
    ],
    "Answer : D"
  ],
  [
    58,
    "A technician is talking to end users about the specifications for an upgraded application server. The users of the application report that there cannot be any unscheduled downtime or data loss. Additionally, they would like the performance of the application to improve over the previous server in any way possible. The previous server was running RAID 5.\nWhich of the following RAID solutions should be implemented in this scenario?\n",
    [["A. RAID 0", "B. RAID 1", "C. RAID 6", "D. RAID 10"]],
    "Answer : D"
  ],
  [
    59,
    "An end user reports a printer error that states ג€Replace filamentג€. With which of the following types of printer is the end user MOST likely having problems?\n",
    [["A. Ink jet", "B. Laser", "C. 3-D", "D. Thermal"]],
    "Answer : C"
  ],
  [
    60,
    "Which of the following features will save the battery life of a laptop significantly if they are disabled? (Choose two.)\n",
    [
      [
        "A. Touchpad",
        "B. Volume",
        "C. Screen orientation",
        "D. Cellular",
        "E. Bluetooth",
        "F. Fingerprint reader"
      ]
    ],
    "Answer : DE"
  ],
  [
    61,
    "Which of the following technologies can be used for wireless payments?\n",
    [["A. NFC", "B. Bluetooth", "C. IR", "D. LTE"]],
    "Answer : A"
  ],
  [
    62,
    "A technician is ordering a new motherboard and processors for a company email server. When reviewing the vendor licensing agreement, the technician sees that there is a flat per-socket licensing fee.\nWhich of the following motherboard/processor combinations should the technician order to get the BEST performance while minimizing licensing fees?\n",
    [
      [
        "A. A dual-processor motherboard with six hyperthreaded cores each.",
        "B. A single-processor motherboard with eight hyperthreaded cores.",
        "C. A dual-processor motherboard with eight overclocked cores each.",
        "D. A single-processor motherboard with ten overclocked cores."
      ]
    ],
    "Answer : B"
  ],
  [
    63,
    "A printer stops working in the billing department and cannot be repaired. A new printer has been ordered and a technician is tasked with allowing other users to print to the billing managerג€™s printer until the new printer arrives. The managerג€™s printer is currently used via USB connection, and there are no network jacks available for use.\nWhich of the following is the BEST way for the technician to allow access to the printer?\n",
    [
      [
        "A. Create a share on the managerג€™s computer and give the users rights to the share. ",
        "B. Install the printer on the usersג€™ desktops and point it to the IP address of the managerג€™s computer. ",
        "C. Purchase a wireless printer so the users can access the printer via the network.",
        "D. Provide flash drives to the users so they can transfer data to the managerג€™s computer for printing."
      ]
    ],
    "Answer : A"
  ],
  [
    64,
    "The touch-screen feature on a Windows device has stopped working.\nWhich of the following should the technician check FIRST?\n",
    [
      [
        "A. Device Manager",
        "B. Performance Monitor",
        "C. System configuration",
        "D. Digitizer settings"
      ]
    ],
    "Answer : D"
  ],
  [
    65,
    "Which of the following is the MOST likely cause for a network PC to have an APIPA address?\n",
    [
      [
        "A. DHCP failure",
        "B. DNS resolution",
        "C. Duplicate IP address",
        "D. Cleared ARP cache"
      ]
    ],
    "Answer : A"
  ],
  [
    66,
    "A technician needs to routinely run scripting commands in Linux but does not want to walk over to the server room every time to perform the task. The technician also travels between buildings and has a Windows 10 laptop with 4GB of memory and a fully partitioned 500GB hard drive.\nWhich of the following steps should the technician take to resolve this issue? (Choose two.)\n",
    [
      [
        "A. Increase the memory to 8GB.",
        "B. Install a Linux guest VM.",
        "C. Add another 500GB hard drive.",
        "D. Create a Linux LiveBoot CD.",
        "E. Repartition the hard drive.",
        "F. Install Linux on a new ext3 partition."
      ]
    ],
    "Answer : EF"
  ],
  [
    67,
    "A technician has been informed that multiple users are receiving duplicate IP address warnings on their workstations, and they are unable to browse the Internet.\nWhich of the following server types should the technician log in to in order to resolve the problem?\n",
    [
      [
        "A. DNS server",
        "B. DHCP server.",
        "C. Proxy server",
        "D. RADIUS server"
      ]
    ],
    "Answer : B"
  ],
  [
    68,
    "Which of the following devices is used to implement network security policies for an environment?\n",
    [["A. Firewall", "B. Managed switch", "C. Repeater", "D. Gateway"]],
    "Answer : A"
  ],
  [
    69,
    "Which of the following peripheral types is MOST likely to be used to input actions into a PC?\n",
    [["A. Webcam", "B. Mouse", "C. Monitor", "D. Optical drive"]],
    "Answer : B"
  ],
  [
    70,
    "A technician replaced a broken LED screen on a mobile computer. The operating system can be seen perfectly on screen, but the touch screen is non-responsive.\nWhich of the following are the MOST probable root causes for the given failure? (Choose three.)\n",
    [
      [
        "A. The hardware replacement used is a non-touch-screen version.",
        "B. The touch screen must be calibrated after a replacement.",
        "C. The digitizer cable is not seated properly on the motherboard.",
        "D. The new touch-screen drivers must be installed.",
        "E. The replacement part is dead-on-arrival.",
        "F. The LCD panel firmware must be updated.",
        "G. The grounding screws are not securely attached."
      ]
    ],
    "Answer : ACD"
  ],
  [
    71,
    "In a virtual environment, which of the following allows all the VMs to have RAM allocated for use?\n",
    [
      [
        "A. Resource pooling",
        "B. Measured service",
        "C. Virtual application streaming",
        "D. Synchronization"
      ]
    ],
    "Answer : A"
  ],
  [
    72,
    "An analyst asks a technician to recommend a solution for a customer in the software development industry, where the customer can test a variety of OSs running the various applications that the customer produces. The customer wants to minimize the investment in hardware.\nWhich of the following solutions should the technician recommend to BEST meet the customerג€™s requirement?\n",
    [
      [
        "A. Purchase a number of low-cost devices, installing the required OSs and applications on each one. Use separate machines for each testing environment.",
        "B. Purchase a high-end system meeting the hardware requirements for all of the individual OSs and applications. Configure a VM for each testing environment.",
        "C. Purchase one computer and create images for each computer configuration and OS. Re-image the machine for each testing environment.",
        "D. Purchase a number of computers, installing a VM on each one. Configure each VM with an OS for the testing environment."
      ]
    ],
    "Answer : B"
  ],
  [
    73,
    "A user is experiencing email problems and explains to a technician that all emails with graphics or images do not display the graphics.\nWhich of the following configurations would correct this behavior?\n",
    [
      [
        "A. Change the email settings in antivirus.",
        "B. Change the security settings of the email client.",
        "C. Change the firewall security settings.",
        "D. Change the email proxy settings.",
        "E. Change the trusted sites in the browser settings."
      ]
    ],
    "Answer : B"
  ],
  [
    74,
    "Which of the following resources is the MOST critical when using cloud file-storage synchronization applications?\n",
    [
      [
        "A. Disk speed",
        "B. I/O bandwidth",
        "C. RAM utilization",
        "D. CPU utilization"
      ]
    ],
    "Answer : B"
  ],
  [
    75,
    "A user logs on a PC and receives a message stating there is a duplicate IP address on the network. After a system restart, the user notices the same error.\nWhich of the following is the MOST probable cause of the error?\n",
    [
      [
        "A. The user is still logged into another device.",
        "B. The user has set a static IP address.",
        "C. The user has moved to a different office.",
        "D. The user has wireless and wired connections."
      ]
    ],
    "Answer : B"
  ],
  [
    76,
    "Whenever a userג€™s machine is turned on, a black screen appears prompting the user for an administrative password. The technician has no such password on file for this machine.\nWhich of the following steps should the technician take to resolve this issue?\n",
    [
      [
        "A. Press and hold the CPU power button for five seconds, and then power back on.",
        "B. Disconnect and reconnect the internal hard drive.",
        "C. Remove the CMOS battery and reinsert it after ten seconds.",
        "D. Remove the motherboard and place it back into the machine after ten minutes."
      ]
    ],
    "Answer : C"
  ],
  [
    77,
    "A server administrator set up a VM to be used in a lab setting. A technician is setting up thin-client computers to access this VM. Which of the following tasks are required to complete the project? (Choose three.)\n",
    [
      [
        "A. Connect the device to a printer.",
        "B. Install the operating system.",
        "C. Install a USB keyboard and mouse.",
        "D. Connect the device to the network.",
        "E. Install the latest system updates.",
        "F. Install the latest device drivers.",
        "G. Connect the device to a monitor.",
        "H. Install the necessary applications."
      ]
    ],
    "Answer : DEH"
  ],
  [
    79,
    "A user sets up a cable modem at home and connects the modem to the ISP at the cable company. Which of the following network types does this connection describe?\n",
    [["A. WAN", "B. LAN", "C. PAN", "D. MAN"]],
    "Answer : A"
  ],
  [
    81,
    "A technician receives a cellular call from a manager. The technician is instructed to download a service manual directly from the Internet to a laptop. However, there is no WiFi signal or wired Ethernet. Which of the following would be the MOST appropriate connections for the technician to use?\n",
    [["A. Hotspot", "B. NFC", "C. Bluetooth", "D. VPN"]],
    "Answer : A"
  ],
  [
    82,
    "A technician is replacing the LCD panel in a laptop. Which of the following components is MOST likely to be damaged accidentally during the repair?\n",
    [["A. Bezel", "B. Hinge", "C. Motherboard", "D. Digitizer"]],
    "Answer : D"
  ],
  [
    83,
    "A technician is replacing an older video card with a new high-end video card in a workstation. The installation was successful, the new card seated properly, and power is connected. However, upon booting, the computer now emits several beeps and will not boot, but shows no error messages. Which of the following is\nMOST likely the cause of this issue?\n",
    [
      [
        "A. The BIOS is out-of-date",
        "B. The is not enough PSU output",
        "C. There is an onboard RAM mismatch",
        "D. GPU is overlocked",
        "E. The firmware is out-of-date"
      ]
    ],
    "Answer : B"
  ],
  [
    84,
    "Which of the following Internet connection types often terminates at a switching center and then requires the use of a different media for the last mile to the customer?\n",
    [["A. ISDN", "B. DSL", "C. Fiber", "D. Cable"]],
    "Answer : B"
  ],
  [
    85,
    "Company management wants to give users the ability to work from home during periods of bad weather. Which of the following would enable the workforce to do this?\n",
    [["A. NAT", "B. VLAN", "C. VPN", "D. HIPS"]],
    "Answer : C"
  ],
  [
    86,
    "A user wants to build a computer with a high-end CPU, plenty of RAM, and a high-end graphics card for online gaming. The user wants to verify that the graphics card is compatible with the motherboard. Which of the following connection types would the user MOST likely utilize to connect the video card to the motherboard?\n",
    [["A. PCle", "B. ISA", "C. AGP", "D. USB"]],
    "Answer : A"
  ],
  [
    87,
    "A company offers several out-of-the-box computer configurations to its clients. A client requests several new computers for its newest location, which will be used by guests to check in upon arrival and fill out contact information. Which of the following configurations would BEST fit this customerג€™s needs?\n",
    [
      [
        "A. Touch-screen kiosk",
        "B. Thick client",
        "C. CAD workstation",
        "D. Virtualized host computer"
      ]
    ],
    "Answer : A"
  ],
  [
    88,
    "Which of the following ports are used for secure sessions? (Choose two.)\n",
    [["A. 22", "B. 23", "C. 25", "D. 80", "E. 110", "F. 443"]],
    "Answer : AF"
  ],
  [
    89,
    "Which of the following is designed to function BEST in harsh lighting conditions?\n",
    [
      [
        "A. Large tablet",
        "B. E-reader",
        "C. Smart watch",
        "D. Virtual reality headset"
      ]
    ],
    "Answer : D"
  ],
  [
    90,
    "Which of the following connector types is used to terminate household telephone cabling?\n",
    [["A. RG-6", "B. RJ-11", "C. RJ-45", "D. RG-59"]],
    "Answer : B"
  ],
  [
    91,
    "A shipping department is having problems with its thermal label printer. Two columns on the left are not appearing on all labels. Which of the following should a technician do FIRST?\n",
    [
      [
        "A. Verify the ribbon is correctly aligned to the label",
        "B. Run a label calibration",
        "C. Remove stuck labels from the print path",
        "D. Replace the print head"
      ]
    ],
    "Answer : A"
  ],
  [
    92,
    "A technician is buying a laptop that will host three VMs running at the same time with the current configuration. The technician believes there might be a need to run several additional VMs in the near future. Which of the following resources would be the MOST important to upgrade to allow for the additional VMs?\n",
    [["A. CPU", "B. SSD", "C. NIC", "D. RAM"]],
    "Answer : B"
  ],
  [
    93,
    "The ability for new computers to be automatically connected to the network is provided by the:\n",
    [
      ["A. DHCP server", "B. DNS server", "C. proxy server", "D. TACACS server"]
    ],
    "Answer : A"
  ],
  [
    94,
    "A technician is setting up a printer for a small office that does not have an RJ-45 jack. The usersג€™ computers are all in the same workgroup and are connected physically to the same network switch. The technician needs to make sure all users can print to the new printer through the switch. Which of the following should the technician configure?\n",
    [
      [
        "A. Shared printer",
        "B. Print server",
        "C. Bluetooth printing",
        "D. Cloud printing"
      ]
    ],
    "Answer : A"
  ],
  [
    95,
    "The cloud model that represents a company maintaining some data in on-premise storage and some data in cloud-based storage is known as:\n",
    [["A. hybrid", "B. private", "C. public", "D. community"]],
    "Answer : A"
  ],
  [
    96,
    "A network administrator is attempting to access the firewall while inside the datacenter. Which of the following peripherals must be connected to do so?\n",
    [["A. KVM", "B. Touchpad", "C. Mouse", "D. Keyboard"]],
    "Answer : A"
  ],
  [
    97,
    "An engineer is working at a remote site that does not have Internet access. Which of the following features should the engineer use to connect a laptop to the\nInternet if hotspot functionality is unavailable?\n",
    [
      [
        "A. Tethering",
        "B. Near field communication",
        "C. Wireless LAN",
        "D. Virtual private network"
      ]
    ],
    "Answer : A"
  ],
  [
    98,
    "Which of the following is the main purpose of the +5VSB output of a power supply?\n",
    [
      [
        "A. It allows peripherals to draw power when the machine is off",
        "B. It provides power to the audio and sound boards of the machine",
        "C. It acts as the main voltage supply to the motherboard and processor",
        "D. It powers all expansion cards and external device hubs"
      ]
    ],
    "Answer : A"
  ],
  [
    99,
    "A user printed several documents to a shared network copier and noticed that they have very faint color density. A technician investigates the issue and verifies that the printer had a maintenance kit installed recently. Which of the following next steps will MOST likely resolve the issue? (Choose two.)\n",
    [
      [
        "A. Replace the toner cartridges",
        "B. Replace the fuser module",
        "C. Clean the paper tray rollers",
        "D. Adjust the printer settings",
        "E. Replace the developer",
        "F. Empty the waste toner bottles"
      ]
    ],
    "Answer : AD"
  ],
  [
    100,
    "A laptop is connected to a conference room projector in extended display mode. The desktop icons appear normal on the laptop, but are disproportionate and illegible on the projector screen. Which of the following should the technician check?\n",
    [["A. Video resolution", "B. HDMI connection", "C. Keystone", "D. Focus"]],
    "Answer : A"
  ],
  [
    101,
    "Which of the following wireless standards is only capable of 5GHz frequencies?\n",
    [["A. 802.11a", "B. 802.11ac", "C. 802.11b", "D. 802.11g"]],
    "Answer : A"
  ],
  [
    102,
    "A technician is configuring a high-performance workstation. The technician needs to choose storage for the boot drive with the highest performance possible.\nWhich of the following drive types BEST meets this requirement?\n",
    [["A. MicroSD", "B. 15K rpm", "C. NVMe", "D. USB flash"]],
    "Answer : C"
  ],
  [
    103,
    "A network administrator is troubleshooting a notebook that is not loading the local Windows 10 operating system. All the computers inside the company are installed using UEFI mode selected. The message on the screen shows a failed attempt to connect to a PXE server. When requested, the end user reported trying to improve the computerג€™s speed by changing some BIOS configurations randomly. Which of the following should the network administrator check FIRST inside\nBIOS?\n",
    [
      [
        "A. C-states should be configured to 2",
        "B. Secure Boot should be enabled",
        "C. Wake-on-LAN should be unchecked",
        "D. The PXE server address should be set"
      ]
    ],
    "Answer : D"
  ],
  [
    104,
    "A customer recently moved a high-end graphics card from a known-working computer to a different computer. The computer works without issue when viewing email and web pages or when using certain applications. However, when a game with high-end graphics requirements is opened, the program will run for a few minutes before the computer shuts down. Which of the following is MOST likely causing the problem?\n",
    [
      [
        "A. Power supply wattage",
        "B. Video RAM",
        "C. CPU frequency",
        "D. Monitor resolution"
      ]
    ],
    "Answer : A"
  ],
  [
    105,
    "An ISP has notified a SOHO user of a usage increase on the userג€™s network. The user is concerned the WiFi network is being utilized by unauthorized users.\nWhich of the following would minimize the unauthorized use of the WiFi network?\n",
    [
      [
        "A. Implement MAC filtering",
        "B. Enable NAT",
        "C. Create a network DMZ",
        "D. Upgrade the encryption standards"
      ]
    ],
    "Answer : A"
  ],
  [
    106,
    "Which of the following services provides the ability to resolve UNC to appropriate IP addresses?\n",
    [["A. DNS", "B. DHCP", "C. Proxy", "D. Web server"]],
    "Answer : A"
  ],
  [
    107,
    "A technician is troubleshooting network connectivity issues after a new wireless router was installed in an office. Users who connect to the new router are unable to access LAN resources. Which of the following is the MOST likely cause of the issue?\n",
    [
      [
        "A. There are conflicting DHCP servers on the network",
        "B. There are conflicting ARP records",
        "C. There are conflicting gateways on the network",
        "D. There are conflicting IP protocols"
      ]
    ],
    "Answer : A"
  ],
  [
    108,
    "A technician has been asked to fix a problem with a projector. The projector lamp turns off for brief periods during a demonstration. After the technician replaced the lamp, the problem continued with an added message that appears just before the lamp turns off. Which of the following MOST likely need to be performed?\n(Choose two.)\n",
    [
      [
        "A. Reset the lamp life counter",
        "B. Replace the cooling fan",
        "C. Adjust the brightness",
        "D. Update the laptop video driver",
        "E. Install a higher lumen lamp",
        "F. Change the video resolution"
      ]
    ],
    "Answer : AB"
  ],
  [
    109,
    "A workstation was just moved to a new work location without a surge protector. It was working the day before, but now the PC will not power on, the fans will not spin, and there are no signs of activity. Which of the following should the technician do FIRST?\n",
    [
      [
        "A. Check the power cable connection",
        "B. Check the voltage of the PSU with a tester",
        "C. Test for distended capacitors",
        "D. Check the voltage switch"
      ]
    ],
    "Answer : A"
  ],
  [
    110,
    "Some users are unable to access the Internet form their workstations. A technician runs the ipconfig command on one of the workstations and sees the following:\n\n\n\nThe technician pings 8.8.8.8 and gets no response. Next, the technician pings 192.168.1.1 and gets no response. The technician is able to successfully ping an adjacent workstation but cannot ping the print server on the floor below. Which of the following is the MOST likely cause of the Internet connectivity issue in the office?\n",
    [
      [
        "A. There is a problem with a router in the office",
        "B. There is a problem with a DNS server in the office",
        "C. The users are not getting correct IP addresses from the DHCP server",
        "D. The wireless access point in the area is down"
      ]
    ],
    "Answer : A"
  ],
  [
    111,
    "A systems administrator receives a notification from the RAID controller that the RAID 5 array is degraded. Upon logging into the server, the administrator sees that on logical disk 0, physical disk 2 has failed. Which of the following is the BEST course of action to take to resolve the problem?\n",
    [
      [
        "A. Schedule system downtime and replace physical disk 2. Wait until the array is rebuilt and confirm in the RAID controller that the system is no longer degraded.",
        "B. Immediately replace physical disk 2. Wait until the array is rebuilt and confirm in the RAID controller that the system is no longer degraded.",
        "C. Delete logical disk 0 and manually configure a new RAID array only using the known-good working drives. Wait until the array is rebuilt and confirm in the RAID controller that the system is no longer degraded.",
        "D. In the controller, convert the RAID 5 array to RAID 0 array to avoid system downtime. Wait until the array is rebuilt and confirm in the RAID controller that the system is no longer degraded."
      ]
    ],
    "Answer : A"
  ],
  [
    112,
    "A technician is hired to install network cable in a crawl space running the length of a hallway. To do so without a fire code violation, which of the following types of cable should the technician run?\n",
    [["A. Plenum", "B. Fiber", "C. Shielded", "D. Coaxial"]],
    "Answer : A"
  ],
  [
    113,
    "Which of the following devices performs forwarding decisions based on MAC addresses?\n",
    [["A. Switch", "B. Router", "C. Hub", "D. Repeater"]],
    "Answer : A"
  ],
  [
    114,
    "A technician is dispatched to troubleshoot a slow performance issue on a PC. Upon arrival, the technician immediately opens Task Manager and sees that CPU and RAM performance are within normal ranges. The technician then checks and verifies the speed and duplex settings and performance on the network card.\nThe technician then temporarily disables the antivirus to see if performance is affected, and it is not. After re-enabling the antivirus, which of the following is the\nNEXT best step for the technician to take?\n",
    [
      [
        "A. Check to see if insufficient hard drive space is causing the issue",
        "B. Update the operating system, drivers, and firmware on the PC",
        "C. Log into the PC with another user profile and test performance",
        "D. Shut down the PC, unplug the power for 30 seconds, and then boot the PC"
      ]
    ],
    "Answer : A"
  ],
  [
    115,
    "An office has a network that has all computers connected to two switches. The switches are connected with a fiber cable. The computers and switches are all located in the same building. Which of the following network types does this describe?\n",
    [["A. WAN", "B. PAN", "C. LAN", "D. MAN"]],
    "Answer : C"
  ],
  [
    116,
    "Joe, a user, recently purchased a new multifunction printer and attempted to install it himself. He informed a technician that the printer is on his list of printers, but he is unable to print. The technician sees that the printer is listed as a generic printer under Devices and Printers. Which of the following should the technician do\nNEXT?\n",
    [
      [
        "A. Reboot the computer into safe mode and try to print a test page",
        "B. Download the correct drivers from the manufacturerג€™s website and install them",
        "C. Unplug the USB cable from the printer and try another USB slot on the PC",
        "D. Set the printer as the default within the device properties"
      ]
    ],
    "Answer : B"
  ],
  [
    117,
    "A userג€™s smartphone has been slow recently. A technician sees the phone was purchased two months ago, and it is top of the line. About a month ago, a new OS update was installed. To address the issue, the technician runs a hardware diagnostic on the device, and it reports no problems. Which of the following is MOST likely the cause of the performance issue on the device?\n",
    [
      [
        "A. Too many applications are running updates",
        "B. The device is currently running in airplane mode",
        "C. The internal memory is failing on the device",
        "D. The OS update is too resource intensive for the device"
      ]
    ],
    "Answer : A"
  ],
  [
    118,
    "Ann, a user, reports that after setting up a new WAP in her kitchen she is experiencing intermittent connectivity issues. Which of the following should a technician check FIRST?\n",
    [["A. Channels", "B. Frequency", "C. Antenna power level", "D. SSID"]],
    "Answer : B"
  ],
  [
    119,
    "A user connects a laptop to a docking station but is unable to see an image on the external monitor. The user tests the docking station USB ports, and they are working fine. Which of the following should be done NEXT?\n",
    [
      [
        "A. Check for firmware updates",
        "B. Configure extended display mode",
        "C. Replace the external monitor",
        "D. Adjust the laptopג€™s BIOS settings "
      ]
    ],
    "Answer : B"
  ],
  [
    120,
    "A technician needs to call a userג€™s cellular provider to troubleshoot a network speed issue with the userג€™s mobile device. Which of the following technologies is the technician troubleshooting?\n",
    [
      [
        "A. Long-term evolution",
        "B. Near-field communication",
        "C. Radio frequency ID",
        "D. Z-wave"
      ]
    ],
    "Answer : A"
  ],
  [
    121,
    "About one week ago, access to files on a network server became significantly slower. Today, network files are completely unavailable. A technician is able to make a remote connection to the server. Which of the following should the technician check NEXT?\n",
    [
      [
        "A. RAID 5 array",
        "B. NIC configuration",
        "C. Available storage space",
        "D. RAM utilization"
      ]
    ],
    "Answer : A"
  ],
  [
    122,
    "An employeeג€™s mobile device no longer charges, and the employee believes the battery is bad. A technician tests the mobile device and finds it will charge on a wireless charging pad but not when it is connected to a charging cable. Other devices charge without issue when the cable is used. Which of the following should the technician perform FIRST to resolve the issue?\n",
    [
      [
        "A. Clean out the charging port on the device",
        "B. Replace the mobile deviceג€™s battery ",
        "C. Issue a new charging cable to the employee",
        "D. Send the device for service and give the employee a loaner"
      ]
    ],
    "Answer : A"
  ],
  [
    123,
    "A customer contacts the help desk stating a laptop does not remain charged for more than 30 minutes and will not charge more than 15%. Which of the following components are the MOST likely causes the issue? (Choose three.)\n",
    [
      [
        "A. LCD power inverter",
        "B. AC adapter",
        "C. Battery",
        "D. Processor",
        "E. VGA card",
        "F. Motherboard",
        "G. Backlit keyboard",
        "H. Wireless antenna"
      ]
    ],
    "Answer : ABC"
  ],
  [
    124,
    "Which of the following connects a PC to its default gateway?\n",
    [["A. NIC", "B. Switch", "C. Router", "D. Cable modem"]],
    "Answer : B"
  ],
  [
    125,
    "Which of the following devices can utilize VLANs to secure networks?\n",
    [["A. Switch", "B. Hub", "C. Repeater", "D. Bridge"]],
    "Answer : A"
  ],
  [
    126,
    "After upgrading a smartphoneג€™s OS, Joe, a user, reports the smartphone no longer connects to his automobile automatically when near it. Joe restarts the smartphone, but the problem persists. Which of the following should a technician do NEXT to restore the previous functionality?\n",
    [
      [
        "A. Connect the smartphone to the automobile via USB",
        "B. Reenable the smartphoneג€™s Bluetooth radio ",
        "C. Perform a rollback of the smartphoneג€™s OS ",
        "D. Enable airplane mode and then disable airplane mode"
      ]
    ],
    "Answer : B"
  ],
  [
    127,
    "Joe, a user, sets up an IMAP connection on his smartphone to connect to webmail. Joe is able to view email, but he receives an error message when trying to send a message. When viewing the mail clientג€™s configuration, Joe sees a valid SMTP server and port. Which of the following should Joe check NEXT to resolve the issue?\n",
    [
      [
        "A. Configure the email account as a POP3 connection",
        "B. Ensure the SSL/TLS option is being used",
        "C. Check that the account password is still valid",
        "D. Make sure the smartphone is not in airplane mode"
      ]
    ],
    "Answer : A"
  ],
  [
    128,
    "A user is connected to a docking station with an optical drive and is trying to back up personal files to removable media, but is encountering write errors. Which of the following is MOST likely cause of the errors?\n",
    [
      [
        "A. The disk has already been finalized",
        "B. The files are encrypted",
        "C. There is a corrupt file on the hard drive",
        "D. The files are not compatible with the type of disk used"
      ]
    ],
    "Answer : A"
  ],
  [
    129,
    "A technician is configuring a new web server and must have over 10TB of fault-tolerant storage, while minimizing the number of failure points. The applications on the server also require the highest performance available. Which of the following configurations would the technician MOST likely select?\n",
    [
      [
        "A. RAID 0 with 15000rpm 15TB drives",
        "B. RAID 1 with 10000rpm 8TB drives",
        "C. RAID 5 with 7200rpm 5TB drives",
        "D. RAID 10 with 5400rpm 6TB drives"
      ]
    ],
    "Answer : D"
  ],
  [
    130,
    "A user has reported application connectivity problems to the network administrator. The network administrator knows there have been firewall configuration changes recently by a security vendor and believes the issue could be related to a port being closed on the firewall. Which of the following should the network administrator do NEXT?\n",
    [
      [
        "A. See if the same application fails on another workstation",
        "B. Go into the firewall and open the port",
        "C. Verify system functionality on the userג€™s workstation ",
        "D. Document the issue for future reference"
      ]
    ],
    "Answer : C"
  ],
  [
    131,
    "Joe, a user, reports that his new smart wearable device is not synchronizing to his mobile device. Both devices are powered on, but the mobile device fails to read the data from the wearable. Which of the following will MOST likely fix this issue?\n",
    [
      [
        "A. Pair the devices",
        "B. Set the SSID",
        "C. Update the smart wearable device firmware",
        "D. Enable NFC"
      ]
    ],
    "Answer : A"
  ],
  [
    132,
    "A technician is troubleshooting a WiFi issues with a laptop user in a corporate office. The user can connect to web pages without trouble; however, the user cannot connect to the email server or print a locally stored document to the network printer. The technician cannot ping the mail server or the network printer. No other users are experiencing this issue. Which of the following is MOST likely causing the issue?\n",
    [
      [
        "A. The laptop has an APIPA address",
        "B. The laptop is configured to the wrong default gateway",
        "C. The laptop is connected to the guest WiFi",
        "D. The laptop is configured with a static IP"
      ]
    ],
    "Answer : C"
  ],
  [
    133,
    "Which of the following cloud computing concepts facilities automated server deployment?\n",
    [["A. NaaS", "B. IaaS", "C. PaaS", "D. SaaS"]],
    "Answer : B"
  ],
  [
    134,
    "Which of the following connector types can be plugged into a device both right-side up and upside down?\n",
    [["A. USB", "B. USB-C", "C. Mini-USB", "D. Micro-USB"]],
    "Answer : B"
  ],
  [
    135,
    "A network administrator would like to increase network bandwidth to 1Gbps between two office buildings that are 0.5mi(805m) apart. Which of the following would be the BEST solution?\n",
    [["A. Fiber", "B. Coaxial", "C. Plenum", "D. Cat 6"]],
    "Answer : A"
  ],
  [
    136,
    "A user is experiencing issues synchronizing a smartphone. The user is able to connect to individual services, but each requires a different password. Which of the following needs to be configured to allow the user to access web services securely with a unique password?\n",
    [["A. SIM", "B. SMB", "C. SSL", "D. SSO"]],
    "Answer : D"
  ],
  [
    137,
    "An end user is unable to connect to the network, and a technician has visually verified the lights on the back of the PC are active and there is no physical damage to the Ethernet jack. Which of the following tools should the technician use to continue troubleshooting the connection?\n",
    [
      [
        "A. Punchdown tool",
        "B. Tone generator and probe",
        "C. Cable tester",
        "D. Crimper"
      ]
    ],
    "Answer : C"
  ],
  [
    138,
    "The graphics department has an issue with printing certain files. The printer does not print the complete image on larger files. A technician verifies the network speed of the printer is set to 1GB and that regular text files print without issue. Which of the following is the MOST likely cause of this problem?\n",
    [
      [
        "A. The printer needs more RAM",
        "B. The print server is timing out",
        "C. The users are not printing in post-script mode",
        "D. The printer network connection is set to half duplex"
      ]
    ],
    "Answer : A"
  ],
  [
    139,
    "Which of the following requires less current to provide the same amount of power to devices inside a PC?\n",
    [["A. 5.5V", "B. 12V", "C. 120V", "D. 220V"]],
    "Answer : D"
  ],
  [
    140,
    "Which of the following is used to connect a headset to a laptop?\n",
    [["A. eSATA", "B. BNC", "C. RG-6", "D. USB"]],
    "Answer : D"
  ],
  [
    141,
    "An end user reports a Windows based PC just had a BSOD. The PC rebooted, and the user is now logged back in and working without any issues. Which of the following should a technician check FIRST to begin troubleshooting?\n",
    [
      [
        "A. Hard drive S.M.A.R.T. data",
        "B. Event Viewer",
        "C. Device Manager",
        "D. BIOS settings",
        "E. Performance Monitor"
      ]
    ],
    "Answer : B"
  ],
  [
    142,
    "A user calls the help desk stating a laptop is performing slowly and the hard drive activity lights are blinking continuously. A technician checks for enough hard drive space, disables antivirus and indexing services, and runs a full-system diagnostics check, which returns no failure. Which of the following should the technician do NEXT?\n",
    [
      [
        "A. Install a new hard drive",
        "B. Check for hard-drive firmware updates",
        "C. Replace the hard drive with a solid state drive",
        "D. Configure the laptop in high-performance mode",
        "E. Change the boot order in the system BIOS"
      ]
    ],
    "Answer : B"
  ],
  [
    143,
    "Which of the following IEEE 802.11 standards includes the use of MIMO technology?\n",
    [["A. 802.11a", "B. 802.11b", "C. 802.11g", "D. 802.11n"]],
    "Answer : D"
  ],
  [
    144,
    "A technician needs to give users the ability to transfer files between mobile devices. The technician teaches the staff how to use a file transfer method in which the devices need to be in close proximity with line-of-sight access to each other. Which of the following technologies is the technician teaching to the staff?\n",
    [["A. IR", "B. Bluetooth", "C. Tethering", "D. NFC"]],
    "Answer : A"
  ],
  [
    145,
    "A user reports a laserjet printer is not printing properly. A technician prints a test page and notices the toner is smeared on the page. The technician confirms the toner cartridge is installed correctly and the paper in the tray is the right size. Which of the following printer components is the MOST likely cause of the problem?\n",
    [["A. Fuser", "B. Roller", "C. Memory", "D. Toner"]],
    "Answer : A"
  ],
  [
    146,
    "A customer is using a cloud storage program that maintains a copy of local files on the cloud storage servers. The WiFi network is not very fast, and the customer uses bandwidth-intensive video streaming all day. Which of the following parameters should be adjusted to keep the cloud storage program from using too much bandwidth?\n",
    [
      [
        "A. Synchronization settings",
        "B. Wireless settings",
        "C. Video streaming settings",
        "D. QoS settings"
      ]
    ],
    "Answer : D"
  ],
  [
    147,
    "Which of the following connector types is MOST appropriate to use to connect a SOHO cable modem to the ISP?\n",
    [["A. DB-9", "B. RJ-45", "C. RG-59", "D. RS-232"]],
    "Answer : C"
  ],
  [
    148,
    "A technician configures a new printer to be accessible via a print server. After setting up the printer on a Windows client machine, the printer prints normally.\nHowever, after setting up the printer on a macOS client machine, the printer only prints garbled text. Which of the following should the technician do to resolve this issue?\n",
    [
      [
        "A. Add a macOS-compatible print driver to the printet object on the print server.",
        "B. Configure the Windows client to share the printer with the macOS client.",
        "C. Set the printer on the macOS client to connect to the print server via IPv6.",
        "D. Ensure the network time of the macOS client matches that of the print server."
      ]
    ],
    "Answer : A"
  ],
  [
    149,
    "A user received the following error message while trying to access a shared drive: Network Path was Not Found. Which of the following should be performed to resolve the issue? (Choose two.)\n",
    [
      [
        "A. Set the NIC to full duplex.",
        "B. Disable the local firewall.",
        "C. Reset the TCP/IP stack.",
        "D. Disable the Ethernet adapter.",
        "E. Use static IP addressing instead of DHCP.",
        "F. Flush the DNS cache."
      ]
    ],
    "Answer : CF"
  ],
  [
    150,
    "A client brings in a smartphone with a cracked screen to be repaired. During the repair process, the technician places the screws in a small container to prevent losing them. The technician tests the replacement screen to ensure it works property before closing the device. Once the device is back together, however it does not power on.\n",
    [
      [
        "A. Label the locations of the screws.",
        "B. Refer to manufacturer resources.",
        "C. Document the orientation of the cables.",
        "D. Use the appropriate hand tools."
      ]
    ],
    "Answer : B"
  ],
  [
    151,
    "A technician is setting up a new SOHO router for a home user. The user has a media server to be accessible from the Internet while the user is traveling.\nWhich of the following should the technician configure to allow access to the server from the Internet?\n",
    [["A. Port forwarding", "B. NAT", "C. MAC filtering", "D. QoS"]],
    "Answer : A"
  ],
  [
    152,
    "Users report they have to select the output tray at the printer, even though the correct tray is selected in the print dialog.\nWhich of the following should a technician perform FIRST to attempt to solve the problem?\n",
    [
      [
        "A. Check the userג€™s account for the correct printing privileges. ",
        "B. Reinstall the driver on the print server.",
        "C. Update the firmware on the commercial office printer.",
        "D. Run Windows Update on the affected computers."
      ]
    ],
    "Answer : B"
  ],
  [
    153,
    "A technician is setting up a laptop and projector for a presentation. When plugging in the projector, it mirrors the desktop screen from the laptop, but everything appears distorted and compressed.\nWhich of the following should the technician do to correct the appearance of the image on the projector?\n",
    [
      [
        "A. Update the laptop graphics driver.",
        "B. Change the scaling options.",
        "C. Change the desktop resolution.",
        "D. Replace the video cable.",
        "E. Utilize a USB VGA graphics adapter.",
        "F. Adjust the keystone settings on the projector."
      ]
    ],
    "Answer : C"
  ],
  [
    154,
    "A technician wants to set up a virtual machine in a public cloud environment.\nWhich of the following cloud models should the technician use?\n",
    [["A. IaaS", "B. SaaS", "C. PaaS", "D. DBaaS"]],
    "Answer : A"
  ],
  [
    155,
    "A corporation maintains an active social media presence by constantly uploading audio and video. The corporation also regularly hosts video conferences, but attendees are reporting buffering during their telecast.\nWhich of the following should the IT department do to improve the ability to attend video conferences without interruption?\n",
    [
      [
        "A. Enable QoS on network traffic, prioritizing telecast traffic over uploads.",
        "B. Upgrade video conference room equipment.",
        "C. Create a VLAN for all employees updating social media.",
        "D. Adjust the network intrusion device to allow video to flow without filtering."
      ]
    ],
    "Answer : A"
  ],
  [
    156,
    "Which of the following has a P4 connector to provide a 12V output?\n",
    [
      [
        "A. Molex connector",
        "B. 24-pin adapter",
        "C. SCSI cable",
        "D. eSATA cable"
      ]
    ],
    "Answer : A"
  ],
  [
    157,
    "An administrator connects to the companyג€™s cloud account and builds a server that is hosted in the cloud. The server will be used as a confidential database server for one of the companyג€™s core applications. The administrator is responsible for patching and updating the server OS.\nWhich of the following cloud models is this an example of?\n",
    [["A. IaaS", "B. SaaS", "C. PaaS", "D. Public"]],
    "Answer : A"
  ],
  [
    158,
    "A systems administrator wants to take advantage of the benefits of the major cloud providers while retaining some data and services in the local datacenter.\nWhich of the following types of cloud model should the administrator consider?\n",
    [["A. Public", "B. Private", "C. Hybrid", "D. Community"]],
    "Answer : C"
  ],
  [
    159,
    "A user reports being unable to browse the Internet. A technician believes the cause of the issue is related to DNS.\nWhich of the following should the technician perform NEXT?\n",
    [
      [
        "A. Test the theory by attempting to browse to a websiteג€™s known IP address.",
        "B. Implement preventive measures by manually assigning a DNS server to the PC.",
        "C. Identify the problem by running the command ipconfig /flushdns.",
        "D. Document the findings in the organizationג€™s local knowledge base. "
      ]
    ],
    "Answer : A"
  ],
  [
    160,
    "A customer has two 8GB sticks of 2400-speed DDR4 installed in slots 1 and 2 of a computer and wants to add more RAM. The customer purchases two additional\n4GB sticks of 3200-speed DDR4 and installs then in slots 3 and 4. While installing the RAM into the board, the user notices the board has ג€quad channelג€ etched near the RAM slots.\nWhich of the following can be said about the userג€™s channel configuration after upgrading the RAM?\n",
    [
      [
        "A. The computer is utilizing one channel.",
        "B. The computer is utilizing two channels.",
        "C. The computer is utilizing three channels.",
        "D. The computer is utilizing four channels."
      ]
    ],
    "Answer : D"
  ],
  [
    161,
    "A technician is building a CAD workstation for a user who will be saving files remotely.\nWhich of the following components are MOST important to include when configuring the system? (Choose two.)\n",
    [
      [
        "A. Optical audio",
        "B. Graphics card",
        "C. Liquid cooling unit",
        "D. HDD size",
        "E. RAM"
      ]
    ],
    "Answer : BE"
  ],
  [
    162,
    "A technician wants the number of virtual machines hosting a web application in the public cloud environment to scale based on real-time traffic on the website.\nWhich of the following should the technician configure?\n",
    [
      [
        "A. Resource pooling",
        "B. Rapid elasticity",
        "C. Measured service",
        "D. High availability"
      ]
    ],
    "Answer : B"
  ],
  [
    163,
    "A user notices a laser printer is picking up multiple sheets of paper from one of its paper trays. The problem started last week and has gotten worse.\nWhich of the following is MOST likely the cause of this problem?\n",
    [
      [
        "A. Separation pad",
        "B. Feed roller",
        "C. Registration roller",
        "D. Duplex assembly"
      ]
    ],
    "Answer : A"
  ],
  [
    164,
    "A SOHO user wants a multifunction device to be set up for the office printer. Additionally, scanning and fax capability must be set up for office employees only.\nGuest WiFi access will open.\nWhich of the following configuration changes will BEST meet the userג€™s request? (Choose two.)\n",
    [
      [
        "A. Enable user authentication.",
        "B. Disable remote printing.",
        "C. Configure the print server.",
        "D. Enable cloud settings.",
        "E. Disable the wireless network.",
        "F. Connect to a wired network."
      ]
    ],
    "Answer : AC"
  ],
  [
    165,
    "A technician is upgrading a userג€™s smartphone and wants to move all of the applications and contact information quickly to the new device.\nWhich of the following connection types would work BEST to do this?\n",
    [["A. NFC", "B. IR", "C. OTG", "D. Bluetooth"]],
    "Answer : A"
  ],
  [
    166,
    "Which of the following would provide power to an access point?\n",
    [["A. POE injector", "B. Switch", "C. Repeater", "D. Modern"]],
    "Answer : A"
  ],
  [
    167,
    "A user notices the system clock is changed every morning. The computer is shut down daily. A technician checks the time zone and finds it is correct, and then checks the BIOS settings and finds the time to be incorrect.\nWhich of the following is MOST likely the problem?\n",
    [
      [
        "A. The CMOS battery does not have a charge.",
        "B. Daylight savings time is not enabled.",
        "C. BIOS time is set to Universal Time Coordinated.",
        "D. The NTP server has gone offline."
      ]
    ],
    "Answer : A"
  ],
  [
    168,
    "Virtual machines hosted in the cloud that are used by developers to code applications are an example of:\n",
    [["A. FaaS", "B. BaaS", "C. PaaS", "D. SaaS", "E. IaaS"]],
    "Answer : C"
  ],
  [
    169,
    "Which of the following server types caches previously visited web pages for faster access in the future?\n",
    [
      [
        "A. Proxy server",
        "B. Web hosting server",
        "C. DNS server",
        "D. Branch cache server"
      ]
    ],
    "Answer : D"
  ],
  [
    170,
    "Joe, a user, wants his desktop RAID configured to allow the fastest speed and the most storage capacity. His desktop has three hard drives. Which of the following RAID types should a technician configure to achieve this?\n",
    [["A. 0", "B. 1", "C. 5", "D. 10"]],
    "Answer : A"
  ],
  [
    171,
    "An employeeג€™s laptop will not power on. When the power button is pressed, the power light goes on and then suddenly off. A technician replaces the battery, and the laptop powers on. The employee works without issues until the end of the day, but the laptop presents the same problem the next morning.\nWhich of the following is the MOST probable cause of the issue?\n",
    [
      [
        "A. Swollen battery",
        "B. Damaged AC adapter",
        "C. Improperly seated RAM",
        "D. Cooling fan failure",
        "E. Imminent hard drive failure"
      ]
    ],
    "Answer : B"
  ],
  [
    172,
    "A bank employee contacts the help desk for assistance with setting up a new computer. Which of the following peripherals will the technician MOST likely install alongside the device? (Choose two.)\n",
    [
      [
        "A. Magnetic reader",
        "B. Signature pad",
        "C. Flatbed scanner",
        "D. Web camera",
        "E. External storage drive"
      ]
    ],
    "Answer : BD"
  ],
  [
    173,
    "A technician is upgrading the RAM in a server-grade laptop for a companyג€™s Chief Executive Officer (CEO). The CEO cannot afford any downtime.\nWhich of the following is the BEST type of memory module to purchase?\n",
    [["A. LRDIMM", "B. DDR4", "C. Parity", "D. Dual channel"]],
    "Answer : B"
  ],
  [
    174,
    "A technician manually configured the wireless connection on the Chief Information Officerג€™s (CIOג€™s) new laptop so it can communicate with the network at the office. The CIO now is having trouble connecting to a guest WiFi hotspot. While the device has a gateway address and says it is connected, the CIO cannot access company email.\nWhich of the following would BEST resolve the issue?\n",
    [
      [
        "A. Move the CIOג€™s laptop closer to the access point to obtain a better RF signal. ",
        "B. Restart the wireless connection to obtain a self-assigned APIPA address.",
        "C. Assign a different IP address to the device in conflict with the CIOג€™s laptop.",
        "D. Set the network connection to use DHCP instead of a static address.",
        "E. Change the networkג€™s SSID to a mobile hotspot to access company email. "
      ]
    ],
    "Answer : D"
  ],
  [
    175,
    "Which of the following is the type of address a DHCP server assigns on a network?\n",
    [["A. Dynamic", "B. Static", "C. APIPA", "D. MAC", "E. Default"]],
    "Answer : A"
  ],
  [
    176,
    "A user brings a Windows laptop into the office and connects it to a wireless network. Upon connecting to the network, the user is prompted to select whether the network is a home, work, or public network. The user selects the work profile and is able to access the Internet but cannot access office network resources.\nWhich of the following is the MOST likely cause of the problem?\n",
    [
      [
        "A. The userג€™s network card is malfunctioning. ",
        "B. The user is connected to the wrong wireless network.",
        "C. The userג€™s firewall is blocking access to the resources. ",
        "D. The user put in the wrong credentials."
      ]
    ],
    "Answer : B"
  ],
  [
    177,
    "A customer has the LCD display in a laptop replaced. After the repair, the customer notices the laptop is showing a weaker WiFi signal than before the display was replaced.\nWhich of the following BEST explains the lower WiFi signal?\n",
    [
      [
        "A. The antenna is too close to the screenג€™s power inverter. ",
        "B. The new LCD panel is causing interference.",
        "C. The digitizer is calibrated improperly.",
        "D. The radio antennas are damaged."
      ]
    ],
    "Answer : B"
  ],
  [
    178,
    "A technician sets up a new printer on the network, allowing it to obtain an IP address. The technician records the IP address and sets up users to print using the information. The following Monday after powering on the printer, users report they can no longer print. After verifying users can access other network shares, the technician prints a configuration page and sees the IP address has changed.\nWhich of the following is the BEST method for the technician to ensure this will not happen again?\n",
    [
      [
        "A. Set up MAC filtering on the switch to ensure the printer gets the same IP.",
        "B. Set up the users to print using the newly assigned IP address.",
        "C. Create an IP reservation for the printer on the DHCP server.",
        "D. Statically assign the current IP address to the printer."
      ]
    ],
    "Answer : C"
  ],
  [
    179,
    "A technician has built a custom workstation for an end user. The end user reports that the workstation ran for a few minutes and then crashed. When the user subsequently boots the workstation, it crashes much more quickly.\nWhich of the following did the technician forget to do when building the workstation?\n",
    [
      [
        "A. Apply thermal paste.",
        "B. Connect the case fans.",
        "C. Configure integrated GPU.",
        "D. Overclock the CPU."
      ]
    ],
    "Answer : B"
  ],
  [
    180,
    "An end user brings in a laptop that no longer charges. A technician troubleshoots the laptop and notices it works while the power adaptor is plugged in but shuts down as soon as it is unplugged.\nWhich of the following is the NEXT best step to resolve this issue?\n",
    [
      [
        "A. Plug the laptop into another power outlet.",
        "B. Replace the power adaptor.",
        "C. Replace the laptop's battery.",
        "D. Plug the laptop into a UPS."
      ]
    ],
    "Answer : C"
  ],
  [
    181,
    "A client needs to upgrade the hard drive on a laptop and would like one that is fast and has drop protection.\nWhich of the following is the BEST option for the client?\n",
    [["A. 5400rpm HDD", "B. 7200rpm HDD", "C. NVMe SSD", "D. Hybrid HDD/SSD"]],
    "Answer : C"
  ],
  [
    182,
    "A user states the department laser printer continues to display a paper jam error message despite the jam being cleared.\nWhich of the following should a technician do to troubleshoot this problem?\n",
    [
      [
        "A. Check the paper path for blocked sensors.",
        "B. Replace the duplex assembly.",
        "C. Run the printer's internal diagnostics.",
        "D. Verify the pickup rollers are in working order."
      ]
    ],
    "Answer : A"
  ],
  [
    183,
    "Which of the following resource types would be BEST suited to saving photographs from a mobile device with limited on-board storage?\n",
    [
      [
        "A. Cloud file services",
        "B. Virtual desktop",
        "C. Off-site email",
        "D. Resource pooling"
      ]
    ],
    "Answer : A"
  ],
  [
    185,
    "An instructor had been lecturing for 20 minutes and utilizing the overhead projection system, when the projector suddenly went blank. A technician was dispatched and was able to start the projector after several minutes; however, the screen went blank after briefly displaying the slideshow.\nWhich of the following would be the technicianג€™s NEXT best option?\n",
    [
      [
        "A. Install a new bulb",
        "B. Reseat the VGA cable",
        "C. Reboot the laptop",
        "D. Check the projector cooling fan",
        "E. Adjust the projectorג€™s sleep settings "
      ]
    ],
    "Answer : D"
  ],
  [
    186,
    "A developer has configured a new web application on a workstation using client-side virtualization. Despite working locally on the developerג€™s PC, other users on the network are not able to access the application.\nWhich of the following network configurations should the virtual machine be configured for to allow other users to access the application?\n",
    [
      [
        "A. Internal networking",
        "B. Bridged networking",
        "C. Private networking",
        "D. NAT networking"
      ]
    ],
    "Answer : B\n\nReference:\nhttps://www.virtualbox.org/manual/ch06.html\n"
  ],
  [
    187,
    "Which of the following BEST describes an email infrastructure that uses a local archive server cluster and publicly hosted email servers?\n",
    [["A. Private", "B. Public", "C. Hybrid", "D. SaaS"]],
    "Answer : C"
  ],
  [
    188,
    "A technician is installing virtualization software on the company developerג€™s desktop. The developer will need to run several VMs simultaneously. The system is loaded with the Windows 10 OS and has the following specifications:\n✑ i5 quad-core processor\n✑ 4GB of RAM\n✑ 256GB SSD\nWhich of the following should the technician upgrade on the system FIRST to meet the developerג€™s requirements?\n",
    [["A. SSD", "B. Processor", "C. RAM", "D. BIOS"]],
    "Answer : C"
  ],
  [
    189,
    "Which of the following is an IP address that is assigned to a network device based on its MAC address?\n",
    [["A. Dynamic", "B. Static", "C. Link local", "D. Reservation"]],
    "Answer : D"
  ],
  [
    190,
    "The IT department recently updated client computers for the graphics department. A user reports the new computer has not worked since it was set up; it makes unusual sounds when pressing the power button. A technician verifies the power cable works and the computer is connected properly to both data and power. The monitor powers on but only displays the message: No source.\nWhich of the following BEST explains the cause of this issue?\n",
    [
      [
        "A. There is insufficient power to the computer",
        "B. There is a blank screen on system boot",
        "C. The computer is overheating",
        "D. The error beep codes on POST"
      ]
    ],
    "Answer : A"
  ],
  [
    191,
    "A technician is troubleshooting a network that is experiencing inconsistent connections through one of the network drops in the board room. The technician wants to verify the integrity of the network run but needs to identify which cable comes from the board room. However, none of the network connections in the network room are labeled.\nWhich of the following are the BEST tools for the technician to use to identify the correct network run to troubleshoot? (Choose two.)\n",
    [
      [
        "A. Cable stripper",
        "B. Cable tester",
        "C. Tone generator",
        "D. WiFi analyzer",
        "E. Multimeter",
        "F. Probe"
      ]
    ],
    "Answer : BE"
  ],
  [
    192,
    "Which of the following connectors is commonly known as serial?\n",
    [["A. RG-6", "B. RJ11", "C. RS-232", "D. BNC"]],
    "Answer : C"
  ],
  [
    193,
    "A business owner is concerned about excessive paper usage but is not concerned about the wear to the printer of the use of toner. The business owner asks a technician to find a low-cost solution.\nWhich of the following is the BEST action for the technician to perform?\n",
    [
      [
        "A. Configure duplexing",
        "B. Enable collating",
        "C. Adjust the orientation",
        "D. Decrease the quality"
      ]
    ],
    "Answer : A"
  ],
  [
    194,
    "The documents from a workgroup laser printer are not printing correctly. Some of the print is missing, and the pages come out dusty.\nWhich of the following should a technician do to fix this issue?\n",
    [
      [
        "A. Replace the low-voltage power supply",
        "B. Replace the scanner assembly",
        "C. Replace the formatter assembly",
        "D. Replace the fuser assembly"
      ]
    ],
    "Answer : D"
  ],
  [
    195,
    "Which of the following IP addressing types is MOST likely to use an IP address starting with 169.254?\n",
    [["A. Static", "B. APIPA", "C. Link local", "D. Dynamic"]],
    "Answer : B"
  ],
  [
    196,
    "A developer wants to add a Windows 10 64-bit VM with the minimum system requirements to a virtual host workstation. The virtual host is running Windows\nServer 2008 R2 and has 24GB of RAM, a 1TB hard drive, and a Gigabit Ethernet NIC with Cat 5e cabling. The current configuration of VMs is as follows:\n✑ Windows 7 VM with 4GB RAM and 200GB HDD\n✑ Linux VM with 16GB RAM and 200GB HDD\n✑ Linux VM with 2GB RAM and 100GB HDD\nWhich of the following should the technician recommend to the developer FIRST?\n",
    [
      [
        "A. Increase the HDD in the virtual host",
        "B. Install an additional NIC and configure teaming",
        "C. Upgrade the network cabling to Cat 6",
        "D. Increase the memory in the virtual host"
      ]
    ],
    "Answer : D"
  ],
  [
    197,
    "A user wants to add static storage to a laptop and is unable to physically take it apart.\nWhich of the following would be the BEST solution?\n",
    [
      [
        "A. USB drive",
        "B. Optical drive",
        "C. Network the share",
        "D. Cloud storage"
      ]
    ],
    "Answer : A"
  ],
  [
    198,
    "Which of the following speeds would a wireless network perform at when the network is built in bridge mode containing 802.11g, 802.11n, and 802.11ac access points?\n",
    [["A. 11Mbs", "B. 54Mbs", "C. 450Mbs", "D. 1300Mbs"]],
    "Answer : D"
  ],
  [
    199,
    "Which of the following wireless networking protocols operates on the 5GHz band and provides data rates in excess of 750Mbps?\n",
    [["A. 802.11a", "B. 802.11ac", "C. 802.11b", "D. 802.11g", "E. 802.11n"]],
    "Answer : B"
  ],
  [
    200,
    "An end user is building a small home media server. The user wants to be able to add and remove hard drives without powering down the server.\nWhich of the following should be enabled to allow for this?\n",
    [["A. NVMe", "B. AHCI", "C. ATAPI", "D. UEFI"]],
    "Answer : B"
  ],
  [
    201,
    "A company is terminating Cat 6 wiring at a 110 block.\nWhich of the following should be used?\n",
    [
      [
        "A. A crimper",
        "B. A cable stripper",
        "C. A punchdown tool",
        "D. A tone generator"
      ]
    ],
    "Answer : C"
  ],
  [
    202,
    "A workstation has RAID 1 and RAID 5 arrays. Although performance is not degraded, management software is reporting a hard disk failure.\nWhich of the following should a technician do NEXT?\n",
    [
      [
        "A. Check one of the RAID 1 disks for failure",
        "B. Rebuild the RAID 1 disks for failure",
        "C. Check one of the RAID 5 disks for failure",
        "D. Rebuild the RAID 5 array"
      ]
    ],
    "Answer : C"
  ],
  [
    203,
    "A company wants to purchase new equipment for its help desk team. Team members work in a 24/7 environment and share desks with coworkers from other shifts. The company already has dual monitors set up on each desk but decides replacing the existing desktops with laptops would be the best business decision to support the mobility needs.\nWhich of the following laptop features or accessories would be BEST suited for this business environment?\n",
    [
      [
        "A. KVM",
        "B. VPN",
        "C. Privacy filters",
        "D. Docking stations",
        "E. Port replicators"
      ]
    ],
    "Answer : D"
  ],
  [
    204,
    "A userג€™s personal laptop has been behaving erratically for the past month. Today, however, the user cannot perform any work on the laptop, as the device locks up immediately after logging on. Believing the issue to be a malware infection, a technician takes the laptop back to the workbench for additional tests and diagnostics. A full-system malware scan returns inconclusive results. The user reports only new software installations have been made to the laptop.\nFollowing best practice methodologies, which of the following should the technician perform NEXT to resolve the problem?\n",
    [
      [
        "A. Uninstall the new software applications",
        "B. Document the findings and report them to the user",
        "C. Do a full backup of the system data",
        "D. Perform a format and System Restore"
      ]
    ],
    "Answer : C"
  ],
  [
    205,
    "A user is given a new tablet. When using the touch screen, the user reports the cursor highlights and selects items unintentionally. The issue does not happen when using an external mouse.\nWhich of the following should the technician do FIRST to resolve this issue?\n",
    [
      [
        "A. Run the calibration utility",
        "B. Disable the touch functionality",
        "C. Update the touch-screen driver",
        "D. Reinstall the OS"
      ]
    ],
    "Answer : C"
  ],
  [
    206,
    "A small office wants to install a server that can provide name resolution for internal clients.\nWhich of the following server types would BEST accomplish this?\n",
    [["A. IDS", "B. DHCP", "C. UTM", "D. DNS"]],
    "Answer : D"
  ],
  [
    207,
    "Which of the following connector types can be used to connect a laptop to a docking station or port replicator? (Choose two.)\n",
    [
      [
        "A. Lightning",
        "B. Thunderbolt",
        "C. RJ45",
        "D. Molex",
        "E. DB9",
        "F. USB-C"
      ]
    ],
    "Answer : BF"
  ],
  [
    208,
    "A user purchased a processor to upgrade a computer. After the installation, the computer no longer boots, but everything appears to be installed correctly.\nWhich of the following should the user have done prior to installing the new processor? (Choose two.)\n",
    [
      [
        "A. Run a Windows Update",
        "B. Verify the power requirements of the new CPU",
        "C. Purchase a high-efficiency cooling system",
        "D. Disable Secure Boot",
        "E. Check for BIOS updates",
        "F. Reinstall the operating system"
      ]
    ],
    "Answer : BD"
  ],
  [
    209,
    "A technician receives a laptop from an end user who reports that some aspects of the image are left behind when applications are closed and persist until reboot.\nThe technician also notices black dots throughout the screen. The technician recalibrates the display settings and updates the drivers for the display adapter, but the issue persists.\nWhich of the following is the laptop MOST likely experiencing? (Choose two.)\n",
    [
      [
        "A. Artifacts",
        "B. Distorted geometry",
        "C. VGA degradation",
        "D. Burn in",
        "E. Dead pixels",
        "F. Distorted image"
      ]
    ],
    "Answer : DE"
  ],
  [
    210,
    "A customerג€™s workstation will not boot. A technician runs diagnostics on the system and discovers it is set up in a RAID 0 configuration, and a single SATA hard drive has failed. The system was set up for performance. Once repaired, the customer requests redundancy be built into the system and an increase in performance.\nWhich of the following describes how the technician should set up the new RAID configuration?\n",
    [
      [
        "A. RAID 1 configuration that will utilize new SSD",
        "B. RAID 5 configuration that will allow the loss of a hard drive without failure",
        "C. RAID 6 configuration that will allow the loss of two hard drives without failure",
        "D. RAID 10 configuration utilizing new HDD"
      ]
    ],
    "Answer : D"
  ],
  [
    211,
    "Which of the following is the minimum category cable that supports 1000Mbps speed?\n",
    [["A. Cat 3", "B. Cat 5e", "C. Cat 6", "D. Cat 6e"]],
    "Answer : B"
  ],
  [
    212,
    "Which of the following is considered a connectionless protocol?\n",
    [["A. UDP", "B. TCP", "C. Telnet", "D. DNS"]],
    "Answer : A"
  ],
  [
    213,
    "Joe, a user, needs to have a notebook connected to a monitor, a mouse, and a keyboard when he is working at his desk. His notebook is not business class, yet is meets company policy for personal computers.\nWhich of the following should a technician install for Joe?\n",
    [
      [
        "A. Port forwarding device",
        "B. Docking station",
        "C. KVM switch",
        "D. USB hub"
      ]
    ],
    "Answer : B"
  ],
  [
    214,
    "A user needs access to a shared mailbox inside the mobile mail application through the companyג€™s cloud-based email service.\nWhich of the following protocols is required to make this possible?\n",
    [["A. IMAP", "B. S/MIME", "C. SMTP", "D. SNMP"]],
    "Answer : C"
  ],
  [
    215,
    "A company wants to protect its users from malicious websites but also provide the ability to log traffic in and out of the network.\nWhich of the following should the company place within its network to BEST protect its users?\n",
    [["A. IDS server", "B. DNS server", "C. Proxy server", "D. Syslog server"]],
    "Answer : C"
  ],
  [
    216,
    "Which of the following cloud models would MOST likely be described as a service in which the customer has no responsibility for application patching?\n",
    [["A. IaaS", "B. SaaS", "C. Private cloud", "D. PaaS"]],
    "Answer : B"
  ],
  [
    217,
    "Which of the following cloud-based services gives customers the ability to scale resources as needed?\n",
    [
      [
        "A. Resource pooling",
        "B. Rapid elasticity",
        "C. Measured service",
        "D. Hybrid cloud"
      ]
    ],
    "Answer : B"
  ],
  [
    218,
    "A technician is troubleshooting a networking issue for a client. After running ipconfig/all the technician discovers the IP address assigned to the computer is\n169.254.100.58.\nWhich of the following network configurations does this describe?\n",
    [["A. APIPA", "B. DNS", "C. DHCP", "D. NAT"]],
    "Answer : A"
  ],
  [
    219,
    "A company wants to use thin clients to run all the common business applications it uses. The users need to share files and have a common email domain.\nWhich of the following cloud concepts should a technician recommend?\n",
    [["A. PaaS", "B. IaaS", "C. MaaS", "D. Saas"]],
    "Answer : D"
  ],
  [
    220,
    "A small office in a remote area is considering a new ISP.\nWhich of the following broadband types is based on the distance to the nearest central office?\n",
    [["A. Satellite", "B. Fiber", "C. Cable", "D. DSL"]],
    "Answer : D"
  ],
  [
    221,
    "A technician is building a Windows server to meet the specific needs of a user. The user needs to house a replica of a very large SQL database to be able to query the database locally.\nWhich of the following drive configurations would BEST meet the requirements while providing the maximum amount of performance and storage?\n",
    [
      [
        "A. OS disk: 128GB M2 Data disk: 4TB 7200rpm HDD",
        "B. OS disk: 256GB 5400rpm HDD Data disk: 1TB 5400rpm HDD",
        "C. OS disk: 512GB 15000rpm HDD Data disk: 64GB M2",
        "D. OS disk: 1TB 7200rpm HDD Data disk: 128GB 10000rpm HDD"
      ]
    ],
    "Answer : A"
  ],
  [
    222,
    "A technician is setting up a workstation for a new user. The computerג€™s OS has most features disabled. The computer has graphics, network, and human input devices configured.\nWhen a user logs onto the computer, it loads a virtual desktop with all the necessary programs. Which of the following BEST describes this type of workstation?\n",
    [
      [
        "A. Locked kiosk",
        "B. Virtual machine",
        "C. Thin client",
        "D. Hypervisor"
      ]
    ],
    "Answer : B"
  ],
  [
    223,
    "Which of the following must a technician configure to access the console of multiple servers physically by using one keyboard, mouse, and monitor?\n",
    [
      [
        "A. Virtual management console",
        "B. Remote desktop protocol",
        "C. Portable crash cart",
        "D. Rack-mounted IP KVM"
      ]
    ],
    "Answer : D"
  ],
  [
    224,
    "After replacing a failed mother board in a userג€™s computer, the technician receives a report that the computer is behaving erratically. The user states the computer shuts down randomly throughout the day and freezes frequently. The technician performs a memory diagnostic, and it reports no issues.\nWhich of the following should the technician check NEXT in troubleshooting this issue?\n",
    [
      [
        "A. Reseat the memory and reset the BIOS to default settings",
        "B. Add heat sinks to each installed memory module",
        "C. Enable overclocking functionality in the BIOS",
        "D. Ensure all case fans are plugged in and working"
      ]
    ],
    "Answer : D"
  ],
  [
    225,
    "When configuring a VM, which of the following devices MOST likely needs to be configured to allow the VM access to other client VMs on the same host?\n",
    [["A. Virtual switch", "B. Host", "C. Hypervisor", "D. Workstation NIC"]],
    "Answer : A"
  ],
  [
    226,
    "A technician is setting up a server to provide access to the LAN and Internet.\nWhich of the following server roles would accomplish this task? (Choose three.)\n",
    [
      [
        "A. File server",
        "B. Print server",
        "C. Web server",
        "D. DNS server",
        "E. DHCP server",
        "F. SQL server",
        "G. Email server",
        "H. Proxy server"
      ]
    ],
    "Answer : DEH"
  ],
  [
    227,
    "A technician is building a SOHO server that will be used to run a business-critical application for a small business.\nWhich of the following RAM types should the technician install?\n",
    [
      [
        "A. Error correcting",
        "B. Triple channel",
        "C. Unbuffered memory",
        "D. Non-parity"
      ]
    ],
    "Answer : A"
  ],
  [
    228,
    "A user is accessing webmail and needs to encrypt the contents of the email message and attachments prior to sending.\nWhich of the following should be configured to accomplish this task?\n",
    [
      [
        "A. S/MIME settings",
        "B. VPN settings",
        "C. TLS settings",
        "D. SSL settings"
      ]
    ],
    "Answer : A"
  ],
  [
    229,
    "A user is participating in a weight-loss challenge and needs to keep track of fitness activities, locations, distances, and calories burned during a specific time period. The user wants to be able to listen to music while participating in the challenge.\nWhich of the following would the user MOST likely need to purchase to meet these requirements?\n",
    [
      [
        "A. Smartphone",
        "B. Fitness application",
        "C. AR headset",
        "D. Fitness tracker"
      ]
    ],
    "Answer : A"
  ],
  [
    230,
    "A user reports being unable to print to a network-based all-in-one printer. The issue consistently appears after power outages.\nWhich of the following should a technician perform to resolve the issue?\n",
    [
      [
        "A. Run Windows Update on the userג€™s machine ",
        "B. Disable the firewall on the userג€™s machine ",
        "C. Set a static IP address on the printer",
        "D. Reinstall the printer with vendor-provided drivers"
      ]
    ],
    "Answer : C"
  ],
  [
    231,
    "A technician is troubleshooting an issue with a printer that is directly attached to a userג€™s workstation. The printer is powered on but will not print. The user claims nothing has changed on the computer, and the printer was working earlier in the day.\nWhich of the following should the technician do NEXT to determine the cause of the issue?\n",
    [
      [
        "A. Order a new printer for the user and decommission the current printer",
        "B. Update the printer drivers in the workstationג€™s OS ",
        "C. Physically examine the workstation and printer for any obvious issues",
        "D. Reseat all the printer cables and restart the userג€™s workstation "
      ]
    ],
    "Answer : C"
  ],
  [
    232,
    "A company is concerned about the security of sensitive data on a laptop a user frequently takes off-site.\nWhich of the following enables hardware encryption to secure user data?\n",
    [
      [
        "A. BIOS password",
        "B. Hibernation mode",
        "C. Trusted Platform Module",
        "D. Screen-saver lock"
      ]
    ],
    "Answer : C"
  ],
  [
    233,
    "Which of the following has a P4 connector to provide a 12V output?\n",
    [["A. EIDE port", "B. 24-pin adapter", "C. SCSI cable", "D. eSATA cable"]],
    "Answer : A"
  ],
  [
    234,
    "A technician would like to install an internal storage drive for a computer. Which of the following cable connectors would MOST likely be used to transfer data?\n(Choose two.)\n",
    [["A. USB-C", "B. IDE", "C. SATA", "D. USB-A", "E. Molex", "F. Lightning"]],
    "Answer : BC"
  ],
  [
    235,
    "After a new laser printer was installed, users began reporting issues. Duplicate copies of print jobs were not delivering fully separated copies; instead, similar pages were being stacked. Which of the following settings MOST likely needed to be checked to correct this issue?\n",
    [["A. Collation", "B. Duplexing", "C. Orientation", "D. Quality"]],
    "Answer : A"
  ],
  [
    236,
    "Which of the following network servers would be MOST useful in translating a URL into an IP address?\n",
    [
      [
        "A. Print server",
        "B. DNS server",
        "C. Mail server",
        "D. DHCP server",
        "E. Web server"
      ]
    ],
    "Answer : B"
  ],
  [
    237,
    "After restoring a laptop to factory settings, a client can no longer use the touchpad on it. A technician verifies the system state was fully restored from the most recent, fully working backup. Which of the following should the technician check for NEXT using the fewest number of steps?\n",
    [
      [
        "A. System Restore",
        "B. Installed USB mouse",
        "C. Updated drivers",
        "D. Function key toggle"
      ]
    ],
    "Answer : D"
  ],
  [
    238,
    "Ann, a user, reports the 20GB hard drive on her VM is full. She frequently has to delete files so the machine is usable again. Ann would like access to a machine with a larger hard drive. Aside from the drive being too small, the machine works perfectly for Ann. A technician checks the virtual host and sees it has about\n400GB of available disk space.\nWhich of the following should the technician do to resolve the problem quickly?\n",
    [
      [
        "A. Go into the hypervisor and increase the size of the hard drive.",
        "B. Spin up a new VM for Ann with a larger hard drive.",
        "C. Move the VM to another virtual host with more resources.",
        "D. Upgrade the hard drive in the virtual host machine."
      ]
    ],
    "Answer : A"
  ],
  [
    241,
    "A technician is using PXE to upgrade the OS in a lab that has new and old computers. The new devices can obtain a DHCP address but fail to locate the PXE server. The old computers can locate the PXE server and upgrade the OS as required. Which of the following is MOST likely preventing the new computers from booting to PXE?\n",
    [
      [
        "A. LoJack security",
        "B. BIOS password",
        "C. Drive encryption",
        "D. Secure Boot"
      ]
    ],
    "Answer : D"
  ],
  [
    242,
    "Which of the following ports do Apple iOS devices use for charging and data transfer?\n",
    [["A. Qi wireless", "B. Lightning", "C. USB-C", "D. Thunderbolt"]],
    "Answer : B"
  ],
  [
    243,
    "A CAD PC is running, but it has fault lights that are illuminated. The PC has four disk drives in the drive enclosure. One disk drive has a solid fault light, and another has a flashing fault light. The remaining two disk drives are green. The user was told the drives are hot pluggable. Which of the following should a technician do FIRST to resolve the issue?\n",
    [
      [
        "A. Remove the drive with the solid fault light and order a replacement drive.",
        "B. Reseat both of the error drives and reboot the PC.",
        "C. Verify hardware RAID state and configuration.",
        "D. Simultaneously replace both drives with the fault lights."
      ]
    ],
    "Answer : C"
  ],
  [
    244,
    "An end userג€™s laptop has a USB mouse connected. The user removes the USB mouse to pack up at the end of the work day. Before shutting down, the user tries to check a document but finds the built-in peripherals no longer work. Which of the following would BEST resolve this issue?\n",
    [
      [
        "A. Check the keyboard layout in Settings.",
        "B. Check the touch-pad settings.",
        "C. Check the power management settings.",
        "D. Check that the function key is not stuck."
      ]
    ],
    "Answer : B"
  ],
  [
    245,
    "A technician is building a workstation with 8GB of RAM that will host a VM. The VM will be used to test software installations prior to mass deployment. The workstation will also serve the installation files and packages necessary to install applications remotely on networked devices that have passed the testing process. Which of the following hardware components are needed for the setup to function as required? (Choose two.)\n",
    [
      [
        "A. Network interface card",
        "B. Secure boot",
        "C. Single-core CPU",
        "D. CPU virtualization support",
        "E. Additional RAM",
        "F. Hyperthreading"
      ]
    ],
    "Answer : AE"
  ],
  [
    246,
    "Which of the following connectors would MOST likely be found on an RG-6 cable?\n",
    [["A. Molex", "B. DB9", "C. BNC", "D. RJ45"]],
    "Answer : C"
  ],
  [
    247,
    "A technician is configuring a new desktop and wants to implement full disk encryption. When attempting this task, the technician gets an error stating the device cannot be encrypted. Which of the following does the technician need to enable so the drive can be encrypted?\n",
    [["A. BIOS", "B. TPM", "C. EFS", "D. UEFI"]],
    "Answer : B"
  ],
  [
    248,
    "Which of the following interfaces uses DB9 and DB25 connectors?\n",
    [["A. RS-232", "B. USB-C", "C. eSATA", "D. USB"]],
    "Answer : A"
  ],
  [
    249,
    "A customer purchased a device that can perform routing tasks, firewall tasks, deep packet inspection, and antivirus scanning. Which of the following devices did the customer purchase?\n",
    [
      [
        "A. Proxy server",
        "B. DHCP server",
        "C. UTM appliance",
        "D. IPS appliance",
        "E. IDS appliance"
      ]
    ],
    "Answer : C"
  ],
  [
    250,
    "A technician is selecting a long VGA cable to run through the walls and ceiling to a projector. Which of the following cable features will help minimize interference with the video signal?\n",
    [["A. Ferrite core", "B. Copper conductors", "C. Plenum", "D. Fiber"]],
    "Answer : A"
  ],
  [
    251,
    "A developer downloaded and installed a new VM on a hypervisor to test a piece of software following the release of an OS patch. After installing the VM, the developer is unable to download updates from the vendor. Which of the following should the developer check?\n",
    [
      [
        "A. The hypervisorג€™s security configurations ",
        "B. The organizationג€™s security policies ",
        "C. The guest OS network settings",
        "D. The resource requirements"
      ]
    ],
    "Answer : C"
  ],
  [
    252,
    "A customer purchased a new laptop and wants to upgrade its storage space. The customer is having difficulty identifying the hard drive in the unit. There does not appear to be a place for a 2.5in drive, but something similar in size to a stick of RAM is screwed in parallel to the motherboard. Which of the following drives does the customer need to purchase to upgrade the storage?\n",
    [["A. 3.5in drive", "B. 5400rpm drive", "C. RAID drive", "D. M.2 drive"]],
    "Answer : D"
  ],
  [
    253,
    "A company requires an internal network device that can assign network addresses and configure the next hop for network hosts. Which of the following network protocols must this device provide?\n",
    [["A. DNS", "B. SMTP", "C. DHCP", "D. SNMP"]],
    "Answer : C"
  ],
  [
    254,
    "An office worker requests dual-screen capability with a laptop. Which of the following peripherals is required to fulfill this request?\n",
    [["A. Docking station", "B. HD webcam", "C. KVM switch", "D. USB hub"]],
    "Answer : A"
  ],
  [
    255,
    "A user is unable to print to a printer on the network. When a technician runs the ping command, the technician receives a response. However, the hostname is not correct when the technician runs the nslookup command. Which of the following BEST describes the issue the technician is seeing?\n",
    [
      [
        "A. A missing subnet mask",
        "B. An IP address conflict",
        "C. An incorrect default gateway",
        "D. A DHCP timeout"
      ]
    ],
    "Answer : B"
  ],
  [
    256,
    "Users in a print room have a new high-end laser printer. They set the printer to print on both sides of the paper by default. They initiated several print jobs, but none of the jobs printed. Which of the following settings should a technician check to resume printing?\n",
    [["A. Spooler", "B. Draft", "C. Duplex", "D. Collate"]],
    "Answer : A"
  ],
  [
    257,
    "A technician is trying to identify the reason why a user, who has a static IP address, is unable to browse the Internet. The technician runs the ipconfig command and gets the following:\n\n\n\nThe technician then runs the tracert 8.8.8.8 command and gets the following:\n\n\nWhich of the following is the MOST likely issue the user is having?\n",
    [
      [
        "A. There is a problem with a network router.",
        "B. The wrong subnet mask is configured.",
        "C. There is a problem with a network switch.",
        "D. The user has an APIPA IP address configured."
      ]
    ],
    "Answer : A"
  ],
  [
    258,
    "A user has returned to headquarters from a remote office and is unable to connect a laptop to the office wireless network. After verifying that the userג€™s laptop is permitted to connect to the headquarters wireless network, the technician should confirm:\n",
    [
      [
        "A. if airplane mode is turned off.",
        "B. if the laptop has an APIPA address.",
        "C. if a check for IP conflicts is complete.",
        "D. if proxy server settings are disabled."
      ]
    ],
    "Answer : A"
  ],
  [
    259,
    "A user purchased a new laptop that has a built-in display, VGA connector, and DisplayPort connector. When working at the office, the user only wants an extended desktop to display on two external analog monitors. Which of the following is required?\n",
    [
      [
        "A. A VGA to HDMI converter",
        "B. A male-female VGA extension cable",
        "C. A DisplayPort to VGA adapter",
        "D. A powered VGA splitter box"
      ]
    ],
    "Answer : C"
  ],
  [
    260,
    "A developer reports a recurring computer issue while compiling a program. The computer works at first, but it locks up during the compilation process. An immediate reboot does not resolve the issue. Which of the following procedures will MOST likely solve the problem?\n",
    [
      [
        "A. Reapply thermal paste.",
        "B. Reseat the video card.",
        "C. Update the BIOS firmware.",
        "D. Decrease the number of memory modules."
      ]
    ],
    "Answer : A"
  ],
  [
    261,
    "A technician receives a call from a user who dropped a laptop and cracked the screen. The user needs it replaced quickly. The technician has to ensure the correct stock parts are in the storeroom. Which of the following components would the technician MOST likely need to repair the userג€™s laptop? (Choose two.)\n",
    [
      [
        "A. Webcam",
        "B. Microphone",
        "C. Video adapter",
        "D. Bezel",
        "E. Speaker",
        "F. LCD"
      ]
    ],
    "Answer : DF"
  ],
  [
    262,
    "While troubleshooting a magnetic hard drive, a technician hears a loud clicking noise, identifies S.M.A.R.T. errors, and notices the operating system will not load.\nWhich of the following is MOST likely the issue?\n",
    [
      [
        "A. The cooling fans are faulty, causing overheating.",
        "B. The read/write head is failing.",
        "C. The CPU is overclocked.",
        "D. There are mismatched memory modules."
      ]
    ],
    "Answer : B"
  ],
  [
    263,
    "A technician needs to build a cloud solution with the following parameters:\n✑ Predictable cost\n✑ Easy expansion of resources\n✑ Ability to control every aspect of the environment\nWhich of the following would be the BEST solution for the technician to implement?\n",
    [
      [
        "A. Hardware as a service",
        "B. Platform as a service",
        "C. Software as a service",
        "D. Hybrid cloud"
      ]
    ],
    "Answer : A"
  ],
  [
    264,
    "A technician needs to select and install network cabling in an office ceiling. The technician was told the space above the ceiling is part of the air conditioning return system. Which of the following cable features is MOST likely to be a safety requirement?\n",
    [
      [
        "A. Plenum insulation",
        "B. Category number",
        "C. Transmission limitations",
        "D. Shielded twisted pair"
      ]
    ],
    "Answer : A"
  ],
  [
    265,
    "A network administrator is deploying virtualization software to several desktop computers. Some of the installations fail because a processor function is disabled in the computerג€™s BIOS. Which of the following functions should be turned on for the installation to succeed?\n",
    [["A. Trusted Platform Module", "B. VNC", "C. Hyperthreading", "D. VT-x"]],
    "Answer : D"
  ],
  [
    266,
    "A user experiences a paper jam when printing a 500-page, double-sided report. A technician clears the paper jam and inspects the printer for any remaining paper. The technician then powers the printer off and back on. The printerג€™s LCD display says it is ready, and all cables are securely connected. The user attempts to print the report again, but the printer still does not print. It also shows no indication of any change. Which of the following troubleshooting steps should the technician attempt FIRST?\n",
    [
      [
        "A. Replace the drum and toner for the printer.",
        "B. Remove the printer memory and reseat it in the socket.",
        "C. Disassemble the printer body and look for further paper jams.",
        "D. Restart the print spooler service and inspect the queue.",
        "E. Try reinstalling the print driver for the printer."
      ]
    ],
    "Answer : D"
  ],
  [
    267,
    "A user reports that a small part of a laptopג€™s screen displays black instead of the appropriate color. A technician changes the display settings on the userג€™s laptop and then runs onboard diagnostics; however, the issue is still not resolved. Which of the following should the technician perform NEXT?\n",
    [
      [
        "A. Update the video driver.",
        "B. Replace the digitizer.",
        "C. Test for dead pixels.",
        "D. Check for recent updates."
      ]
    ],
    "Answer : C"
  ],
  [
    268,
    "A manager is trying to display a presentation using a ceiling-mounted projector in a conference room. The projector displays a \"no signal\" error on the pull-down projector screen. A technician verifies the projectorג€™s input cable is securely connected to the managerג€™s laptop, and the laptop is set to presentation mode. Which of the following is the MOST likely cause of the issue?\n",
    [
      [
        "A. The laptop does not have the proper display driver installed.",
        "B. The Miracast settings are improperly configured.",
        "C. The projector is not compatible with the managerג€™s laptop. ",
        "D. The source type is set incorrectly on the projector."
      ]
    ],
    "Answer : D"
  ],
  [
    269,
    "An application is not responding on a userג€™s workstation. After doing some research, a technician determines the drive is out of space. Which of the following should the technician do NEXT?\n",
    [
      [
        "A. Implement storage alerts to be notified if it happens again.",
        "B. Run diagnostics and review the system logs.",
        "C. Ask the user what happened before the application stopped responding.",
        "D. Identify files that can be deleted or removed."
      ]
    ],
    "Answer : D"
  ],
  [
    270,
    "A user reports the laser printer has stopped printing. When performing a test print, the page comes out mostly blank with ghosting images. A technician verifies a new toner cartridge was installed several weeks ago. There are no errors in the systemג€™s log. Which of the following is the MOST likely reason for the printer issue?\n",
    [
      [
        "A. There is no connectivity between the printer and the computer.",
        "B. The fuser has failed and requires replacement.",
        "C. Printer drivers are not installed on the computer.",
        "D. There is a stuck print job in the print queue."
      ]
    ],
    "Answer : B"
  ],
  [
    271,
    "An executive assistant needs a new computer, and it must have the following features:\n✑ Very small footprint and minimal power use\n✑ Automatic backup\n✑ Option to rapidly increase memory and available resources\n✑ Ability to print and access network and cloud resources\nWhich of the following computer types would BEST meet these requirements?\n",
    [["A. Laptop", "B. Desktop", "C. Virtual desktop", "D. Mini PC"]],
    "Answer : C"
  ],
  [
    272,
    "A technician identifies an incorrectly terminated network cable as the cause of intermittent network drops. Which of the following tools should the technician use to reterminate the network cable?\n",
    [
      [
        "A. A crimper",
        "B. A loopback plug",
        "C. A cable tester",
        "D. A multimeter"
      ]
    ],
    "Answer : A"
  ],
  [
    273,
    "A technician is repairing a laser printer because its print jobs have a narrow, faded line running along the length of the page from top to bottom. The faded line is always in the same place. Which of the following will MOST likely resolve the issue?\n",
    [
      [
        "A. Empty the excess toner bottle.",
        "B. Update the printer firmware.",
        "C. Replace the corona wire.",
        "D. Replace the transfer drum."
      ]
    ],
    "Answer : D"
  ],
  [
    274,
    "A business owner wants to filter objectionable content from being accessed with an Internet browser. Which of the following network devices would be BEST suited for this task?\n",
    [["A. IPS", "B. Web server", "C. Firewall", "D. Proxy server"]],
    "Answer : D"
  ],
  [
    275,
    "A technician is setting up a Windows 10 laptop as a kiosk at a retail store. Which of the following account types would the technician MOST likely use to configure the machine?\n",
    [
      [
        "A. Local administrative account",
        "B. Local standard account",
        "C. Corporate standard domain account",
        "D. Corporate administrative domain account"
      ]
    ],
    "Answer : B"
  ],
  [
    276,
    "A user is configuring a mobile device to retrieve email from an ISP. In the process of verifying the connection, the user receives a message stating the outbound connection cannot be completed. Which of the following BEST describes the userג€™s connection trouble?\n",
    [
      [
        "A. SMTP port numbers need to be reconfigured.",
        "B. An alternate IMAP server needs to be selected.",
        "C. POP3 needs the SSL state reconfigured.",
        "D. The user needs to connect using SNMP."
      ]
    ],
    "Answer : A"
  ],
  [
    277,
    "A technician is configuring a student laptop, and the network administrator requires it to be statically configured. The technician successfully pings the servers by\nIP but cannot ping by UNC. Which of the following is MOST likely the issue?\n",
    [["A. DHCP", "B. DNS", "C. Gateway", "D. IP address"]],
    "Answer : B"
  ],
  [
    278,
    "Ann, an end user, hears multiple beeps each time she attempts to start her workstation, but the computer does not boot successfully. The workstation was recently serviced for a separate issue. Which of the following will MOST likely resolve the current issue with the shortest amount of downtime?\n",
    [
      [
        "A. Reseat the RAM.",
        "B. Replace the PSU.",
        "C. Reset the BIOS.",
        "D. Replace the HDD."
      ]
    ],
    "Answer : A"
  ],
  [
    279,
    "A userג€™s laser printer stops printing when the paper tray is less than half full. Which of the following parts is causing the issue?\n",
    [
      [
        "A. Transfer roller",
        "B. Document feeder",
        "C. Transfer belt",
        "D. Pickup roller"
      ]
    ],
    "Answer : D"
  ],
  [
    280,
    "A technician received a call that the network printer was printing garbled text. The technician printed a test page from several usersג€™ workstations and received the same result. The technician then ran a diagnostic on the printer, and everything passed. After uninstalling the printer from a userג€™s workstation and then reinstalling it, the printer is now working properly. Which of the following was the cause of this issue?\n",
    [
      [
        "A. The font was changed by the user in the printing preferences.",
        "B. There were several print jobs hung in the queue.",
        "C. The toner level in the printer was extremely low.",
        "D. Drivers on the usersג€™ workstations were out of date. ",
        "E. The print server spooler file was corrupt."
      ]
    ],
    "Answer : D"
  ],
  [
    281,
    "Which of the following protocols operates without a port number assignment?\n",
    [["A. SNMP", "B. AFP", "C. TCP", "D. SSH"]],
    "Answer : B"
  ],
  [
    282,
    "Which of the following types of peripheral devices can be used to authenticate users on a computer system and provide access into a building?\n",
    [["A. Smart card", "B. QR scanner", "C. Number pad", "D. ADF"]],
    "Answer : A"
  ],
  [
    283,
    "A technician sets up 100 VMs networked in a cloud environment. Which of the following cloud models does this represent?\n",
    [["A. PaaS", "B. DBaaS", "C. IaaS", "D. SaaS"]],
    "Answer : C"
  ],
  [
    284,
    "A technician is installing an optical drive in an engineering workstation that allows for optical media backups up to 128GB for each project. Which of the following drives should the technician install in the workstation?\n",
    [["A. DVR-RW DL", "B. BD-R", "C. LTO-2", "D. CD-RW"]],
    "Answer : B"
  ],
  [
    285,
    "A user has a red X in the taskbar on a VM where Internet connectivity is usually located. Which of the following should be checked FIRST if all other operations are working normally on the VM?\n",
    [
      [
        "A. Patch level of the host",
        "B. Proxy server",
        "C. Virtual switch",
        "D. BIOS"
      ]
    ],
    "Answer : C"
  ],
  [
    286,
    "A user powers on a laptop and receives a message that it is under power. Which of the following should the user check FIRST?\n",
    [
      [
        "A. The surge protector",
        "B. The power cord",
        "C. The power adapter",
        "D. The power cable length"
      ]
    ],
    "Answer : C"
  ],
  [
    287,
    "Which of the following cable types would MOST likely be used for a gigabit Ethernet connection on a desktop?\n",
    [["A. RG59", "B. SATA", "C. IDE", "D. UTP"]],
    "Answer : D"
  ],
  [
    288,
    "Which of the following describes the network type that is created when connecting a Bluetooth headset to a cell phone?\n",
    [["A. WAN", "B. LAN", "C. MAN", "D. PAN"]],
    "Answer : D"
  ],
  [
    289,
    "A customer is experiencing issues connecting to a server over the network during normal business hours. Historically, the connection has worked fine, but it has become intermittent over the past 24 hours. Sometimes the share is available, and sometimes the customer gets an error. A technician researches the issue and discovers a new IT vendor visited the customer's site and installed some new computer equipment without consulting the internal team. Which of the following represents the MOST likely reason the customer is having issues connecting to the server?\n",
    [
      [
        "A. A server was taken offline for routine maintenance.",
        "B. There is an IP address conflict on the network.",
        "C. A firewall is blocking the SMB ports.",
        "D. Disabled legacy protocols need to be updated."
      ]
    ],
    "Answer : B"
  ],
  [
    290,
    "A company wants to cost-effectively improve efficiency in navigating to client sites and reduce cellular data costs. Which of the following actions would be BEST to meet these requirements?\n",
    [
      [
        "A. Issue stand-alone GPS units.",
        "B. Buy phones with mapping software.",
        "C. Purchase cars with built-in navigation.",
        "D. Purchase new laptops with mapping software."
      ]
    ],
    "Answer : A"
  ],
  [
    291,
    "A technician needs to implement a database in the cloud but does not want to manage any server infrastructure. Which of the following solutions would BEST meet this requirement?\n",
    [["A. IaaS", "B. PaaS", "C. SaaS", "D. DaaS"]],
    "Answer : D"
  ],
  [
    292,
    "A technician creates a VM in a public cloud to test a new application and then deletes the VM when finished. Which of the following BEST describes this type of cloud environment?\n",
    [["A. Community", "B. Elastic", "C. Hybrid", "D. On-demand"]],
    "Answer : D"
  ],
  [
    293,
    "Which of the following connector types would MOST likely be used to charge a laptop computer?\n",
    [["A. RJ45", "B. USB-C", "C. eSATA", "D. Lightning"]],
    "Answer : D"
  ],
  [
    294,
    "Which of the following can be used to manage a smart thermostat?\n",
    [["A. SFTP", "B. RDP", "C. WiFi", "D. NFC"]],
    "Answer : C"
  ],
  [
    295,
    "A technician installs a new PoE-capable wireless access point using a 200ft (61m) cable, but the access point does not power on when plugged into the Ethernet cable. The technician verifies the Ethernet cable is plugged into a working switchport. Which of the following should the technician do to resolve this issue?\n",
    [
      [
        "A. Relocate the AP closer to the switch.",
        "B. Replace the Ethernet cable with Cat 3.",
        "C. Set the switchport to autonegotiate.",
        "D. Install a power injector."
      ]
    ],
    "Answer : C"
  ],
  [
    296,
    "Which of the following wireless networking protocols includes a standardized version of the technology known as beamforming?\n",
    [["A. 802.11a", "B. 802.11ac", "C. 802.11n", "D. Bluetooth", "E. Z-Wave"]],
    "Answer : B"
  ],
  [
    297,
    "Joe, a user, cannot access the network shared drive after network maintenance was performed. A technician verifies there is a valid IP address; however, the device is not on the correct subnet. The device must continue to be accessible by a third party. Which of the following actions should the technician take to BEST resolve the issue?\n",
    [
      [
        "A. Remove and replace the NIC.",
        "B. Release and renew the computerג€™s DHCP assignment. ",
        "C. Change the mask on the computer and reboot.",
        "D. Assign a new port on the switch to the user."
      ]
    ],
    "Answer : B"
  ],
  [
    298,
    "The performance of a userג€™s PC has been degrading over time. The PC currently emits a strong odor and turns off after 15 minutes of use. A technician visually inspects the PC and notices it has distended capacitors. Which of the following should the technician do to BEST remediate the issue?\n",
    [
      [
        "A. Replace the hard drive.",
        "B. Replace the motherboard.",
        "C. Replace the CPU.",
        "D. Replace the memory."
      ]
    ],
    "Answer : B"
  ],
  [
    299,
    "A user is attempting to set up a new Bluetooth keyboard but is unable to pair the device. The user is able to see the device in the Bluetooth configuration tool.\nWhich of the following is the MOST likely cause of the failure?\n",
    [
      [
        "A. Bluetooth is disabled.",
        "B. A PIN code is required.",
        "C. There are different Bluetooth versions.",
        "D. The device is not compatible."
      ]
    ],
    "Answer : B"
  ],
  [
    300,
    "A user needs to set up a cloud environment that can scale up quickly based on resource utilization. Which of the following does the user need to configure?\n",
    [
      [
        "A. Hybrid cloud",
        "B. Metered service",
        "C. Rapid elasticity",
        "D. Resource pooling"
      ]
    ],
    "Answer : C"
  ],
  [
    301,
    "A technician is connecting an LCD projector to a laptop. The image displayed by the projector does not align properly with the top corners. The laptop screen is black, preventing the technician from changing the resolution settings on the computer. Which of the following is MOST likely affecting the projectorג€™s display?\n",
    [
      [
        "A. Distorted geometry",
        "B. No image displayed",
        "C. VGA mode function",
        "D. Disconnected cable"
      ]
    ],
    "Answer : A"
  ],
  [
    302,
    "A user requests a new laptop battery that will yield a longer run time. The userג€™s current battery has the following information printed on it:\n14.8V 6-cell 1800mAh lithium ion battery\nWhich of the following battery specifications will yield a longer run time but still be compatible with the current laptop?\n",
    [
      [
        "A. 14.8V 6-cell 1800mAh nickel cadmium battery",
        "B. 14.8V 6-cell 2200mAh lithium ion battery",
        "C. 14.8V 9-cell 1800mAh lithium ion battery",
        "D. 19.2V 6-cell 1800mAh lithium ion battery"
      ]
    ],
    "Answer : C"
  ],
  [
    303,
    "A userג€™s monitor is not displaying colors correctly since it was moved to a new desk. A technician investigates and discovers the user has two monitors: one is connected to the PC via a DisplayPort cable, and the other is using VGA. The technician traces the cables and finds the VGA-connected monitor is not displaying any red colors. Which of the following is MOST likely the issue?\n",
    [
      [
        "A. The OS installed the latest driver updates after powering up.",
        "B. The PC was damaged during the move.",
        "C. The pins on the VGA cable are bent.",
        "D. The video card is overheating at the new desk."
      ]
    ],
    "Answer : C"
  ],
  [
    304,
    "A client needs an MFD to be configured wirelessly to support an office. Access to copying should be restricted to employees; however, all users should be permitted to print from iOS devices. Which of the following should a technician configure to allow this to happen? (Choose two.)\n",
    [
      [
        "A. Ad-hoc wireless",
        "B. Print server",
        "C. Bluetooth",
        "D. AirPrint",
        "E. User authentication",
        "F. MAC filtering"
      ]
    ],
    "Answer : DE"
  ],
  [
    305,
    "A technician is troubleshooting a PC that intermittently reboots on its own. The PC is located in the middle of a factory environment and is stored in a tightly locked cabinet, which is free of dust and debris. The technician checks Event Viewer but sees no correlation between the reboots and other system activity. The only notable thing is that the reboots all occur in the afternoon. The technician reseats the two DIMMs of RAM and verifies all the cables and components are securely connected. Which of the following is the MOST likely cause of the reboots?\n",
    [
      [
        "A. OS updates are failing.",
        "B. The boot devices are in the wrong order.",
        "C. The PC is overheating and restarting.",
        "D. The RAM DIMMs are different speeds."
      ]
    ],
    "Answer : C"
  ],
  [
    306,
    "A SOHO wants to reduce printing costs. Which of the following forced configurations would BEST accomplish this goal?\n",
    [
      [
        "A. Duplex printing",
        "B. Portrait orientation",
        "C. Decreased resolution",
        "D. Forced collating"
      ]
    ],
    "Answer : A"
  ],
  [
    307,
    "A technician needs to set up a desktop so a programmer can write applications for mobile operating systems. This will require the installation of:\n",
    [
      [
        "A. a CPU that supports hyperthreading,",
        "B. a Trusted Platform Module.",
        "C. mobile device management.",
        "D. emulator software"
      ]
    ],
    "Answer : D"
  ],
  [
    308,
    "A user is looking for software that can overlay information on objects seen through the camera of a mobile device. This is an example of.\n",
    [
      [
        "A. augmented reality.",
        "B. virtual reality.",
        "C. geotagging.",
        "D. artificial intelligence.",
        "E. object character recognition."
      ]
    ],
    "Answer : A"
  ],
  [
    309,
    "A technician is building a new PC and needs to install RAM. The motherboard has four slots, which are grouped in pairs. Which of the following types of RAM would be MOST appropriate?\n",
    [
      [
        "A. Single channel",
        "B. Dual channel",
        "C. Triple channel",
        "D. Quad channel"
      ]
    ],
    "Answer : B"
  ],
  [
    310,
    "Ann, a user, reports she cannot view any emails from last year on her new smartphone. A technician checks Annג€™s webmail and confirms emails are present in the inbox on the account, but they are not available on her phone. The email server settings are configured correctly on the phone. Which of the following steps should resolve the problem?\n",
    [
      [
        "A. Change the synchronization frequency to push only.",
        "B. Install and configure a third-party email application on the phone.",
        "C. Perform a factory reset of the phone and reconfigure email.",
        "D. Increase the number of days email is synced to the phone."
      ]
    ],
    "Answer : A"
  ],
  [
    311,
    "A technician needs to connect a user to a network share on the server. Which of the following ports should the technician allow through the firewall?\n",
    [["A. 67", "B. 137", "C. 143", "D. 445", "E. 3389"]],
    "Answer : B"
  ],
  [
    312,
    "A user is experiencing slow performance on a workstation. A technician investigates and speculates the performance issue is being caused by an excessive number of background services running at startup. The technician troubleshoots the issue, and then finds and disables many services that have been running at startup. Next, the technician informs the user the remediation is complete. The following morning, the technician receives a call from the same user reporting performance is still slow. Which of the following troubleshooting steps did the technician MOST likely fail to complete?\n",
    [
      [
        "A. Establish a theory of probable cause.",
        "B. Identity the problem.",
        "C. Verify full system functionality",
        "D. Document findings, actions, and outcomes."
      ]
    ],
    "Answer : A"
  ],
  [
    313,
    "After upgrading a laptopג€™s OS from Windows Vista to Windows 10, hard drive activity is elevated when running normal user applications, causing the laptop to run slowly. Which of the following should a technician do FIRST?\n",
    [
      [
        "A. Flash the laptop BIOS to the most current version available from the manufacturer.",
        "B. Replace both of the installed 1GB SoDIMMs with compatible 4GB SoDIMMs.",
        "C. Attach an external USB hard drive and move all user data off the internal drive.",
        "D. Upgrade the currently installed 500GB SSD with a 1TB SSD."
      ]
    ],
    "Answer : A"
  ],
  [
    314,
    "A technician finishes building a custom gaming computer. When the system is turned on, however, all the fans spin and the LEDs light up on the motherboard, but the system does not POST and the monitor remains blank. Which of the following did the technician fail to connect to the motherboard?\n",
    [
      [
        "A. SATA signal cable",
        "B. CPU power cable",
        "C. Power LED",
        "D. Motherboard power cable"
      ]
    ],
    "Answer : A"
  ],
  [
    315,
    "A user wants to build a new home computer that will be used exclusively for the latest offline games. The user consults with a technician on the best hardware to purchase. The user has already picked out the CPU, GPU, RAM, and motherboard, but is unsure what else is important to achieve top performance. Which of the following should the technician suggest? (Choose two.)\n",
    [
      [
        "A. IDE connectors",
        "B. PCIe slots",
        "C. TPM unit",
        "D. Liquid cooling",
        "E. Gigabit NIC",
        "F. Thermal paste",
        "G. Virtualization"
      ]
    ],
    "Answer : BF"
  ],
  [
    316,
    "A technician recently installed a new router. Since the installation was completed, a userג€™s PC loses network connectivity when another userג€™s PC comes online.\nWhich of the following commands are BEST for the technician to run to resolve this issue? (Choose two.)\n",
    [
      [
        "A. ipconfig / renew",
        "B. ipconfig / all",
        "C. ipconfig / flushdns",
        "D. ipconfig / registerdns",
        "E. ipconfig / release",
        "F. ipconfig / displaydns"
      ]
    ],
    "Answer : AE"
  ],
  [
    317,
    "An administrator notices the RAID 5 array is reporting a degraded health message. It contains three HDDs. A technician replaces the faulty HDD with a new one, but users then report access to the fileshare is not as fast as it used to be. Which of the following is MOST likely preventing the RAID array from operating optimally?\n",
    [
      [
        "A. The mirrored set is broken.",
        "B. Write caching has been turned on.",
        "C. The wrong drive was replaced.",
        "D. The RAID array is rebuilding."
      ]
    ],
    "Answer : C"
  ],
  [
    318,
    "A vendor connects a laptop to the projector for a presentation but notices the projector is not listed as a display in the display properties. Which of the following troubleshooting steps should be done FIRST?\n",
    [
      [
        "A. Ensure the projector is on.",
        "B. Install the projector drivers.",
        "C. Update the graphics drivers.",
        "D. Verify laptop compatibility."
      ]
    ],
    "Answer : A"
  ],
  [
    319,
    "Which of the following colors is used to designate a USB 3.0 connector?\n",
    [["A. Blue", "B. Black", "C. Green", "D. White"]],
    "Answer : A"
  ],
  [
    320,
    "A technician discovered a spare cable at a userג€™s desk. The ends of the cable terminate in a plastic connector with four pins, only two of which contain conductors.\nWhich of the following connector types did the technician find?\n",
    [["A. RG-6", "B. RJ11", "C. RJ45", "D. RG-59"]],
    "Answer : B"
  ],
  [
    321,
    "A technician is deploying PCs in a new office that has both wired and wireless connectivity. The deployment must be completed quickly, since the office is scheduled to open soon. Which of the following must the technician perform to ensure the devices are ready for use when the newly hired employees arrive?\n(Choose two.)\n",
    [
      [
        "A. Create system policies and configurations.",
        "B. Set up local accounts per station.",
        "C. Set up mailbox quotas per account.",
        "D. Install the OS and applications.",
        "E. Synchronize user files to the cloud.",
        "F. Map the network drives."
      ]
    ],
    "Answer : BD"
  ],
  [
    322,
    "Which of the following servers provides access to user data over a LAN?\n",
    [["A. Proxy server", "B. DHCP server", "C. Web server", "D. File server"]],
    "Answer : D"
  ],
  [
    323,
    "Static addressing was replaced with dynamic addressing during network maintenance. Following the maintenance, multiple users began reporting connectivity issues. A technician sees the following when checking the address assignments on a userג€™s workstation:\n\nIP address 169.254.1.2 -\nThe technician attempts to run commands that will force the PC to request a new IP address, but the technician receives the same address. Which of the following should the technician do NEXT?\n",
    [
      [
        "A. Run the command ipconfig/flushdns to force the PC to use the DNS server for its next request.",
        "B. Switch the PC to the wireless network to get the users back to work.",
        "C. Replace the network cable from the PC to the wall jack.",
        "D. Check the DHCP server to ensure the scope is large enough for all users."
      ]
    ],
    "Answer : D"
  ],
  [
    324,
    "Which of the following cloud computing concepts is used to describe online providers that serve multiple clients with scalable services, such as access to a large number of CPUs and memory from multiple sources?\n",
    [
      [
        "A. Rapid elasticity",
        "B. Measured service",
        "C. Cloud file-storage service",
        "D. Resource pooling"
      ]
    ],
    "Answer : D"
  ],
  [
    325,
    "When a user types on a laptop, the cursor randomly moves around and clicks elsewhere in the document, causing the user to have to edit and retype portions of the document. Which of the following should the technician disable to resolve the issue?\n",
    [["A. Wireless", "B. Airplane mode", "C. Touchpad", "D. External monitor"]],
    "Answer : C"
  ],
  [
    326,
    "Which of the following is a common use for NAT?\n",
    [
      [
        "A. Automatically assigning network addresses",
        "B. Hiding the network portion of an IPv4 address",
        "C. Connecting multiple devices through a single public IP address",
        "D. Resolving alphanumeric names to addresses"
      ]
    ],
    "Answer : C"
  ],
  [
    327,
    "Immediately after a small company implemented VoIP telephony, users began reporting dropped calls. Large files and videos are being transferred on the same network as the VoIP phones. Which of the following should the network administrator do to prevent dropped calls? (Choose two.)\n",
    [
      [
        "A. Implement QoS.",
        "B. Increase MTU.",
        "C. Implement download quotas.",
        "D. Update phone firmware.",
        "E. Move VoIP phone sets to different VLAN.",
        "F. Configure a separate DNS server for the VoIP phones."
      ]
    ],
    "Answer : AE"
  ],
  [
    328,
    "A technician installed a new printer for a client and successfully printed a test page. The next day, the customer reports there are garbled characters on printed pages. The technician questions the user and discovers OS updates were applied overnight. Which of the following should the technician check NEXT to troubleshoot the issue?\n",
    [
      [
        "A. If the device appears in the Device Manager",
        "B. If the correct printer driver is selected",
        "C. If the printerג€™s onboard memory is low ",
        "D. If the Windows Print Spooler service is running"
      ]
    ],
    "Answer : B"
  ],
  [
    329,
    "Which of the following must be configured to allow two VLANs to communicate with each other?\n",
    [
      [
        "A. Common gateway device",
        "B. Static IP address on a switch",
        "C. Valid IPv6 link local address",
        "D. Connection to a VPN service"
      ]
    ],
    "Answer : A"
  ],
  [
    330,
    "Which of the following can be used to extend a wired network using an adapter and electrical outlet?\n",
    [
      [
        "A. Layer 3 switch",
        "B. Patch panel",
        "C. Ethernet over power",
        "D. Repeater"
      ]
    ],
    "Answer : C"
  ],
  [
    331,
    "A laser printer feeds multiple pages through at the same time. Some of the pages have poor image quality, and many of the pages have toner that is easily smeared on the finished page. Which of the following should a technician order to fix the issues with the printer?\n",
    [
      [
        "A. Paper tray",
        "B. Corona wire",
        "C. Maintenance kit",
        "D. Toner cartridge"
      ]
    ],
    "Answer : D"
  ],
  [
    332,
    "A customer works from home and uses business applications on a basic workstation. The customer wants to turn the workstation into a gaming workstation.\nWhich of the following components would need to be installed to accomplish this task?\n",
    [
      [
        "A. A hypervisor",
        "B. A TPM solution",
        "C. A high-end processor",
        "D. A RAID 1 array"
      ]
    ],
    "Answer : C"
  ],
  [
    333,
    "A systems administrator is troubleshooting a database server on a company LAN. Users are unable to run any database applications, but all workstations can ping the server with normal latency. Which of the following should the technician do NEXT to resolve the issue while adhering to best practices?\n",
    [
      [
        "A. Review the system and application logs.",
        "B. Document the findings",
        "C. Perform a full backup",
        "D. Reboot the server."
      ]
    ],
    "Answer : A"
  ],
  [
    334,
    "A technician needs to run cabling from the patch panel to a new breakout box. Which of the following should the technician use to connect the cable to the jack at both the new location and the patch panel in the network wiring closet?\n",
    [
      [
        "A. Wire crimper",
        "B. Multimeter",
        "C. Punchdown tool",
        "D. Cable tester"
      ]
    ],
    "Answer : A"
  ],
  [
    335,
    "A workstationג€™s RAM is being upgraded to 24GB. The system has six RAM slots supporting DDR4 dual-channel, with a maximum of 32GB total system memory.\nWhich of the following configurations will maximize system performance?\n",
    [
      [
        "A. Two 4GB DDR4 chips and one 16GB DDR4 chip",
        "B. Two 8GB DDR4 chips and one 8GB DDR4 chips",
        "C. Four 8GB DDR2 chips",
        "D. Six 4GB DDR4 chips"
      ]
    ],
    "Answer : C"
  ],
  [
    336,
    "A virtual environment in which an application uses memory and a processor from a provider based on a leased rate that depends on the amount of resources used per month is referred to as:\n",
    [
      [
        "A. virtual application streaming service",
        "B. metered service",
        "C. resource pooling",
        "D. SaaS"
      ]
    ],
    "Answer : B"
  ],
  [
    337,
    "The marketing department received a laser printer from the finance department. The marketing department wants to connect the laser printer to the Ethernet network, but it has no physical network jack. Which of the following should a technician try FIRST to connect this printer to the network?\n",
    [
      [
        "A. Install an integrated print server.",
        "B. Order the appropriate printer model for the department.",
        "C. Connect the printer to a serial A/B switch.",
        "D. Contact the vendor for a firmware update."
      ]
    ],
    "Answer : A"
  ],
  [
    338,
    "Which of the following wireless standards provides the HIGHEST bandwidth?\n",
    [["A. 802.11a", "B. 802.11ac", "C. 802.11b", "D. 802.11g"]],
    "Answer : B"
  ],
  [
    339,
    "A company is hosting a Windows email server on its premises. Company policy is to use encryption on incoming an outgoing email services. An administrator recently upgraded the companyג€™s firewall. Users report they can receive email, but no one can send email. Which of the following ports should the administrator open on the new firewall?\n",
    [["A. 21", "B. 80", "C. 389", "D. 465"]],
    "Answer : D"
  ],
  [
    340,
    "Which of the following connectors is oval-shaped and used to connect to mobile devices?\n",
    [["A. Lightning", "B. RG-6", "C. RJ45", "D. USB-C"]],
    "Answer : D"
  ],
  [
    341,
    "A small business owner purchased an MFP and would like customers to be able to print from their mobile devices. However, customers should not be granted access to the wireless network. Which of the following should the business owner enable? (Choose two.)\n",
    [
      [
        "A. AirPrint",
        "B. Parallel",
        "C. NFC",
        "D. Serial",
        "E. USB",
        "F. Bluetooth"
      ]
    ],
    "Answer : BE"
  ],
  [
    342,
    "A userג€™s touch-screen tablet is having issues with the screen orientation frequently being incorrect. Which of the following is MOST likely causing the issue?\n",
    [
      [
        "A. The digitizer is malfunctioning.",
        "B. The tablet needs a new screen protector.",
        "C. The screen rotation is locked.",
        "D. The tablet needs a new inverter."
      ]
    ],
    "Answer : C"
  ],
  [
    343,
    "A customer travels often and needs to connect a laptop to the home office server. The customer wants to use a cell phone data connection but has connected to the wrong network in the past. Which of the following would work BEST to ensure a secure connection through the cell phone?\n",
    [
      [
        "A. Bluetooth with PIN",
        "B. Tethering with USB",
        "C. Hotspot with WPA",
        "D. Public WiFi with password"
      ]
    ],
    "Answer : B"
  ],
  [
    344,
    "A userג€™s laptop is not connecting to the companyג€™s file server. The user provides the following network information from the laptop:\n\n\n\nWhich of the following is MOST likely causing the issue?\n",
    [
      [
        "A. DHCP error",
        "B. IPv4 conflict",
        "C. No WiFi connection",
        "D. MAC filtering"
      ]
    ],
    "Answer : A"
  ],
  [
    345,
    "A user is setting up a public-facing web server. Which of the following should the user configure to keep the rest of the network isolated from the server?\n",
    [["A. ARP", "B. QoS", "C. UPnP", "D. DMZ"]],
    "Answer : D"
  ],
  [
    346,
    "A technician has assembled an ITX system with a modern processor, but the machine does not POST. The processor fan spins up, and the LEDs on the motherboard light up, but no beeps are emitted by the system. Which of the following is the MOST likely cause of this issue?\n",
    [
      [
        "A. An incompatible NVMe SSD is installed.",
        "B. An incompatible memory type is installed.",
        "C. The wrong generation CPU is installed.",
        "D. A faulty hard drive is installed."
      ]
    ],
    "Answer : D"
  ],
  [
    347,
    "Which of the following explains how a cloud computing provider is able to provide scalable services to several different clients?\n",
    [
      [
        "A. Synchronization",
        "B. Measured service",
        "C. Resource pooling",
        "D. On demand"
      ]
    ],
    "Answer : C"
  ],
  [
    348,
    "A customer wants to store archived data on inexpensive optical media that will then be placed in a safe. According to the customer, each runoff of data will be between 2GB and 3GB. Which of the following devices does a technician need to install for the customer?\n",
    [
      [
        "A. DVD-RW drive",
        "B. CD-RW drive",
        "C. Blu-ray drive",
        "D. M.2 drive",
        "E. NVMe drive"
      ]
    ],
    "Answer : A"
  ],
  [
    349,
    "A technician is setting up a new workstation. The technician wants to make sure the workstation will not load the OS if a portable hard drive is connected to it.\nWhich of the following should the technician configure?\n",
    [
      [
        "A. Trusted Platform Module",
        "B. Secure boot",
        "C. Legacy mode",
        "D. Drive encryption"
      ]
    ],
    "Answer : C"
  ],
  [
    350,
    "A technician is building out a small retail shop. The owner wants all the cash registers to remote into a server in the back of the shop rather than running an OS locally. Which of the following should the technician install for the registers?\n",
    [
      [
        "A. Thin clients",
        "B. Portable mobile devices",
        "C. Touch screen kiosks",
        "D. Laptops with docking stations"
      ]
    ],
    "Answer : A"
  ],
  [
    351,
    "A technician is deploying a wireless access point for streaming 4K videos and online gaming. Which of the following wireless frequencies is MOST appropriate in this scenario?\n",
    [["A. 2.4GHz", "B. 5GHz", "C. 900MHz", "D. 1300MHz"]],
    "Answer : B"
  ],
  [
    352,
    "A technician installed a new scanner and imaging camera on a desktop to upload high-resolution images into an electronic health records application. This application is am example of:\n",
    [
      [
        "A. a virtual client.",
        "B. a secure client.",
        "C. a thick client.",
        "D. an on-demand client."
      ]
    ],
    "Answer : A"
  ],
  [
    353,
    "A userג€™s smartphone has been experiencing performance issues, and it needs to be charged more often. A technician also notices there have been spikes in the smartphoneג€™s CPU and memory usage. Which of the following would MOST likely help to improve the performance of the smartphone?\n",
    [
      [
        "A. Configuring automatic updates",
        "B. Conditioning the battery",
        "C. Disabling unnecessary services",
        "D. Turning off cellular roaming"
      ]
    ],
    "Answer : C"
  ],
  [
    354,
    "Which of the following is a type of reversible connector?\n",
    [["A. RJ45", "B. Molex", "C. eSATA", "D. USB-C"]],
    "Answer : D"
  ],
  [
    355,
    "A user is not receiving emails on a laptop. A technician is able to send emails using the local client; however, no new emails are being received. The POP3 and\nSMTP settings in the corporate email configuration look correct. The technician notices a new antivirus program was installed on the machine recently. Which of the following is MOST likely causing the problem?\n",
    [
      [
        "A. The POP3 port is being blocked.",
        "B. The email password stored is incorrect.",
        "C. The user needs to enable TLS.",
        "D. The user is not connected to the Internet."
      ]
    ],
    "Answer : A"
  ],
  [
    356,
    "A computer has a static address configured and is able to connect to resource on the same VLAN but is unable to access resources on other VLANs. Which of the following should be configured to allow this communication?\n",
    [["A. Hub", "B. Bridge", "C. Router", "D. Access point", "E. Repeater"]],
    "Answer : C"
  ],
  [
    357,
    "A technician is troubleshooting a corporate Windows PC that has a distorted image on the monitor. The user states the PC was working fine yesterday. Other computers are having the same issue. Which of the following should the technician do FIRST?\n",
    [
      [
        "A. Check the BIOS firmware revision level.",
        "B. Update the graphic drivers to the latest version.",
        "C. Check with the IT department to see if any updates were pushed out.",
        "D. Ask the users to reboot their computers to see if the problem clears."
      ]
    ],
    "Answer : C"
  ],
  [
    358,
    "The wireless feature of a userג€™s laptop has stopped working. A technician replaces the wireless card, but the wireless range is now very limited. The technician removes the case. Which of the following should the technician do NEXT?\n",
    [
      [
        "A. Update the drivers for the wireless card.",
        "B. Replace the wireless antenna.",
        "C. Check for an updated BIOS.",
        "D. Verify the antenna connection."
      ]
    ],
    "Answer : D"
  ],
  [
    359,
    "A technician is upgrading a lab to VDI using thin client computers. The lab previously used laptops with a WiFi connection. Which of the following is required for the thin clients to operate?\n",
    [["A. UPS", "B. Network cable", "C. External hard drives", "D. KVM"]],
    "Answer : B"
  ],
  [
    360,
    "A laptop is overheating. A technician checks that the laptop is clean and free from dust buildup. Which of the following should the technician check NEXT?\n",
    [
      [
        "A. If the CPU heat sink is seated properly",
        "B. If all system fans are functioning",
        "C. If the PSU is working properly",
        "D. If the cooling management policy is correct"
      ]
    ],
    "Answer : B"
  ],
  [
    361,
    "A technician receives a laptop due to its low performance and intermittent S.M.A.R.T. errors on boot up. Which of the following is the NEXT step the technician should take to diagnose the issue?\n",
    [
      [
        "A. Low-level format the existing drive.",
        "B. Repair the OS installation on the existing drive.",
        "C. Immediately replace the failing drive.",
        "D. Copy the userג€™s profile folder to an external drive. "
      ]
    ],
    "Answer : D"
  ],
  [
    362,
    "A developer wants to be able to run a virtual machine on a desktop for application testing. Which of the following should a technician implement to complete this request?\n",
    [["A. KVM", "B. Thin client", "C. Remote desktop", "D. Type 2 hypervisor"]],
    "Answer : D"
  ],
  [
    363,
    "A user receives a replacement modem/router combination device from an ISP and plugs it in. A laptop connected to the router via WiFi receives an address in the\n192.168.0.x range but is unable to access the Internet. Which of the following would MOST likely resolve the problem?\n",
    [
      [
        "A. Upgrade the network drivers on the laptop.",
        "B. Change the laptop from a wireless to a wired connection.",
        "C. Register the new cable modem MAC address with the ISP.",
        "D. Update the password on the wireless connection."
      ]
    ],
    "Answer : C"
  ],
  [
    364,
    "Which of the following should be considered FIRST when upgrading the power supply on a high-end gaming PC?\n",
    [
      [
        "A. Wattage rating",
        "B. PSU redundancy",
        "C. Cooling fans",
        "D. 20+4 pin adapter"
      ]
    ],
    "Answer : A"
  ],
  [
    365,
    "Which of the following allows several VMs to run on a single host?\n",
    [
      [
        "A. Resource pooling",
        "B. Multitenancy",
        "C. On demand",
        "D. Measured service"
      ]
    ],
    "Answer : A"
  ],
  [
    366,
    "A user is having difficulty using a personal all-in-one printer. When the user scans a single-page document in flatbed mode, the scan appears correctly; however, when using the printerג€™s document feeder, the scan has a vertical line going across the page. Which of the following should a technician perform FIRST to resolve this issue?\n",
    [
      [
        "A. Replace the printerג€™s ADF. ",
        "B. Install a pickup roller replacement kit.",
        "C. Clean the separation pad.",
        "D. Use a microfiber cloth to clean the glass."
      ]
    ],
    "Answer : B"
  ],
  [
    367,
    "A technician needs to configure a high-end workstation with four hard drives for redundancy. The customer wants the end result to have the highest capacity possible but still have the ability to survive a drive failure. Which of the following RAID levels should the technician configure to accomplish this?\n",
    [["A. RAID 0", "B. RAID 1", "C. RAID 5", "D. RAID 10"]],
    "Answer : D"
  ],
  [
    368,
    "A technician receives a smartphone that has been experiencing screen-related issues. The display is barely visible, and the battery indicates the charge level is very low. The technician connects the device to a power source, but the screen remains dim. Which of the following should the technician perform FIRST to resolve the issue?\n",
    [
      [
        "A. Enable airplane mode on the smartphone.",
        "B. Reset the smartphone to factory settings.",
        "C. Manually restart the smartphone.",
        "D. Remove and reinsert the smartphoneג€™s battery. "
      ]
    ],
    "Answer : B"
  ],
  [
    369,
    "A user reports paper output from a printer has toner that is not sticking to the page. The output smears when it is touched. A technician notes the appropriate paper is being used. The toner appears to be low but is a supported OEM cartridge. Which of the following would MOST likely fix this issue?\n",
    [
      [
        "A. Replace the developer roll",
        "B. Replace the toner",
        "C. Find and remove any jammed paper",
        "D. Replace the fuser",
        "E. Replace the drum"
      ]
    ],
    "Answer : D"
  ],
  [
    370,
    "In a server room, a technology that physically connects multiple servers so they can share a single set of input devices and a display is called a:\n",
    [["A. KVM.", "B. VDI.", "C. RDP.", "D. PnP."]],
    "Answer : A"
  ],
  [
    371,
    "Ann, a user, asks a technician to configure her mobile phone for various sync capabilities. Ann wants to use her work email account on the phone everywhere she goes. She also would like the ability to connect her phone to her work vehicle for audio. Which of the following technologies would BEST meet Annג€™s needs?\n(Choose two.)\n",
    [
      [
        "A. Wireless hotspot mode",
        "B. IMAP",
        "C. NFC",
        "D. S/MIME",
        "E. Bluetooth",
        "F. VPN"
      ]
    ],
    "Answer : BE"
  ],
  [
    372,
    "A technician is upgrading the storage on an Android tablet. The technician installs a new microSD card, but the tablet does not show any additional storage is available for use. Which of the following is the MOST likely cause of the unavailable storage?\n",
    [
      [
        "A. The microSD card is not formatted",
        "B. The microSD card is not a Class 10 device",
        "C. The systemג€™s OS is not updated ",
        "D. The microSD card is defragmented"
      ]
    ],
    "Answer : A"
  ],
  [
    373,
    "Which of the following should a technician verify before purchasing a PSU for use in a computer with a high-end graphics card?\n",
    [
      [
        "A. Wattage rating",
        "B. Input 12V",
        "C. Output 115V",
        "D. Efficiency rating"
      ]
    ],
    "Answer : A"
  ],
  [
    374,
    "Some users are having intermittent trouble working with files on a shared folder. A technician is able to access the share and modify data. The technician verifies no changes were made to the RAID array, and it appears healthy. Logging, however, reports the cache module failed. Which of the following explains the issue being experienced?\n",
    [
      [
        "A. Read/write failures",
        "B. File permissions on share",
        "C. Concurrent editing locked",
        "D. Loud clicking noise"
      ]
    ],
    "Answer : C"
  ],
  [
    375,
    "A user notices a crushing sound coming from a multifunction printer. The user investigates and notices several pages printed off center, and some of the pages did not print. A technician arrives to troubleshoot and notices the MFP has several warnings. Which of the following steps should the technician take to resolve the issues? (Choose two.)\n",
    [
      [
        "A. Replace the rollers",
        "B. Clean the transfer drum",
        "C. Clear the counters",
        "D. Replace the toner",
        "E. Delete all the print jobs",
        "F. Clear the paper jam"
      ]
    ],
    "Answer : AF"
  ],
  [
    376,
    "An inkjet printer shows a print-head quality problem. The user replaces the print head, and then the printer is online and indicates no errors. Users then report text documents print fine, but color charts are not correct. Which of the following should be checked FIRST?\n",
    [
      [
        "A. The color ink cartridges are from the printer manufacturer",
        "B. The print quality is set to best",
        "C. The print head alignment check passes",
        "D. Print drivers are up to date"
      ]
    ],
    "Answer : C"
  ],
  [
    377,
    "Which of the following cloud computing concepts is used when a company requires its cloud infrastructure to grow with its business?\n",
    [["A. PaaS", "B. Application streaming", "C. Rapid elasticity", "D. SaaS"]],
    "Answer : C\n\nReference:\nhttps://www.techopedia.com/definition/29526/rapid-elasticity\n"
  ],
  [
    378,
    "Which of the following offers the longest battery life and has a screen designed specifically for use in direct sunlight?\n",
    [["A. Smartphone", "B. E-reader", "C. Tablet", "D. Ultrabook"]],
    "Answer : B"
  ],
  [
    379,
    "Users of an older laser printer notice the printing on output is easily scratched off the paper. Which of the following is the MOST likely root cause?\n",
    [
      [
        "A. The paper in the trays has been exposed to moist air",
        "B. The toner cartridge contains old toner",
        "C. The corona wire is defective and needs to be replaced",
        "D. The fuser assembly is not reaching the correct temperature"
      ]
    ],
    "Answer : D\n\nReference:\nhttp://resources.lasertekservices.com/what-is-a-printer-fuser-unit/\n"
  ],
  [
    380,
    "A technician set up a shared printer on the company network for company users to print. The technician also set up a user to print from outside the company through the native cloud printing software. The technician ensures the network is set up to pass the traffic without error. However, when printing a test page, the user received the following error message: Printer unavailable. Which of the following should the technician do to stop the error message?\n",
    [
      [
        "A. Update the drivers on the workstation",
        "B. Configure AirPrint",
        "C. Disable integrated print services",
        "D. Change the authentication settings",
        "E. Enable remote print"
      ]
    ],
    "Answer : C"
  ],
  [
    381,
    "Which of the following network types utilizes Bluetooth technology?\n",
    [["A. MAN", "B. PAN", "C. LAN", "D. WAN"]],
    "Answer : B"
  ],
  [
    382,
    "While on a business trip, an employeeג€™s laptop battery is draining more quickly than usual. The employee is using a 4G connection to work remotely. Which of the following battery-consuming features should the employee configure temporarily to conserve the MOST battery life and continue to work as usual?\n",
    [
      [
        "A. Cellular",
        "B. Airplane mode",
        "C. Keyboard backlight",
        "D. Screen brightness"
      ]
    ],
    "Answer : D"
  ],
  [
    383,
    "A development team is assigned to use Mac OS computers but will require the Windows OS for additional software testing. Which of the following would be the\nEASIEST and MOST effective way to run both operating systems at the same time?\n",
    [
      [
        "A. Connect via RDP to a Windows computer",
        "B. Run a Type 1 hypervisor",
        "C. Use Boot Camp",
        "D. Subscribe to a VPS"
      ]
    ],
    "Answer : C"
  ],
  [
    384,
    "Which of the following is the BEST example of rapid elasticity in cloud computing?\n",
    [
      [
        "A. Being able to rapidly decommission virtual servers when requested",
        "B. Being able to limit the amount of resources used by a group of virtual servers",
        "C. Being able to adjust available CPU resources depending on the daily load",
        "D. Being able to restore to old system states within seconds"
      ]
    ],
    "Answer : C"
  ],
  [
    385,
    "A technician is troubleshooting Internet connectivity issues at a small office. The office is using standard wireless access points, and all clients are connected wirelessly. When troubleshooting one of the clients, the technician notices the IP address is 169.254.0.23. Which of the following is MOST likely the cause of the issues?\n",
    [
      [
        "A. An IP conflict is present on the network",
        "B. The DHCP server is offline",
        "C. The Internet provider connection is down",
        "D. The IP range is set incorrectly"
      ]
    ],
    "Answer : B"
  ],
  [
    386,
    "Which of the following cables can carry both a digital and an analog signal?\n",
    [["A. DVI-I", "B. HDMI", "C. DisplayPort", "D. DVI-D"]],
    "Answer : C"
  ],
  [
    387,
    "Which of the following MOST accurately explains what a VPN connection represents?\n",
    [
      [
        "A. An encrypted set of packets meant to pass information between virtual layer networks",
        "B. An encrypted channel connecting two PANs over a private LAN",
        "C. An encrypted channel connecting two LANs over a public WAN",
        "D. An encrypted channel connecting two MANs over a public WAN"
      ]
    ],
    "Answer : C"
  ],
  [
    388,
    "Users report they cannot print to the network printer. The printer is on and has the correct static IP address settings. Which of the following should the technician check NEXT?\n",
    [
      [
        "A. USB connection",
        "B. Printer drivers",
        "C. Wireless settings",
        "D. Router settings"
      ]
    ],
    "Answer : B"
  ],
  [
    389,
    "A librarian wants to set up a basic Windows PC in a room at the local library for public use. The librarian wants users to be able to browse the Internet but not make any changes to the PC. Which of the following settings would be MOST appropriate for this PC?\n",
    [
      [
        "A. Guest account",
        "B. Restricted account",
        "C. Root account",
        "D. Administrator account",
        "E. Standard account"
      ]
    ],
    "Answer : A"
  ],
  [
    390,
    "A technician is setting up a BYOD smartphone to access corporate collaborative resources. Which of the following will MOST likely be synchronized to the corporate network? (Choose two.)\n",
    [
      [
        "A. Email",
        "B. Calendar",
        "C. Location data",
        "D. E-books",
        "E. Passwords",
        "F. Applications"
      ]
    ],
    "Answer : AB"
  ],
  [
    391,
    "A user has connected a PC to a portable projector, but video does not appear on the screen when the user tests the projector. The user confirms the lens cap was removed from the projector. Which of the following should the user do NEXT?\n",
    [
      [
        "A. Adjust the keystone settings",
        "B. Check the video cable",
        "C. Verify the lamp works",
        "D. Increase the brightness setting"
      ]
    ],
    "Answer : B"
  ],
  [
    392,
    "A laptop is being upgraded. The machine currently has 4GB LPDDR3 soldered to the motherboard and one available RAM slot. Which of the following chips should be selected to upgrade the laptop?\n",
    [
      [
        "A. 2GB LPDDR3 SoDIMM",
        "B. 4GB LPDDR3 DIMM",
        "C. 8GB DDR4 SoDIMM",
        "D. 8GB LPDDR3 DIMM"
      ]
    ],
    "Answer : A"
  ],
  [
    393,
    "Which of the following is typically used for monitoring?\n",
    [["A. IMAP", "B. SMTP", "C. SNMP", "D. CIFS"]],
    "Answer : C"
  ],
  [
    394,
    "Several users reported an outage with a specific application. The help desk identified the problem and suspects the issue is with an on-premises server that was updated recently. The help desk is given authorization to roll back the updates. Which of the following steps is the help desk about to perform?\n",
    [
      [
        "A. Documenting the findings, actions, and outcomes",
        "B. Testing the theory to determine cause to determine the next steps",
        "C. Verifying full system functionality after establishing a plan of action",
        "D. Implementing preventive measures after verifying system functionality"
      ]
    ],
    "Answer : B"
  ],
  [
    395,
    "A software development team is installing a VM on a Linux desktop so the following can be tested:\n✑ An ARM system\n✑ 2GB RAM\n✑ Ethernet with peer visibility\n✑ Two USB ports\n✑ A graphic desktop\n✑ A custom retail sales application\nWhich of the following describes the MOST likely purpose of this VM?\n",
    [
      [
        "A. A WAP controller with logging capability to monitor WiFi access",
        "B. A WiFi analyzer with a display for wireless protocol troubleshooting and security monitoring",
        "C. A PoS terminal with display, credit card terminal, and printer capability",
        "D. An Internet order system for fast-food orders and deliveries"
      ]
    ],
    "Answer : C"
  ],
  [
    396,
    "A customer is purchasing a gaming laptop and wants the maximum number of IOPS. Which of the following hard drives should be installed in the laptop?\n",
    [["A. Hybrid SSD", "B. SATA SSD", "C. NVMe SSD", "D. IDE SSD"]],
    "Answer : C\n\nReference:\nhttps://www.enterprisestorageforum.com/hardware/how-fast-are-nvme-speeds/\n"
  ],
  [
    397,
    "A technician is researching hardware for a new virtualization host and is trying to provide the best performance when the host is running multiple VMs concurrently. Which of the following features would BEST meet this goal?\n",
    [
      [
        "A. Multicore",
        "B. Integrated GPU",
        "C. Liquid cooling",
        "D. Overclocking"
      ]
    ],
    "Answer : A"
  ],
  [
    398,
    "A technician purchases several monitors that are equipped with all modern video connectors. The technician wants to daisy chain these monitors together to extend the desktop of the OS. Which of the following cables would the technician MOST likely use to accomplish this?\n",
    [["A. VGA", "B. DisplayPort", "C. HDMI", "D. DVI"]],
    "Answer : B\n\nReference:\nhttps://www.hp.com/us-en/shop/tech-takes/how-to-daisy-chain-monitors\n"
  ],
  [
    399,
    "A thin client in a VDI environment receives the OS by connecting to the network through a number of devices. Which of the following is FIRST in the chain?\n",
    [["A. NIC", "B. Router", "C. VLAN", "D. Switch"]],
    "Answer : A"
  ],
  [
    400,
    "A user contacts the help desk to report the Internet is not working. Which of the following steps should the technician take NEXT?\n",
    [
      [
        "A. Document possible reasons why the Internet is no longer working",
        "B. Have the user perform a hard shutdown and a cold boot",
        "C. Instruct the user to disconnect the Ethernet cable for 30 seconds",
        "D. Ask questions and use available tools to clarify the issue"
      ]
    ],
    "Answer : D"
  ],
  [
    401,
    "A SOHO wireless network must be configured to allow IoT devices on the network. Which of the following settings MOST likely needs to be configured?\n",
    [
      [
        "A. DMZ setup",
        "B. Channel utilization",
        "C. Security passphrase",
        "D. Port forwarding",
        "E. SSID broadcast disabled"
      ]
    ],
    "Answer : D"
  ],
  [
    402,
    "A computer freezes shortly after loading the operating system. A technician inspects the computer and obtains the following diagnostic information:\n\n\n\nWhich of the following should the technician investigate further?\n",
    [
      [
        "A. The memory clock speed settings",
        "B. The integrity of the hard drive",
        "C. The CPU temperatures",
        "D. The power supply voltage",
        "E. The GPU temperatures"
      ]
    ],
    "Answer : C"
  ],
  [
    403,
    "A user is having trouble printing and has asked a technician for help. The technician is able to print remotely from the print server. Which of the following will the technician MOST likely need to perform NEXT? (Choose two.)\n",
    [
      [
        "A. Modify the environment variables on the computer",
        "B. Check the AD account settings for the user",
        "C. Replace the printerג€™s network cable ",
        "D. Clear the print queue on the server",
        "E. Check the network settings on the computer",
        "F. Delete all the files from the server print spooler"
      ]
    ],
    "Answer : DE"
  ],
  [
    404,
    "A device has an IP address of fe80:2efa:57a2::35a7. Which of the following BEST describe this address? (Choose two.)\n",
    [
      [
        "A. Link local",
        "B. Broadcast",
        "C. Multicast",
        "D. IPv4",
        "E. IPv6",
        "F. APIPA"
      ]
    ],
    "Answer : AE"
  ],
  [
    405,
    "A business owner needs to print multiple copies of the same document but does not want to separate each copy once printed. Which of the following should a technician configure to accomplish this task?\n",
    [
      [
        "A. Landscape printing",
        "B. Collated printing",
        "C. Duplex printing",
        "D. Draft mode printing"
      ]
    ],
    "Answer : B"
  ],
  [
    406,
    "Which of the following peripherals would be the BEST option for a company that wants to be able to display a receipt and allow a customer to sign it?\n",
    [
      [
        "A. Touchpad",
        "B. Signature pad",
        "C. Touch-screen monitor",
        "D. NFC reader"
      ]
    ],
    "Answer : B"
  ],
  [
    407,
    "A technician receives reports of a website that is returning errors when accessed. A programmer pushed a new version of code to the site the night before. Which of the following steps should the technician take FIRST?\n",
    [
      [
        "A. Test whether the upgrade caused the errors",
        "B. Determine if other users are receiving the same errors",
        "C. Ask the programmer to roll back to a previous version",
        "D. Document the findings related to the cause of the errors"
      ]
    ],
    "Answer : A"
  ],
  [
    408,
    "A company has decided to use Windows thin clients for operations. Which of the following must be done to allow changes to the computersג€™ OS and applications?\n",
    [
      [
        "A. A separate hardware token must be used to authenticate the user",
        "B. The registry must be backed up to allow changes to the computer",
        "C. The disk partition must be formatted as NTFS",
        "D. The configuration must be unlocked"
      ]
    ],
    "Answer : C"
  ],
  [
    409,
    "A userג€™s computer will not boot, and the screen shows the following error: no OS found. During the last week, the computer has been performing slower than normal, and the user has been experiencing a BSOD. Which of the following will MOST likely resolve the issue?\n",
    [
      [
        "A. Run the DiskPart command",
        "B. Replace the hard drive",
        "C. Install more RAM",
        "D. Upgrade to a faster CPU"
      ]
    ],
    "Answer : B"
  ],
  [
    410,
    "Which of the following devices passes traffic between two different subnets?\n",
    [["A. Hub", "B. Bridge", "C. Switch", "D. Router"]],
    "Answer : D"
  ],
  [
    411,
    "A technician is installing and configuring a storage array on a Windows server. There are four disk slots available, and the only requirement is that the RAID array survives the loss of two drives. Which of the following RAID levels should be used?\n",
    [["A. 1", "B. 5", "C. 10", "D. 60"]],
    "Answer : D\n\nReference:\nhttps://www.prepressure.com/library/technology/raid\n"
  ],
  [
    412,
    "A service technician made some changes to the BIOS, and now the computer is unable to boot. Which of the following actions should the technician take to restore the default settings?\n",
    [
      [
        "A. Load the registry from a backup",
        "B. Remove the CMOS battery",
        "C. Perform a hard reset",
        "D. Completely drain the lithium-ion battery"
      ]
    ],
    "Answer : B"
  ],
  [
    413,
    "A user reports a corporate computer, which was recently moved, can no longer print to the default printer. A technician verifies all the cables are connected, power cycles the printer, and restarts the PC but still cannot print to the default printer. The technician notices an identical printer in Devices and Printers that ends with\n(copy1). The (copy1) printer prints without issue. Which of the following MOST likely caused the issue when the computer was moved?\n",
    [
      [
        "A. The Microsoft XPS printer was set as the default printer after the PC came back up",
        "B. The user did not shut down the computer correctly before moving it and unplugging the power",
        "C. Updates loaded when the PC was shut down, which updated the printer drivers",
        "D. The user moved the printerג€™s USB cable to a different USB port on the desktop "
      ]
    ],
    "Answer : A"
  ],
  [
    414,
    "A technician is replacing a display on a laptop and wants it to have the highest video quality available. Which of the following should the technician install?\n",
    [["A. LED", "B. LCD", "C. IPS LCD", "D. OLED"]],
    "Answer : D"
  ],
  [
    415,
    "A home user installed a new high-end video card for 3D gaming and virtual reality into a mid-tower PC. The user frequently experiences sudden shutdowns in the middle of game play across multiple applications. Which of the following troubleshooting steps should be taken to isolate the issue? (Choose two.)\n",
    [
      [
        "A. Verify if the current power strip ampere rating is sufficient",
        "B. Inspect the battery in the uninterruptible power supply",
        "C. Examine cooling requirements to determine if the current cooling solution is adequate",
        "D. Confirm the latest patches for all impacted applications are installed",
        "E. Check the BIOS configuration settings to ensure all fans are on automatic",
        "F. Determine if the current power supply is capable of meeting the requirements"
      ]
    ],
    "Answer : CF"
  ],
  [
    416,
    "Joe, a user, provides the requirements for a new gaming PC to the assigned technician. Joe wants the PC to have high-quality graphics, audio/video, and storage.\nIn addition, the PC must be able to:\n✑ Store a large amount of data\n✑ Stream HD graphics, videos, and music\n\nHave fast and redundant storage -\n\n\n\nWhich of the following will BEST meet these requirements? (Choose two.)\n",
    [
      [
        "A. File sharing",
        "B. RAID array",
        "C. Specialized audio and video card",
        "D. Maximum RAM",
        "E. HDD",
        "F. SSD"
      ]
    ],
    "Answer : CF"
  ],
  [
    417,
    "A potential customer of cloud servers needs the ability to ramp up computing resources quickly during traffic spikes. Which of the following features is MOST pertinent to providing this business need?\n",
    [
      [
        "A. Rapid elasticity",
        "B. Resource pooling",
        "C. Measured service",
        "D. On demand"
      ]
    ],
    "Answer : A"
  ],
  [
    418,
    "A technician will be installing a workstation with virtualization software. On which of the following system requirements should the technician focus? (Choose two.)\n",
    [["A. BD-R", "B. GPU", "C. RAM", "D. LAN", "E. SATA", "F. CPU"]],
    "Answer : CF"
  ],
  [
    419,
    "Which of the following types of cables is used to provide high-speed voice and data connections in a datacenter to Layer 3 devices?\n",
    [
      ["A. HDMI", "B. Multimode fiber", "C. Thunderbolt", "D. SATA", "E. Cat 5"]
    ],
    "Answer : B"
  ],
  [
    420,
    "A customer wants to install a new computer in a room that does not have any network drops. The customer authorizes a technician to install a new network jack in the room. Which of the following tools should the technician use to finish installing the new network jack?\n",
    [["A. Multimeter", "B. Loopback plug", "C. Crimper", "D. Punchdown tool"]],
    "Answer : C"
  ],
  [
    421,
    "Which of the following allows for the BEST cellular data connections under optimal conditions?\n",
    [["A. 3G", "B. LTE", "C. 802.11b", "D. WiMAX"]],
    "Answer : B"
  ],
  [
    422,
    "Which of the following wireless networking protocols will broadcast at 5GHz frequencies?\n",
    [["A. 802.11ac", "B. 802.11b", "C. 802.11g", "D. 802.11q", "E. 802.11x"]],
    "Answer : A"
  ],
  [
    423,
    "A user is working on a Windows laptop in a conference room that has connectivity to a large-screen TV. The user attempts to connect to the TV using HDMI and\nVGA cables, but video does not display on the TV. Which of the following is the MOST likely cause of the issue?\n",
    [
      [
        "A. The TV resolution does not match the laptop",
        "B. Screen mirroring is disabled",
        "C. The screen brightness is set too low",
        "D. There is a bad composite cable"
      ]
    ],
    "Answer : B"
  ],
  [
    424,
    "A technician is gathering the requirements for a laptop that needs the smallest form factor and the fastest speeds possible for data storage. Which of the following, if used together, will BEST satisfy these requirements? (Choose two.)\n",
    [
      [
        "A. 2.5in form factor",
        "B. 3.5in form factor",
        "C. SATA",
        "D. NVMe",
        "E. M.2 form factor",
        "F. SCSI"
      ]
    ],
    "Answer : DE"
  ],
  [
    425,
    "Which of the following devices allows administrators to prioritize network traffic based on the protocol type?\n",
    [["A. Bridge", "B. Access point", "C. Hub", "D. Managed switch"]],
    "Answer : D"
  ],
  [
    426,
    "The touch-screen feature on a Windows device has stopped working completely. Which of the following should a technician check FIRST?\n",
    [
      [
        "A. Device Manager",
        "B. Performance Monitor",
        "C. System Configuration",
        "D. Sync Center"
      ]
    ],
    "Answer : C"
  ],
  [
    427,
    "A technician is installing VoIP phones. Which of the following extra cables would the technician MOST likely bring to the site to complete the connections?\n",
    [
      [
        "A. RJ45 terminated cables",
        "B. SATA terminated cables",
        "C. BNC terminated cables",
        "D. RG-59 terminated cables"
      ]
    ],
    "Answer : A"
  ],
  [
    428,
    "A technician is concerned that a newly pulled Cat 5e run is longer than recommended by specification. Which of the following tools should the technician use to measure the length of the run?\n",
    [["A. Tone generator", "B. Probe", "C. Multimeter", "D. Cable tester"]],
    "Answer : D"
  ],
  [
    429,
    "Which of the following cable types transmits in an analog format?\n",
    [["A. USB-C", "B. VGA", "C. DVI-D", "D. HDMI"]],
    "Answer : B"
  ],
  [
    430,
    "Which of the following is the BEST example of cloud-based IaaS?\n",
    [
      [
        "A. A service that allows programmers to write and compile code in the cloud",
        "B. A service that manages and restricts mobile devices via the cloud",
        "C. A service that provides hardware to host multiple virtualized servers in the cloud",
        "D. A service that hosts and manages email services for a corporation in the cloud"
      ]
    ],
    "Answer : C"
  ],
  [
    431,
    "Which of the following ports would allow for the remote management of network devices using community strings? (Choose two.)\n",
    [["A. 138", "B. 139", "C. 161", "D. 162", "E. 388", "F. 389"]],
    "Answer : CD"
  ],
  [
    432,
    "Which of the following use the same non-keyed form factor to interface peripherals to a computer? (Choose two.)\n",
    [
      [
        "A. SATA",
        "B. SCSI",
        "C. Lightning",
        "D. Thunderbolt 3",
        "E. HDMI",
        "F. USB Type C"
      ]
    ],
    "Answer : DF"
  ],
  [
    433,
    "Which of the following can be used to collect and read the data that is generated by event error messages from several servers centrally?\n",
    [["A. UTM", "B. Proxy", "C. Syslog", "D. IPS"]],
    "Answer : C"
  ],
  [
    434,
    "A technician is upgrading the memory in a workstation. While the case is open, the technician cleans out all the dust that has accumulated around the components. The technician installs the memory and then attempts to boot the system, but the system gets stuck while displaying the following message:\n\nBoot media not found -\nWhich of the following will MOST likely fix the issue and allow the system to boot properly?\n",
    [
      [
        "A. Remove the new memory modules.",
        "B. Reseat the hard drive cables.",
        "C. Replace the graphics card.",
        "D. Reapply thermal paste to the CPU."
      ]
    ],
    "Answer : A"
  ],
  [
    435,
    "Which of the following uses NFC to complete financial transactions?\n",
    [
      [
        "A. Magnetic strip",
        "B. Chip reader",
        "C. Smart card",
        "D. Tap-to-pay device"
      ]
    ],
    "Answer : D"
  ],
  [
    436,
    "A technician is upgrading the memory in a server. Which of the following RAM features would MOST likely be used in the server?\n",
    [["A. Non-parity", "B. Unregistered", "C. Error correcting", "D. DDR4"]],
    "Answer : C"
  ],
  [
    437,
    "A power supply with a 24-pin connector is used natively on:\n",
    [
      [
        "A. ATX motherboards.",
        "B. AT motherboards.",
        "C. BT motherboards.",
        "D. ITX motherboards."
      ]
    ],
    "Answer : A"
  ],
  [
    438,
    "A technician is setting up a multifunction printer in an enterprise. Users of this device regularly print documents containing PII. Which of the following settings has the GREATEST security implications for the technician to consider?\n",
    [
      [
        "A. AirPrint",
        "B. Network sharing",
        "C. Hard drive caching",
        "D. Bluetooth settings"
      ]
    ],
    "Answer : B"
  ],
  [
    439,
    "Which of the following cloud models places all responsibility for operating system and application maintenance on the customer?\n",
    [
      [
        "A. Private PaaS",
        "B. Community SaaS",
        "C. Private SaaS",
        "D. Public IaaS"
      ]
    ],
    "Answer : D"
  ],
  [
    440,
    "A company subscribes to a vendor for office software that is delivered via the Internet rather than installed on each workstation. The company is using:\n",
    [["A. PaaS.", "B. SaaS.", "C. NaaS.", "D. IaaS."]],
    "Answer : A"
  ],
  [
    441,
    "Using cloud-based servers is an example of:\n",
    [["A. PaaS.", "B. DBaaS.", "C. IaaS.", "D. SaaS."]],
    "Answer : C"
  ],
  [
    442,
    "A technician needs to implement a disk array in a configuration that will prevent data loss in the event of a disk failure but also provide the benefit of increased performance. Which of the following would provide the BEST combination of fault tolerance and read/write performance?\n",
    [["A. RAID 0", "B. RAID 1", "C. RAID 5", "D. RAID 10"]],
    "Answer : D"
  ],
  [
    443,
    "A user recently purchased a new smartphone, and the phoneג€™s performance has since degraded. A technician examines the phone and determines its performance has decreased due to a lack of available storage space. Which of the following devices will the technician MOST likely install in the phone to increase the storage?\n",
    [["A. CompactFlash", "B. MicroSD", "C. xD", "D. SD", "E. MiniSD"]],
    "Answer : B"
  ],
  [
    444,
    "Which of the following types of IP addresses would MOST likely be assigned to a server in a corporate environment?\n",
    [["A. APIPA", "B. Link local", "C. Dynamic", "D. Static"]],
    "Answer : D"
  ],
  [
    445,
    "A user is unable to access any LAN resources, such as network shares or printers, but is able to surf the Internet. Which of the following troubleshooting steps should a technician perform FIRST?\n",
    [
      [
        "A. Inquire about infrastructure changes.",
        "B. Perform a complete system backup.",
        "C. Document findings and actions.",
        "D. Establish a theory of probable cause."
      ]
    ],
    "Answer : D"
  ],
  [
    446,
    "A charging pad for a mobile device is no longer working and needs to be replaced. Until then, which of the following alternatives can be used to charge the mobile device?\n",
    [["A. USB-C", "B. Ethernet", "C. RJ11", "D. Coaxial"]],
    "Answer : A"
  ],
  [
    447,
    "A user powers on a desktop computer, and the following error appears on the monitor: OS not found. The user notes there are no visual indications of an error. A reboot yields the same result. Which of the following is the MOST likely cause of the issue?\n",
    [
      [
        "A. The system partition is set to active.",
        "B. A USB flash drive that contains offline diagnostics is plugged in.",
        "C. The CD-ROM drive contains a Windows setup disk.",
        "D. The boot order has changed."
      ]
    ],
    "Answer : D"
  ],
  [
    448,
    "A technician needs to secure and optimize traffic on a local network by separating client workstations from web servers. The technician only has administrative permissions on the Layer 2 switch to which all of the devices are connected. Which of the following should the technician complete to accomplish this goal?\n",
    [
      [
        "A. Create a separate DHCP scope for the web servers.",
        "B. Implement an ACL on the switch.",
        "C. Place the web servers in a DMZ.",
        "D. Configure the web servers in a separate VLAN.",
        "E. Set up the web servers on a different domain."
      ]
    ],
    "Answer : D"
  ],
  [
    449,
    "A technician needs to determine why a PC reboots after a short period of use. The technician installs a hardware monitoring application as part of the troubleshooting process. Which of the following is the MOST likely cause of the issue?\n",
    [
      [
        "A. Bad sectors on the HDD",
        "B. Bad CMOS battery",
        "C. Overutilized power supply",
        "D. High storage utilization"
      ]
    ],
    "Answer : B"
  ],
  [
    450,
    "Multiple independent software developers share the same cloud infrastructure for hosting their healthcare applications. Which of the following cloud types BEST describes the model in use?\n",
    [["A. Hybrid", "B. Community", "C. Public", "D. Private"]],
    "Answer : B"
  ],
  [
    451,
    "Which of the following frequencies is used to provide 802.11n wireless connectivity in smaller ranges with less probability of interference?\n",
    [["A. 2.4GHz", "B. 5GHz", "C. 50MHz", "D. 900MHz"]],
    "Answer : A"
  ],
  [
    452,
    "A user reports a complete loss of data. A technician determines the data was stored on an external drive, and the drive light is working properly. Which of the following steps should the technician perform NEXT?\n",
    [
      [
        "A. Configure a temporary drive and install backup software.",
        "B. Reseat the memory, reboot the computer, and check the logs.",
        "C. Replace the drive cable and run diagnostics on the drive.",
        "D. Boot into BIOS and verify the onboard drive size and settings."
      ]
    ],
    "Answer : C"
  ],
  [
    453,
    "Which of the following devices is susceptible to broadcast storms if configured incorrectly?\n",
    [["A. Access point", "B. Router", "C. Switch", "D. Cable modem"]],
    "Answer : B"
  ],
  [
    454,
    "A user received a new workstation but is unable to print successfully to the shared network printer. Other users are able to print without issues. Some recent OS updates were applied to the workstation, and all other services are working fine. The technician checks the printerג€™s properties and notices it is configured for\nLPT1. Which of the following should be performed NEXT to troubleshoot the issue?\n",
    [
      [
        "A. Update the printer description name.",
        "B. Clean the print heads.",
        "C. Restart the print spooler.",
        "D. Configure a new printer port."
      ]
    ],
    "Answer : D"
  ],
  [
    455,
    "A technician needs to install a PSU into a desktop. The required wattage is 420W. Which of the following power supply sizes should the technician install to meet the minimum power requirement?\n",
    [["A. 220W", "B. 400W", "C. 500W", "D. 800W"]],
    "Answer : C"
  ],
  [
    456,
    "A technician is setting up a VM to house a legacy application that is used to control the swipe-style card readers for a companyג€™s entrance doors. The application needs to be able to access all locations on the WAN. Which of the following requirements is the MOST important to configure properly on the VM?\n",
    [["A. CPU", "B. RAM", "C. Network", "D. Storage"]],
    "Answer : C"
  ],
  [
    457,
    "A manager reports there is no network connectivity at a desk that has been empty for several months. The jack on the port has no label. Which of the following would be BEST for a technician to use to trace the port connection back to the wiring closet?\n",
    [
      [
        "A. A crimper",
        "B. A punchdown tool",
        "C. A multimeter",
        "D. A tone generator and a probe"
      ]
    ],
    "Answer : C"
  ],
  [
    458,
    "A printer is printing all jobs in portrait mode, and the user needs to change it to landscape mode only. Which of the following settings should the user modify on the printer?\n",
    [["A. Orientation", "B. Quality", "C. Collate", "D. Duplex"]],
    "Answer : A"
  ],
  [
    459,
    "A user needs to run multiple VMs simultaneously. When combined, the VMs will equal more specifications than the userג€™s machine currently contains. The user understands this is not ideal because the VMs will run slower. Which of the following virtualization requirements does this utilize?\n",
    [["A. Emulator", "B. Security", "C. Network", "D. Resource"]],
    "Answer : D"
  ],
  [
    460,
    "A VoIP handset needs to replace a legacy phone in an area that has no electrical outlets nearby but does have various network ports available. Which of the following technologies would MOST likely complete the installation?\n",
    [["A. Access point", "B. DSL modern", "C. Router", "D. PoE switch"]],
    "Answer : D"
  ],
  [
    461,
    "A technician just installed and configured a replacement desktop at the front desk of an office. After installing the manufacturerג€™s universal print driver for a laser multifunction printer, the technician notices the test print yields a page full of garbled characters. The technician power cycles the printer and the desktop, but the issue remains. The desktop is able to print to a color inkjet in another part of the office with no issues. Which of the following should the technician attempt to resolve the issue?\n",
    [
      [
        "A. Increase the memory capacity on the printer.",
        "B. Replace the laser printerג€™s driver ",
        "C. Restart the laser printerג€™s spooler service. ",
        "D. Install an updated color profile."
      ]
    ],
    "Answer : B"
  ],
  [
    462,
    "A user is building a VM that will house a database that stores sensitive information. The database will also include a large number of CAD drawings. Which of the following is MOST important when building the VM?\n",
    [
      [
        "A. Number of CPU cores",
        "B. VM version",
        "C. Disk space",
        "D. RAM usage"
      ]
    ],
    "Answer : C"
  ],
  [
    463,
    "Which of the following server types should be used to process outside authentication requests?\n",
    [["A. DNS", "B. Proxy", "C. RADIUS", "D. Web"]],
    "Answer : C"
  ],
  [
    464,
    "A user in a multitenant office building is having issues connecting to company printers and shares but is able to connect to the Internet via WiFi. Which of the following should a technician do FIRST when troubleshooting this issue?\n",
    [
      [
        "A. Check which SSID is in use.",
        "B. Test the connections with an Ethernet cable.",
        "C. Install all OS updates.",
        "D. Update the wireless NIC drivers."
      ]
    ],
    "Answer : B"
  ],
  [
    465,
    "A customer has procured extra money in the budget for a new server. The customer wants to update the infrastructure so devices will be matched against a database of company assets and allowed or denied access to resources on the network. Which of the following server types should a technician install?\n",
    [["A. Proxy", "B. Syslog", "C. Authentication", "D. DNS"]],
    "Answer : C"
  ],
  [
    466,
    "A company requires the ability to control, optimize, and report user network storage automatically. Which of the following cloud concepts can achieve this?\n",
    [
      [
        "A. Rapid elasticity",
        "B. Measured service",
        "C. On demand self-service",
        "D. Resource pooling"
      ]
    ],
    "Answer : A"
  ],
  [
    467,
    "A userג€™s workstation no longer boots. A technician arrives and confirms the workstation will not boot, and while troubleshooting notices a burning smell coming from the chassis of the workstation. The technician replaces the power cable and tries to boot again, but the smell returns and the machine does not boot. Which of the following components MOST likely needs to be replaced?\n",
    [["A. UPS", "B. RAM", "C. Heat sink", "D. Hard drive", "E. PSU"]],
    "Answer : E"
  ],
  [
    468,
    "An end user reports being unable to connect to the Internet. A technician tries to ping a well-known site and gets no response. When running ipconfig, the technician notices the IP address of the workstation is 169.254.255.254 with a subnet mask of 255.255.0.0. Which of the following is MOST likely causing the problem?\n",
    [
      [
        "A. The proxy server is configured incorrectly.",
        "B. The subnet mask needs to be changed.",
        "C. The DHCP server pool is exhausted.",
        "D. The DNS cache needs to be flushed."
      ]
    ],
    "Answer : C"
  ],
  [
    469,
    "A technology refresh will be performed on all mobile phones and PCs in a sales department. Joe, the sales manager, is concerned his personal data on his phone, such as contacts, pictures, and videos, will be replaced. Which of the following should be performed before the device is refreshed to save the data without compromising security?\n",
    [
      [
        "A. Synchronize the device to a flash drive remotely.",
        "B. Synchronize data across the network to a shared public folder.",
        "C. Synchronize the device to a private cloud.",
        "D. Synchronize data to a virtual machine in the datacenter."
      ]
    ],
    "Answer : C"
  ],
  [
    470,
    "A technician is setting up a networked printer in a SOHO. Several users will frequently submit multipage reports, and the printer will use its own integrated print server for managing jobs. Which of the following should be configured to BEST keep the pages sorted?\n",
    [["A. Collate", "B. Orientation", "C. Duplex", "D. Quality"]],
    "Answer : A"
  ],
  [
    471,
    "Which of the following network types is used to provide network connectivity between remote branch offices?\n",
    [["A. WMN", "B. LAN", "C. PAN", "D. WAN", "E. WLAN"]],
    "Answer : D"
  ],
  [
    472,
    "A technician is setting up the storage on a server and uses three SCSI hot-swappable hard drives. The technician configures a RAID array that uses all three drives. Therefore, if one of the drives fails, it can be pulled and replaced with a new drive, and the array will rebuild itself. Which of the following RAID configurations is the technician setting up?\n",
    [["A. 0", "B. 1", "C. 5", "D. 10"]],
    "Answer : C"
  ],
  [
    473,
    "Joe, a user, dropped his laptop right before a company webinar. During the webinar, the other participants could hear but not see Joe. A technician ran system diagnostics and verified the camera was enabled. Replacing which of the following will MOST likely resolve the issue?\n",
    [
      [
        "A. Hinges",
        "B. Inverter",
        "C. Antenna connectors",
        "D. Bezel",
        "E. Digitizer"
      ]
    ],
    "Answer : D"
  ],
  [
    474,
    "A technician is troubleshooting an aging system that reboots randomly, loses its BIOS settings intermittently, and operates very slowly when it boots up. After checking the BIOS battery and finding it at a good voltage, which of the following should the technician check NEXT?\n",
    [
      [
        "A. RAID battery",
        "B. Processor seating",
        "C. Distended capacitors",
        "D. RAM seating"
      ]
    ],
    "Answer : C"
  ],
  [
    475,
    "As part of a wireless network upgrade, a home user replaced an older 802.11g WAP with one that only works on 802.11ac. Consequently, many network devices can no longer connect. Which of the following is the MOST likely reason?\n",
    [
      [
        "A. The old devices require a WAP capable of supporting MIMO.",
        "B. The new WAP is not broadcasting its SSID.",
        "C. The new WAP uses WPA2, which is not compatible with the 802.11g devices.",
        "D. 802.11ac only operates on 5GHz, and the user has many 2.4GHz devices."
      ]
    ],
    "Answer : D"
  ],
  [
    476,
    "Employees are reporting the image on the screen in a conference room is too wide at the top and too narrow at the bottom. A technician tries to adjust the resolution but is unsuccessful. Which of the following settings should the technician adjust NEXT?\n",
    [["A. Contrast", "B. Pincushion", "C. Brightness", "D. Keystone"]],
    "Answer : D"
  ],
  [
    477,
    "A technician is adding LTE-based connectivity to a laptop. The laptop has the following slots available:\n✑ One SoDIMM slot\n✑ One SATA III slot\n✑ One mini PCIe slot\n✑ One microSD card slot\nWhich of the following should the technician install to complete this task?\n",
    [
      [
        "A. WWAN card in the mini PCIe slot",
        "B. MicroSDXC card in the microSD slot",
        "C. 802.11ac card in the SATA III slot",
        "D. DDR4 3200 chip in the SoDIMM slot"
      ]
    ],
    "Answer : A"
  ],
  [
    478,
    "A junior technician is working on a new server that will intercept web traffic and file requests from usersג€™ computers and retrieve the necessary content. Which of the following is the technician configuring?\n",
    [
      [
        "A. DNS server",
        "B. Authentication server",
        "C. Proxy server",
        "D. Web server",
        "E. File server",
        "F. DHCP server"
      ]
    ],
    "Answer : C"
  ],
  [
    481,
    "A customer wants to purchase a single device that can route traffic. perform firewall and forwarding functions, and inspect incoming packets for malicious software. Which of the following should a technician recommend?\n",
    [["A. UTM", "B. WAP", "C. IDS", "D. SAN"]],
    "Answer : A"
  ],
  [
    482,
    "A business owner needs to print many large documents but is concerned about using a lot of paper. Which of the following should a technician configure to conserve paper when printing large documents?\n",
    [
      [
        "A. Collated printing",
        "B. Landscape printing",
        "C. Draft mode printing",
        "D. Duplex printing"
      ]
    ],
    "Answer : D"
  ],
  [
    483,
    "Which of the following is the standard number of pins on an ATX connector that connects from the PSU to the motherboard?\n",
    [["A. 8", "B. 16", "C. 24", "D. 32"]],
    "Answer : C"
  ],
  [
    484,
    "A research and development department is upgrading a desktop application for its engineers. The files and data are stored on the server and checked out. Design work is performed on the desktop and then checked back in to the server. Which of the following types of applications is this an example of?\n",
    [
      [
        "A. Thin client",
        "B. Thick client",
        "C. Virtual desktop",
        "D. Web desktop"
      ]
    ],
    "Answer : C\n\nReference:\nhttps://docs.microsoft.com/en-us/azure/virtual-desktop/overview\n"
  ],
  [
    485,
    "Ann, a user, calls the help desk to request a Windows 10 VM on her workstation to test a third-party application. Ann is concerned about the system instability, since the application is resource intensive and requires a minimum of 8GB of RAM, two processor cores, and 250GB of HDD space. Annג€™s machine currently has\n32GB of RAM, an eight-core processor, and a 2TB HDD. Which of the following BEST describes a system configuration that will ensure both VM and host system stability?\n",
    [
      [
        "A. Configure the VM with one processor core, 6GB of RAM, and 250GB of HDD space",
        "B. Configure the VM with two processor core, 8GB of RAM, and 250GB of HDD space",
        "C. Configure the VM with three processor core, 12GB of RAM, and 350GB of HDD space",
        "D. Configure the VM with four processor core, 16GB of RAM, and 500GB of HDD space"
      ]
    ],
    "Answer : B"
  ],
  [
    486,
    "Joe, a user, reports that airplane mode is enabled on his smartphone when he is flying. Joe wants to be able to use the airlineג€™s Internet service without disabling airplane mode. Which of the following can Joe perform to achieve this goal?\n",
    [
      [
        "A. Pair the smartphone with an LTE hotspot",
        "B. Enable WiFi after enabling airplane mode",
        "C. Install the airlineג€™s official mobile application ",
        "D. Set up tethering to a personal laptop"
      ]
    ],
    "Answer : C"
  ],
  [
    487,
    "A user replaced a failed CPU on a desktop PC. During post-repair testing, the PC shut off shortly after a successful POST and before the OS could fully load. The user calls a technician for assistance. Which of the following should the technician perform FIRST?\n",
    [
      [
        "A. Ensure thermal paste was applied",
        "B. Check the motherboard for distended capacitors",
        "C. Verify processor compatibility with the motherboard",
        "D. Look for BIOS updates from the manufacturer"
      ]
    ],
    "Answer : C"
  ],
  [
    488,
    "A user is unable to stream audio from a smartphone to a house speaker. Which of the following BEST explains the reason for this issues?\n",
    [
      [
        "A. Bluetooth is not configured properly",
        "B. The smartphone is not configured for MDM",
        "C. The data-saving feature is enabled on the smartphone",
        "D. The smartphone is using a proxy or VPN"
      ]
    ],
    "Answer : A\n\nReference:\nhttps://www.noterepeat.com/products/ion/portable-audio/788-tips-for-pairing-your-bluetooth-speaker-with-a-compatible-device\n"
  ],
  [
    489,
    "Joe, a user, recently installed a new mouse for his laptop. Joe no longer uses a mouse pad because his office desk has a glass top. Joe notices that when he is at the office, the cursor moves on the screen when he does not move the mouse; however, it works fine when he is traveling. Which of the following is MOST likely cause?\n",
    [
      [
        "A. The device drivers are outdated",
        "B. Bluetooth is disabled",
        "C. The mouse is faulty",
        "D. The surface is too reflective"
      ]
    ],
    "Answer : D"
  ],
  [
    490,
    "A few users have been noticing ongoing degradation of performance in a VDI environment. A technician checks the environment and discovers the shared VM is experiencing maximum CPU utilization. Which of the following will the technician MOST likely configure to resolve the issue?\n",
    [
      [
        "A. Network capacity",
        "B. Resource pooling",
        "C. Memory allocation",
        "D. Replication scripts"
      ]
    ],
    "Answer : B"
  ],
  [
    491,
    "A user calls the help desk to report a network printer that will not print. The technician knows this printer is shared from a print server. Which of the following should the technician do FIRST to resolve the issue?\n",
    [
      [
        "A. Reinstall the print driver on the server",
        "B. Open the print queue for that printer and clear any stuck or failed jobs",
        "C. Restart the print server and have the user try printing again",
        "D. Remap the printer to the userג€™s computer "
      ]
    ],
    "Answer : B"
  ],
  [
    492,
    "A user is unable to access network resources on a laptop. A technician examines the device and attempts to reproduce the issue. The technician cannot connect to resources by name or IP. Which of the following should the technician check FIRST?\n",
    [
      [
        "A. AP power levels",
        "B. DNS server availability",
        "C. Upstream router WAN IP",
        "D. Wireless button state"
      ]
    ],
    "Answer : D"
  ],
  [
    493,
    "The Chief Executive Officer wants to ensure company data is stored in a manner that provides the company with complete control over how the data is managed.\nWhich of the following is the BEST cloud deployment model for this request?\n",
    [["A. Community", "B. Hybrid", "C. Public", "D. Private"]],
    "Answer : D\n\nReference:\nhttps://azure.microsoft.com/en-us/overview/what-are-private-public-hybrid-clouds/#deployment-options\n"
  ],
  [
    494,
    "A sales executiveג€™s personal laptop occasionally freezes while checking email.\nWhich of the following should a technician do FIRST?\n",
    [
      [
        "A. Check the network connectivity.",
        "B. Consider the corporate policy.",
        "C. Request details about the problem.",
        "D. Run hardware diagnostics."
      ]
    ],
    "Answer : A"
  ],
  [
    495,
    "Which of the following mobile devices offers the BEST viewing display in direct sunlight?\n",
    [["A. Laptop", "B. E-reader", "C. Tablet", "D. Smartphone"]],
    "Answer : B\n\nReference:\nhttps://www.professormesser.com/free-a-plus-training/220-1001/mobile-devices-2/\n"
  ],
  [
    496,
    "A high-end workstation is operating as expected, but two of the four SATA drives are displaying solid fault lights.\nWhich of the following is the MOST likely reason for this issue?\n",
    [
      [
        "A. RAID 5 is being used.",
        "B. The RAID level of the disk array is 10.",
        "C. An M.2 boot device is being used.",
        "D. The RAID controller cache is turned on."
      ]
    ],
    "Answer : D\n\nReference:\nhttps://www.thomas-krenn.com/en/wiki/RAID_Controller_and_Hard_Disk_Cache_Settings\n"
  ],
  [
    497,
    "An organization keeps receiving spam that appears to come from its own domain. No accounts have been compromised.\nWhich of the following will BEST mitigate this issue?\n",
    [["A. DNS", "B. S/MIME", "C. SPF", "D. SSID"]],
    "Answer : B\n\nReference:\nhttps://en.wikipedia.org/wiki/S/MIME\n"
  ],
  [
    498,
    "A laser printer is consistently having issues picking up paper from the tray as the print is initiated. There are no problems with print quality.\nWhich of the following parts should be replaced FIRST?\n",
    [["A. The fuser", "B. The tray", "C. The toner", "D. The rollers"]],
    "Answer : B\n\nReference:\nhttps://okiprinting-en-gb.custhelp.com/app/answers/detail/a_id/201/~/the-printer-is-having-problems-feeding-paper-from-the-tray\n"
  ],
  [
    499,
    "A technician receives a call from a user regarding a message that has appeared on several office computers. The message states the computers have been encrypted and require payment to recover the data. First, the technician instructs the user to disconnect the computers from the network. The technician then troubleshoots the issue by identifying the problem and developing a theory about what happened.\nWhich of the following steps of the troubleshooting process should the technician complete NEXT?\n",
    [
      [
        "A. Test the theory to determine the cause.",
        "B. Document findings, actions, and outcomes.",
        "C. Establish a plan of action to resolve the problem.",
        "D. Verify full system functionality and implement preventive measures."
      ]
    ],
    "Answer : A\n\nReference:\nhttps://www.dummies.com/programming/certification/comptia-troubleshooting-process-certification-exams/\n"
  ],
  [
    500,
    "Which of the following connectors will work with a 9-pin null modem adapter?\n",
    [["A. RG-59", "B. RS-232", "C. SCSI", "D. eSATA"]],
    "Answer : B\n\nReference:\nhttps://en.wikipedia.org/wiki/RS-232\n"
  ],
  [
    501,
    "A company needs to implement data protection and local drive redundancy on a few workstations. To accommodate these needs, the company is having a network storage device installed so it can perform nightly backups.\nWhich of the following are MOST necessary for this device? (Choose two.)\n",
    [
      [
        "A. Hyperthreading CPU",
        "B. Gigabit NIC",
        "C. Maximum RAM",
        "D. High-end cooling",
        "E. High-end video",
        "F. RAID array"
      ]
    ],
    "Answer : BF"
  ],
  [
    502,
    "A new application server was installed on the network, but users are only able to connect to it by IP address instead of hostname. Which of the following server types needs to be configured?\n",
    [["A. DNS", "B. File", "C. DHCP", "D. Syslog"]],
    "Answer : A\n\nReference:\nhttps://www.cloudflare.com/learning/dns/what-is-dns/\n"
  ],
  [
    503,
    "Which of the following network devices is used to forward data from one device to another device on the same LAN?\n",
    [["A. Switch", "B. Router", "C. Hub", "D. Modem", "E. Bridge"]],
    "Answer : A\n\nReference:\nhttps://www.networkworld.com/article/3584876/what-is-a-network-switch-and-how-does-it-work.html#:~:text=Switches%20typically%20connect%\n20LAN%20segments,as%20well%20as%20network%20bandwidth\n"
  ],
  [
    504,
    "Which of the following cloud computing concepts allows a seasonal website to add servers so it can handle the increased capacity?\n",
    [
      [
        "A. Shared resources",
        "B. Resource pooling",
        "C. Rapid elasticity",
        "D. Measured services"
      ]
    ],
    "Answer : C\n\nReference:\nhttps://blog.turbonomic.com/blog/on-technology/cloud-elasticity-vs-cloud-scalability\n"
  ],
  [
    505,
    "A user wants to synchronize confidential information on a computer and a smartphone.\nWhich of the following would provide the MOST security during the synchronization process?\n",
    [
      [
        "A. Mutual authentication",
        "B. VPN over WiFi",
        "C. Bluetooth",
        "D. Physical connection"
      ]
    ],
    "Answer : D"
  ],
  [
    506,
    "A technician installed a Cat 5 UTP cable approximately 275ft (84m) from a network switch in an office to a workstation located on a factory floor. The technician sees both a flashing green LED and a flashing orange LED on the workstationג€™s NIC.\nWhich of the following should the technician do FIRST?\n",
    [
      [
        "A. Check the RJ45 end connectors, the jacks, and the ends of the run of the Cat 5 UTP cable for loose connections, pinched bends, and visible damage.",
        "B. Install a powered hub as close as possible to the halfway point in the Cat 5 UTP cable run.",
        "C. Replace the entire run of Cat 5 UTP cable with Cat 5 STP cable.",
        "D. Run continuity tests using an Ethernet cable tester to determine if any pairs are broken."
      ]
    ],
    "Answer : D\n\nReference:\nhttps://techwithtech.com/ethernet-light-blinking-orange-green/\n"
  ],
  [
    507,
    "A Chief Executive Officer (CEO) asks a technician to recommend a hosted model that will allow the company to use existing hardware until its end of life and expand the internal/external footprint.\nWhich of the following models will the technician MOST likely recommend to the CEO?\n",
    [
      [
        "A. Private cloud",
        "B. PaaS",
        "C. Hybrid cloud",
        "D. IaaS",
        "E. Public cloud"
      ]
    ],
    "Answer : C\n\nReference:\nhttps://www.ibm.com/cloud/learn/hybrid-cloud\n"
  ],
  [
    508,
    "A company recently upgraded its network and now wants to repurpose the old workstations. The company has determined the hardware in the workstations is sufficient for processing data, but the workstations are bottlenecked by network speed.\nWhich of the following would be the MOST cost-efficient solution to mitigate the slow network speeds?\n",
    [
      [
        "A. Upgrade to triple-channel RAM.",
        "B. Install hubs for every workstation.",
        "C. Upgrade the workstations with a newer NIC.",
        "D. Upgrade the motherboard in the workstations."
      ]
    ],
    "Answer : C\n\nReference:\nhttps://www.mcmcse.com/comptia/network/network_interface_cards.shtml\n"
  ],
  [
    509,
    "A home office user notices the output from their new inkjet printer is poor quality.\nWhich of the following actions should the user take FIRST to correct the problem?\n",
    [
      [
        "A. Replace the ink cartridges.",
        "B. Check the DPI settings.",
        "C. Realign the print heads.",
        "D. Clean the print heads."
      ]
    ],
    "Answer : D\n\nReference:\nhttps://www.wikihow.com/Clean-Print-Heads\n"
  ],
  [
    510,
    "In which of the following scenarios would an APIPA address be assigned to a workstation on a network?\n",
    [
      [
        "A. If a technician assigned the user the wrong static IP address.",
        "B. If the workstationג€™s port was assigned to the wrong VLAN on the switch. ",
        "C. If DNS services were stopped on the domain controller.",
        "D. If there are no DHCP servers available on the network."
      ]
    ],
    "Answer : D\n\nReference:\nhttps://docs.microsoft.com/en-us/windows-server/troubleshoot/how-to-use-automatic-tcpip-addressing-without-a-dh\n"
  ],
  [
    511,
    "Which of the following cloud service models is hosted email an example of?\n",
    [["A. DaaS", "B. SaaS", "C. PaaS", "D. IaaS"]],
    "Answer : B"
  ],
  [
    512,
    "An IT manager discovered that hundreds of pages of printed materials are being recycled each day because the materials are left on the printer tray instead of being picked up by users.\nWhich of the following would BEST prevent this waste?\n",
    [
      [
        "A. Send friendly reminders to not print unnecessarily.",
        "B. Enable duplex printing to reduce paper utilization.",
        "C. Bill each department for the excess material cost.",
        "D. Require a code or badge before releasing a print job."
      ]
    ],
    "Answer : C"
  ],
  [
    513,
    "A technician has been asked to terminate a 60-pair Cat3 bundle at the IDF on a 110 block.\nWhich of the following tools should the technician use to complete the task?\n",
    [["A. Punchdown", "B. Crimper", "C. Loopback plug", "D. Cable stripper"]],
    "Answer : A\n\nReference:\nhttps://en.wikipedia.org/wiki/110_block\n"
  ],
  [
    514,
    "A customerג€™s cell phone screen is discolored in several areas.\nWhich of the following components is the MOST likely cause of the issue?\n",
    [
      [
        "A. Bulging battery",
        "B. Wired connectors",
        "C. Liquid crystal display",
        "D. Phone case",
        "E. Protective glass"
      ]
    ],
    "Answer : C"
  ],
  [
    515,
    "Which of the following is the PRIMARY security concern with virtual machine escape?\n",
    [
      [
        "A. Cross-site scripting",
        "B. Compromising the hypervisor",
        "C. Overutilization of resources",
        "D. Rogue VMs installed on the hypervisor"
      ]
    ],
    "Answer : B\n\nReference:\nhttps://whatis.techtarget.com/definition/virtual-machine-escape\n"
  ],
  [
    516,
    "Which of the following connectors would be found on an ATX power supply?\n",
    [["A. DB9", "B. Molex", "C. eSATA", "D. BNC"]],
    "Answer : B\n\nReference:\nhttps://en.wikipedia.org/wiki/ATX\n"
  ],
  [
    517,
    "A technician has been directed to install a new department printer. The department requirements specify that users should print multiple copies of reports on both sides of the paper so reports can be distributed quickly.\nWhich of the following settings must the technician enable to meet the departmentג€™s needs? (Choose two.)\n",
    [
      [
        "A. Duplex",
        "B. Collate",
        "C. Orientation",
        "D. Quality",
        "E. Privacy",
        "F. Media type"
      ]
    ],
    "Answer : AB"
  ],
  [
    518,
    "A network administrator was notified that laptop users are unable to see a shared folder on the corporate network.\nWhich of the following would BEST ensure the laptops are configured correctly?\n",
    [["A. DHCP", "B. AAA", "C. DNS", "D. UTM"]],
    "Answer : C"
  ],
  [
    519,
    "A datacenter analyst is building a server configuration for a client, and it must be designed so that memory corruption and errors are minimized.\nWhich of the following types of RAM would be the MOST appropriate for this system?\n",
    [["A. DDR2", "B. DDR3", "C. Parity RAM", "D. ECC RAM"]],
    "Answer : D\n\nReference:\nhttps://en.wikipedia.org/wiki/ECC_memory\n"
  ],
  [
    520,
    "A technician requests a port be opened on the firewall in order to manage switches using SSH.\nWhich of the following ports should be opened?\n",
    [["A. 21", "B. 22", "C. 23", "D. 25"]],
    "Answer : B\n\nReference:\nhttps://www.iana.org/assignments/service-names-port-numbers/service-names-port-numbers.xhtml?search=ssh\n"
  ],
  [
    521,
    "Which of the following is a data transfer standard that transfers 16 bits of data at a time to hard disks?\n",
    [["A. IDE", "B. USB", "C. SATA", "D. FireWire"]],
    "Answer : A\n\nReference:\nhttps://en.wikipedia.org/wiki/Hard_disk_drive_interface\n"
  ],
  [
    522,
    "A technician recently set up a VM on a client PC to create and test software. The technician has since discovered the virtual environment has no external connectivity. The technician verifies the host has an Internet connection. Which of the following should the technician do NEXT to resolve the issue?\n",
    [
      [
        "A. Configure a static IP for the VM and enable bridged networking.",
        "B. Create a host record with the IP address and hostname of the VM and store it on the host.",
        "C. Configure a dynamic IP for the host and the VM.",
        "D. Configure a dynamic IP for the host and disable any host intrusion detection software."
      ]
    ],
    "Answer : A"
  ],
  [
    523,
    "Which of the following connector types does not require a specific orientation?\n",
    [["A. MicroUSB", "B. USB-C", "C. USB-A", "D. MiniUSB"]],
    "Answer : B\n\nReference:\nhttps://www.pcmag.com/how-to/what-is-usb-c-an-explainer\n"
  ],
  [
    524,
    "A technician needs to improve a workstation's overall response time for frequently used applications and data without removing the current hard drive. Which of the following storage devices should the technician install to BEST accomplish the objective?\n",
    [["A. M.2", "B. SAS", "C. HDD", "D. SCSI"]],
    "Answer : A\n\nReference:\nhttps://www.backblaze.com/blog/nvme-vs-m-2-drives/\n"
  ],
  [
    525,
    "All static IP addresses are assigned from a central location. Which of the following is the BEST method for a technician to use to assign static IP addresses while keeping an automatic record of the addresses that have already been assigned?\n",
    [
      [
        "A. Set up a DHCP pool for the entire subnet and exclusions for each static IP address that is needed.",
        "B. Create a spreadsheet and record each IP address and the device to which it is assigned.",
        "C. Set up DHCP reservations for all static IP addresses that need to be assigned.",
        "D. Create a separate subnet for each device type on the network that needs an IP address."
      ]
    ],
    "Answer : C"
  ],
  [
    526,
    "When installing three 2.4GHz access points in close proximity, which of the following channel selections would be BEST?\n",
    [["A. 1, 6, 11", "B. 2, 3, 9", "C. 2, 4, 7", "D. 8, 10, 11"]],
    "Answer : A\n\nReference:\nhttps://www.accessagility.com/blog/best-wifi-channel-to-use-for-2.4-ghz#:~:text=For%20best%20results%2C%20it%20is,overlap%20in%20the%\n20WiFi%20signal\n"
  ],
  [
    527,
    "Which of the following cloud computing concepts allows a provider to bill a client for the amount of resources the client uses?\n",
    [
      [
        "A. Measured service",
        "B. Private cloud",
        "C. Rapid elasticity",
        "D. Hybrid cloud"
      ]
    ],
    "Answer : A\n\nReference:\nhttps://www.techopedia.com/definition/14469/measured-service-cloud-computing\n"
  ],
  [
    528,
    "A user is looking for a top-of-the-line gaming computer but is prone to motion sickness. The user wants to be able to talk to players and participate the game without using a keyboard. Which of the following should a technician recommend? (Choose two.)\n",
    [
      [
        "A. Speakers",
        "B. VR headset",
        "C. Headset",
        "D. Protector",
        "E. Game controller",
        "F. Microphone"
      ]
    ],
    "Answer : CE"
  ],
  [
    529,
    "A hardware technician is configuring a laptop, and the network administrator requires the network settings to be static. The technician successfully pings the servers by IP address but cannot ping the UNC path. Which of the following is the cause of this issue?\n",
    [["A. Domain Name System", "B. Gateway", "C. Subnet", "D. IP address"]],
    "Answer : A"
  ],
  [
    530,
    "Which of the following network components is used to connect devices and can efficiently route data to specific destination addresses to minimize packet collisions and improve throughput?\n",
    [["A. Modem", "B. Repeater", "C. Switch", "D. Hub"]],
    "Answer : C\n\nReference:\nhttps://www.networkworld.com/article/3584876/what-is-a-network-switch-and-how-does-it-work.html\n"
  ],
  [
    531,
    "Joe, an office manager, is concerned about printing and electrical costs. He requires all staff members to shut down their computers when away from their desks.\nHe also wants to limit printer use to only times when he is at his desk. Which of the following should Joe do to enforce this restriction? (Choose two.)\n",
    [
      [
        "A. Configure the printer on WiFi in Joe's office.",
        "B. Enable file and printer sharing on Joe's computer.",
        "C. Enable cloud printing on the printer using Joe's email account.",
        "D. Disable point spooling on all other users' computers.",
        "E. Install the printer via USB to Joe's computer.",
        "F. Connect the printer through Ethernet at Joe's desk."
      ]
    ],
    "Answer : BE"
  ],
  [
    532,
    "A company just bought a printer capable of automatically printing on both sides of the paper. After installation, however, the technician can only print on both sides of the paper manually. Which of the following should the technician do to fix the issue?\n",
    [
      [
        "A. Install the most recent firmware upgrade available for the printer",
        "B. Contact the vendor for a hardware replacement",
        "C. Reinstall the printer software and drivers, and then restart the printer",
        "D. Read the installation manual and configure duplex settings"
      ]
    ],
    "Answer : D"
  ],
  [
    533,
    "A network administrator receives a ticket following a power outage that states the wireless network is down. The administrator discovers the SSID is broadcasting, but data is not being transmitted. Which of the following should the network administrator do FIRST?\n",
    [
      [
        "A. Restart the access point",
        "B. Reset the access point to default",
        "C. Change the access point's frequency",
        "D. Replace the access pointג€™s patch cable "
      ]
    ],
    "Answer : A"
  ],
  [
    534,
    "Users all over campus are calling the help desk to report issues connecting to the Internet. The help desk follows a script to ask questions about their issues. All the users answer the questions similarly. A help desk technician confirms no environmental changes have taken place and is currently looking through multiple system and application logs. Which of the following steps in the troubleshooting methodology is the technician currently performing?\n",
    [
      [
        "A. Testing the theory to determine cause",
        "B. Identifying the problem",
        "C. Documenting findings, actions, and outcomes",
        "D. Establishing a plan of action to resolve the issue"
      ]
    ],
    "Answer : B"
  ],
  [
    535,
    "A user is performing an ipconfig but does not see the expected IP address. The user wants to perform a release and renew of the IP to see if that will fix the issue. Which of the following is the user utilizing?\n",
    [["A. VLAN", "B. NAT", "C. DNS", "D. DHCP"]],
    "Answer : D"
  ],
  [
    536,
    "A technician needs to install a printer on the network. Which of the following must the technician configure? (Choose three.)\n",
    [
      [
        "A. PCL",
        "B. Dots per inch",
        "C. Gateway",
        "D. Subnet mask",
        "E. MAC address",
        "F. IMEI",
        "G. IP address",
        "H. Drivers"
      ]
    ],
    "Answer : CDG"
  ],
  [
    537,
    "Ann, a user, realizes she forgot to pack her laptop's AC adapter when she was preparing for a business trip. She calls the help desk to ask how to maximize her battery life until she returns to the office. Which of the following are the BEST solutions? (Choose two.)\n",
    [
      [
        "A. Disable the speakers.",
        "B. Dim the screen's brightness.",
        "C. Turn on wireless.",
        "D. Turn off Bluetooth.",
        "E. Turn on GPS.",
        "F. Mute the microphone."
      ]
    ],
    "Answer : BD"
  ],
  [
    538,
    "A systems administrator at a school is setting up computing devices with keyboards. All the devices need to have an identical build. The administrator knows from prior experience that students often spill food or drinks on their devices. Which of the following is the BEST option for the administrator to use?\n",
    [["A. Thick clients", "B. Thin clients", "C. Laptops", "D. Workstations"]],
    "Answer : D"
  ],
  [
    539,
    "Which of the following cloud computing concepts provides the ability to scale services as needed to accommodate changes?\n",
    [
      [
        "A. Measured service",
        "B. On-demand",
        "C. Rapid elasticity",
        "D. Resource pooling"
      ]
    ],
    "Answer : C\n\nReference:\nhttps://www.techopedia.com/definition/29526/rapid-elasticity\n"
  ],
  [
    540,
    "A technician logs on to a PC and inserts an encrypted USB drive. When opening File Explorer, the technician cannot see the USB drive. Which of the following tools should the technician use to see all drives?\n",
    [["A. DiskPart", "B. Diskmgmt", "C. Disk Cleanup", "D. BitLocker"]],
    "Answer : D"
  ],
  [
    541,
    "A technician for a cable provider is setting up high-speed Internet service at a residential customerג€™s home. The type of cabling the technician will use to connect from the outside pole into the customerג€™s home is MOST likely:\n",
    [["A. coaxial.", "B. plenum.", "C. Cat 5e.", "D. STP."]],
    "Answer : A"
  ],
  [
    542,
    "A user asks a technician for recommendations for building a gaming computer. The user has already ordered a high-end power supply, motherboard, and CPU.\nWhich of the following recommendations would the technician MOST likely make for this configuration? (Choose three.)\n",
    [
      [
        "A. NVMe drive",
        "B. Gigabit NIC",
        "C. Webcam",
        "D. Dual monitors",
        "E. Graphics processing unit",
        "F. RAM",
        "G. Virtual reality headset",
        "H. Hybrid SSD/HDD drive"
      ]
    ],
    "Answer : AEF"
  ],
  [
    543,
    "An IT manager is requesting that the company buy new cables to be used with F-type connectors that are already in-house. Which of the following cables should the company buy?\n",
    [["A. Coaxial", "B. Plenum", "C. Cat 5e", "D. Fiber"]],
    "Answer : A\n\nReference:\nhttps://en.wikipedia.org/wiki/F_connector\n"
  ],
  [
    544,
    "A technician deployed a new computer and patched the unit to the data jack. However, no Ethernet connection is detected. The technician suspects the patch panel is incorrectly numbered. Which of the following tools will the technician MOST likely use to locate the jack on the patch panel?\n",
    [
      [
        "A. A multimeter",
        "B. A tone generator and a probe",
        "C. A loopback plug",
        "D. A cable tester"
      ]
    ],
    "Answer : B"
  ],
  [
    545,
    "An engineer is experiencing unexpected reboots on a graphics workstation when rendering complex 3-D models. The workstation is configured with a 115V power supply that is rated at 200W and connected to a UPS. The central processing unit contains 16 hyperthreaded cores, and a discrete graphics solution utilizing an 8- pin power connector is installed in a PCI Express x16 slot. Which of the following indicates where the technician should begin troubleshooting?\n",
    [
      [
        "A. The UPS, as 115V is insufficient for the configuration and should be increased to 220V",
        "B. The power supply, as 200W is insufficient when the GPU is heavily tasked",
        "C. The graphics card, as it is the component that triggers the unexpected reboots",
        "D. The motherboard, as only standard PCI slots should be used for high-end graphics cards, not PCI Express slots"
      ]
    ],
    "Answer : B"
  ],
  [
    546,
    "A technician is implementing a SOHO wireless solution with three access points. Which of the following actions would avoid high latency?\n",
    [
      [
        "A. Enabling and configuring a 5GHz antenna",
        "B. Configuring separate IP ranges",
        "C. Enabling multiple SSIDs",
        "D. Configuring all devices with different channels"
      ]
    ],
    "Answer : D"
  ],
  [
    547,
    "A technician needs to convert an existing workstation to host several virtual test computers and servers. Which of the following must be installed and configured on the workstation before any virtual computers can be installed?\n",
    [
      [
        "A. Terminal emulator",
        "B. Hypervisor",
        "C. Remote desktop",
        "D. Guest OS"
      ]
    ],
    "Answer : B\n\nReference:\nhttps://www.pluralsight.com/blog/it-ops/what-is-hypervisor#:~:text=These%20hypervisors%20are%20run%20as,system%20to%20do%20its%20work\n"
  ],
  [
    548,
    "A userג€™s laptop is making a loud clicking noise, and the battery life is shorter than expected. Which of the following storage options would a technician MOST likely install to address the user's issues?\n",
    [["A. MicroSD", "B. 15,000rpm HDD", "C. SAS SSD", "D. SATA SSD"]],
    "Answer : B"
  ],
  [
    549,
    "A company's IT department frequently needs to work on several machines at once. The department wants to increase productivity by allowing a single mouse, keyboard, and monitor to instantly shift between one of eight computers on a workbench. Which of the following would BEST facilitate this approach?\n",
    [
      [
        "A. KVM switch",
        "B. Docking station",
        "C. USB and HDMI extension cables",
        "D. Bluetooth-enabled peripherals"
      ]
    ],
    "Answer : A\n\nReference:\nhttps://en.wikipedia.org/wiki/KVM_switch\n"
  ],
  [
    550,
    "A customer wants to synchronize mobile data but is concerned that it might be readily available to other devices no matter the location. Which of the following is the BEST method for the customer to use?\n",
    [["A. BD-R", "B. Cloud", "C. SD card", "D. External HDD"]],
    "Answer : B"
  ],
  [
    551,
    "A user brings in an older laptop to the help desk and reports issues with the keyboard. Upon inspection, the technician does not see any external damage but notices that many keystrokes do not register in a word processor. The laptop works fine when the technician tests it with an external keyboard. Which of the following actions would MOST likely resolve the issue?\n",
    [
      [
        "A. Disable the Sticky Keys feature",
        "B. Clean the keyboard",
        "C. Reset the BIOS settings to default",
        "D. Charge the laptop"
      ]
    ],
    "Answer : B"
  ],
  [
    552,
    "A fast-food restaurant has been using a printer to create sales receipts on a PoS kiosk. The restaurant recently purchased a new brand of receipt paper rolls. After installing one of the new rolls, the printer outputs blank paper. Which of the following is the MOST likely cause of the issue?\n",
    [
      [
        "A. The ink cartridge is empty.",
        "B. The pickup rollers are dirty.",
        "C. The transfer belt is defective.",
        "D. Non-thermal paper is installed."
      ]
    ],
    "Answer : D\n\nReference:\nhttps://pandapaperroll.com/receipt-paper-types/\n"
  ]
]
